[
  {
    "judul": "A review on deep learning autoencoder in the design of next-generation communication systems",
    "publisher": "arxiv.org",
    "author": ["Alnaseri, O", "Alzubaidi, L", "Himeur, Y"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2412.13843",
    "rumusan_masalah": "Bagaimana peran dan penerapan deep learning autoencoder dalam merancang sistem komunikasi generasi berikutnya?",
    "penelitian_terkini": "Studi ini meninjau pendekatan deep learning khususnya autoencoder dalam sistem komunikasi modern seperti komunikasi optik (FSO), termasuk penerapan deep belief network (DBN) untuk proses demodulasi panjang gelombang dan denoising sinyal.",
    "hasil_yang_diharapkan": "Menjelaskan potensi dan efektivitas arsitektur autoencoder dalam meningkatkan performa transmisi dan pengolahan sinyal di sistem komunikasi masa depan.",
    "tantangan": "Kompleksitas model deep learning, kebutuhan data pelatihan besar, serta kesesuaian model dengan lingkungan komunikasi yang dinamis.",
    "hasil_akhir": "Autoencoder terbukti mampu meningkatkan kualitas sinyal dan mendukung sistem komunikasi canggih, namun masih dibutuhkan penelitian lebih lanjut untuk optimalisasi dan penerapan skala luas."
  },

  {
    "judul": "LSTM-Autoencoder For Faster-Than-Nyquist Optical Wireless MIMO Communication System",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Xingyu, Z", "Minghua, C", "Yue, Z", "Luxia, Z"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10808071/",
    "rumusan_masalah": "Bagaimana penerapan LSTM-autoencoder dapat meningkatkan efisiensi sistem komunikasi MIMO optik nirkabel dengan laju lebih cepat dari Nyquist?",
    "penelitian_terkini": "Studi ini mengembangkan sistem komunikasi nirkabel optik MIMO generasi mendatang yang menggantikan modul transmisi konvensional dengan jaringan neural, khususnya LSTM-autoencoder.",
    "hasil_yang_diharapkan": "Meningkatkan efisiensi transmisi data dan mengurangi kompleksitas sistem dengan memanfaatkan deep learning untuk menggantikan komponen tradisional dalam komunikasi optik MIMO.",
    "tantangan": "Integrasi jaringan neural dalam sistem komunikasi fisik secara langsung, validasi performa di berbagai kondisi kanal optik, serta kebutuhan pelatihan model yang presisi.",
    "hasil_akhir": "LSTM-autoencoder berhasil diterapkan untuk menggantikan modul transmisi tradisional, memberikan kinerja tinggi dalam komunikasi optik nirkabel dengan efisiensi spektral yang lebih baik dari batas Nyquist."
  },

  {
    "judul": "Attention-assisted autoencoder neural network for end-to-end optimization of multi-access fiber-terahertz communication systems",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Li, Z", "Dong, B", "Li, G", "Jia, J", "Sun, A", "Shen, W"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10235947/",
    "rumusan_masalah": "Bagaimana mengoptimalkan sistem komunikasi fiber-terahertz multi-akses secara end-to-end menggunakan autoencoder berbasis attention?",
    "penelitian_terkini": "Penelitian ini mengembangkan sistem komunikasi fiber-terahertz terintegrasi secara end-to-end dengan pendekatan autoencoder neural network yang dilengkapi modul attention (AMAE).",
    "hasil_yang_diharapkan": "Meningkatkan efisiensi dan kapasitas sistem fiber-terahertz melalui pemrosesan otomatis berbasis deep learning, mengurangi ketergantungan pada desain blok manual.",
    "tantangan": "Kompleksitas integrasi attention mechanism dalam autoencoder, serta keandalan transmisi pada frekuensi tinggi seperti THz.",
    "hasil_akhir": "AMAE berhasil mengoptimalkan performa sistem fiber-terahertz secara menyeluruh, dan telah mendapat 10 sitasi sejak tahun 2023 sebagai bukti kontribusi signifikan pada bidang komunikasi optik canggih."
  },

  {
    "judul": "Internet of Things Data Transfer Method Using Neural Network Autoencoder",
    "publisher": "infotelesc.kpi.ua",
    "author": ["Siemens, E", "Kurdecha, V", "Ushakov, S"],
    "tahun": 2023,
    "sumber_data": "http://infotelesc.kpi.ua/article/view/281959",
    "rumusan_masalah": "Bagaimana metode autoencoder berbasis neural network dapat digunakan untuk mentransfer data dalam sistem Internet of Things (IoT)?",
    "penelitian_terkini": "Penelitian mengembangkan model DeepZip yang memanfaatkan Recurrent Neural Network (RNN) dan teori informasi untuk mengompresi dan mentransfer data IoT secara efisien.",
    "hasil_yang_diharapkan": "Mengurangi ukuran data yang ditransfer dalam sistem IoT dengan tetap mempertahankan integritas informasi melalui metode pembelajaran sekuensial.",
    "tantangan": "Menghadapi tantangan kompleksitas kompresi data sekuensial waktu nyata dan efisiensi algoritma dalam perangkat IoT yang memiliki sumber daya terbatas.",
    "hasil_akhir": "Model DeepZip berhasil menunjukkan efisiensi dalam mentransfer data IoT dengan menggunakan RNN, dan telah mendapat 7 sitasi sejak 2023, membuktikan relevansi pendekatan ini dalam pengembangan komunikasi IoT."
  },

  {
    "judul": "Attention-aided autoencoder-based channel prediction for intelligent reflecting surface-assisted millimeter-wave communications",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Chen, HY", "Wu, MH", "Yang, TW"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10120965/",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi prediksi kanal pada komunikasi gelombang milimeter yang dibantu oleh intelligent reflecting surface (IRS) menggunakan autoencoder dengan attention mechanism?",
    "penelitian_terkini": "Penelitian ini mengusulkan model convolutional denoising autoencoder yang dibantu oleh attention untuk memprediksi kanal komunikasi IRS-mmWave, menggantikan metode LSTM tradisional yang sensitif terhadap inisialisasi bobot acak.",
    "hasil_yang_diharapkan": "Meningkatkan keandalan dan akurasi prediksi kanal dalam sistem IRS-mmWave melalui pendekatan autoencoder berbasis attention.",
    "tantangan": "Sensitivitas model seperti LSTM terhadap inisialisasi bobot acak, serta kebutuhan pengolahan sinyal yang efisien pada frekuensi tinggi.",
    "hasil_akhir": "Model autoencoder berbasis attention berhasil menunjukkan performa superior dalam prediksi kanal IRS-mmWave dan telah memperoleh 14 sitasi sejak 2023, menandakan pengaruh penting di bidang komunikasi generasi baru."
  },

  {
    "judul": "Enhancing intrusion detection systems: Innovative deep learning approaches using CNN, RNN, DBN and autoencoders for robust network security",
    "publisher": "ph.pollub.pl",
    "author": ["HOSSAIN, Y", "FERDOUS, Z", "WAHID, T"],
    "tahun": 2025,
    "sumber_data": "https://ph.pollub.pl/index.php/acs/article/view/6667",
    "rumusan_masalah": "Bagaimana meningkatkan sistem deteksi intrusi (IDS) menggunakan pendekatan deep learning seperti CNN, RNN, DBN, dan autoencoder untuk mencapai keamanan jaringan yang lebih kuat?",
    "penelitian_terkini": "Penelitian ini mengevaluasi dan menggabungkan beberapa pendekatan deep learning, termasuk convolutional neural networks (CNN), recurrent neural networks (RNN), deep belief networks (DBN), dan autoencoder, untuk membangun IDS yang adaptif dan tangguh.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi intrusi yang lebih akurat, efisien, dan mampu beradaptasi terhadap berbagai jenis serangan jaringan secara real-time.",
    "tantangan": "Mengelola kompleksitas model deep learning secara efisien untuk data lalu lintas jaringan besar dan variatif serta memastikan generalisasi model terhadap ancaman baru.",
    "hasil_akhir": "Model gabungan deep learning ini berhasil meningkatkan kemampuan IDS dan telah memperoleh 2 sitasi sejak awal tahun 2025, menunjukkan potensi kontribusi dalam bidang keamanan siber berbasis AI."
  },

  {
    "judul": "Elephant Flows Detection Using Deep Neural Network, Convolutional Neural Network, Long Short‐Term Memory, and Autoencoder",
    "publisher": "Wiley Online Library",
    "author": ["Geremew, G Wassie", "Ding, J"],
    "tahun": 2023,
    "sumber_data": "https://onlinelibrary.wiley.com/doi/abs/10.1155/2023/1495642",
    "rumusan_masalah": "Bagaimana mendeteksi elephant flows dalam jaringan menggunakan pendekatan deep learning seperti DNN, CNN, LSTM, dan autoencoder?",
    "penelitian_terkini": "Penelitian ini menggabungkan berbagai teknik deep learning, termasuk CNN, LSTM, dan autoencoder, untuk membangun sistem deteksi aliran data besar (elephant flows) yang akurat dan efisien.",
    "hasil_yang_diharapkan": "Mengidentifikasi elephant flows secara tepat waktu untuk mendukung manajemen lalu lintas jaringan dan mencegah kemacetan atau gangguan performa jaringan.",
    "tantangan": "Membandingkan performa berbagai model deep learning dengan dataset pelatihan dan validasi agar diperoleh model terbaik yang mampu bekerja optimal dalam kondisi jaringan nyata.",
    "hasil_akhir": "Model berbasis deep learning berhasil mendeteksi elephant flows dengan performa tinggi dan telah mendapat 11 sitasi sejak 2023, menunjukkan kontribusinya dalam pengelolaan jaringan cerdas berbasis AI."
  },

  {
    "judul": "Nonlinearity mitigation in a fiber-wireless integrated system based on low-complexity autoencoder and BiLSTM-ANN equalizer",
    "publisher": "opg.optica.org",
    "author": [
      "Liu, X",
      "Zhang, J",
      "Zhu, M",
      "Tong, W",
      "Xin, Z",
      "Wang, Y",
      "Lei, M"
    ],
    "tahun": 2023,
    "sumber_data": "https://opg.optica.org/abstract.cfm?uri=oe-31-12-20005",
    "rumusan_masalah": "Bagaimana mengurangi dampak nonlinieritas dalam sistem terintegrasi fiber-wireless menggunakan autoencoder berkompleksitas rendah dan equalizer BiLSTM-ANN?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan berbasis autoencoder dan BiLSTM-ANN untuk mengatasi distorsi nonlinier dalam sistem komunikasi optik dan nirkabel terintegrasi.",
    "hasil_yang_diharapkan": "Mengurangi kesalahan transmisi akibat nonlinieritas dengan cara yang efisien dan hemat sumber daya menggunakan model deep learning ringan.",
    "tantangan": "Mencapai keseimbangan antara akurasi mitigasi nonlinieritas dan kompleksitas perhitungan, serta membandingkan efektivitas berbagai model autoencoder.",
    "hasil_akhir": "Model yang diajukan berhasil meningkatkan kinerja sistem fiber-wireless terintegrasi dengan kompleksitas rendah, dan telah disitasi 8 kali sejak tahun 2023, menunjukkan efektivitas dan kontribusinya di bidang komunikasi optik canggih."
  },

  {
    "judul": "Symbol detection and channel estimation for space optical communications using neural network and autoencoder",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Elfikky, A", "Rezki, Z"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10373105/",
    "rumusan_masalah": "Bagaimana mendeteksi simbol dan melakukan estimasi kanal secara efisien dalam sistem komunikasi optik ruang angkasa menggunakan neural network dan autoencoder?",
    "penelitian_terkini": "Penelitian ini mengembangkan model autoencoder inovatif untuk membangun sistem komunikasi lapisan fisik secara lengkap, khususnya dalam konteks komunikasi optik di luar angkasa.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi simbol dan estimasi kanal pada sistem komunikasi ruang dengan pendekatan pembelajaran mesin end-to-end.",
    "tantangan": "Menghadapi kondisi ekstrem dan distorsi saluran pada komunikasi optik ruang, serta merancang arsitektur autoencoder yang mampu beradaptasi dengan variabilitas kanal.",
    "hasil_akhir": "Model autoencoder dan neural network yang diajukan terbukti efektif dalam komunikasi optik ruang dan telah disitasi sebanyak 11 kali sejak tahun 2023, menandakan kontribusinya terhadap sistem komunikasi luar angkasa berbasis AI."
  },

  {
    "judul": "Autoencoder-Based Neural Network Model for Anomaly Detection in Wireless Body Area Networks",
    "publisher": "mdpi.com",
    "author": ["Rassam, MA"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/2624-831X/5/4/39",
    "rumusan_masalah": "Bagaimana menggunakan model neural network berbasis autoencoder untuk mendeteksi anomali dalam Wireless Body Area Networks (WBANs)?",
    "penelitian_terkini": "Penelitian ini mengembangkan model autoencoder convolutional neural network (CNN) untuk deteksi anomali dalam jaringan WBAN dengan pendekatan berbasis error rekonstruksi.",
    "hasil_yang_diharapkan": "Mendeteksi gangguan atau aktivitas abnormal secara akurat dalam sistem WBAN secara otomatis dan efisien untuk mendukung layanan kesehatan berbasis IoT.",
    "tantangan": "Menjaga akurasi deteksi tinggi dalam kondisi sinyal bising dan mempertahankan efisiensi komputasi untuk perangkat wearable dengan daya terbatas.",
    "hasil_akhir": "Model autoencoder-CNN menunjukkan potensi tinggi untuk deteksi anomali WBAN dan telah disitasi sebanyak 3 kali sejak 2024, menunjukkan penerimaan awal yang positif dalam komunitas penelitian IoT dan kesehatan digital."
  },

  {
    "judul": "Network intrusion detection system based security system for cloud services using novel recurrent neural network-autoencoder (NRNN-AE) and genetic",
    "publisher": "Trans Tech Publ",
    "author": ["Priya, S", "Ponmagal, RS"],
    "tahun": 2023,
    "sumber_data": "https://www.scientific.net/AST.124.729",
    "rumusan_masalah": "Bagaimana membangun sistem keamanan cloud service yang efektif dengan mendeteksi intrusi jaringan menggunakan NRNN-AE dan algoritma genetika?",
    "penelitian_terkini": "Penelitian ini memperkenalkan algoritma baru NRNN-AE yang menggabungkan recurrent neural network dan autoencoder untuk mengenali pola anomali jaringan serta memprediksi serangan terhadap keamanan jaringan cloud.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi intrusi yang mampu mengidentifikasi variasi perilaku abnormal secara akurat untuk meningkatkan keamanan layanan cloud.",
    "tantangan": "Mengelola keakuratan deteksi dalam lingkungan cloud yang dinamis serta mengoptimalkan kombinasi model deep learning dan algoritma genetika.",
    "hasil_akhir": "NRNN-AE terbukti efektif dalam mendeteksi ancaman keamanan cloud dan telah disitasi 4 kali sejak tahun 2023, menandakan relevansi pendekatannya dalam keamanan siber berbasis AI."
  },

  {
    "judul": "One model to find them all deep learning for multivariate time-series anomaly detection in mobile network data",
    "publisher": "ieeexplore.ieee.org",
    "author": ["González, GG", "Tagliafico, SM"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10345720/",
    "rumusan_masalah": "Bagaimana menerapkan satu model deep learning yang efektif untuk mendeteksi anomali multivariate time-series dalam data jaringan seluler?",
    "penelitian_terkini": "Penelitian menggunakan dataset TELCO untuk menguji stabilitas model seperti vanilla RNN, LSTM, dan Autoencoder dalam mendeteksi anomali pada data jaringan seluler yang kompleks.",
    "hasil_yang_diharapkan": "Membangun pendekatan universal berbasis deep learning yang dapat secara akurat mendeteksi berbagai jenis anomali dalam data multivariate dari jaringan mobile.",
    "tantangan": "Menangani kompleksitas data multivariate time-series dan membandingkan efektivitas beberapa arsitektur deep learning secara adil dan menyeluruh.",
    "hasil_akhir": "Autoencoder dan model deep learning lainnya menunjukkan hasil kompetitif dalam deteksi anomali data jaringan seluler dan artikel ini telah disitasi sebanyak 19 kali sejak 2023, menandakan pengaruh kuatnya di bidang network intelligence dan time-series anomaly detection."
  },

  {
    "judul": "NFA: A neural factorization autoencoder based online telephony fraud detection",
    "publisher": "Elsevier",
    "author": ["Wahid, A", "Msahli, M", "Bifet, A", "Memmi, G"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S235286482300055X",
    "rumusan_masalah": "Bagaimana mendeteksi penipuan dalam teleponi daring secara real-time menggunakan pendekatan autoencoder dan neural factorization?",
    "penelitian_terkini": "Model Neural Factorization Autoencoder (NFA) dirancang untuk menganalisis pola panggilan pelanggan dan mengidentifikasi aktivitas teleponi yang mencurigakan. NFA menggabungkan kekuatan Neural Factorization Machines (NFM) dengan autoencoder dan jaringan saraf lainnya.",
    "hasil_yang_diharapkan": "Mendeteksi panggilan penipuan secara online dengan akurasi tinggi dan respons cepat, berdasarkan pola perilaku pengguna.",
    "tantangan": "Menghadapi dinamika perilaku pengguna, ketidakseimbangan data (fraud vs. non-fraud), dan kebutuhan deteksi waktu nyata dalam skala besar.",
    "hasil_akhir": "Model NFA berhasil mendeteksi penipuan secara efisien dalam sistem telepon daring dan telah disitasi 12 kali sejak 2024, menunjukkan kontribusi kuat dalam keamanan jaringan dan analitik perilaku pelanggan."
  },

  {
    "judul": "Enhancing power generation forecasting in smart grids using hybrid autoencoder long short-term memory machine learning model",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Zafar, A", "Che, Y", "Ahmed, M", "Sarfraz, M", "Ahmad, A"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10288460/",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi peramalan pembangkitan energi dalam smart grid menggunakan model pembelajaran mesin hybrid Autoencoder-LSTM?",
    "penelitian_terkini": "Penelitian ini mengevaluasi efektivitas model Autoencoder-LSTM (AE-LSTM) dalam meramalkan pembangkitan energi dengan menggunakan kombinasi Autoencoder, LSTM, RNN, dan DBN.",
    "hasil_yang_diharapkan": "Menghasilkan model ramalan energi yang lebih akurat dan andal untuk mendukung pengelolaan beban dan efisiensi energi dalam sistem grid pintar.",
    "tantangan": "Kompleksitas dalam mengintegrasikan berbagai jenis model deep learning serta kebutuhan akurasi tinggi pada data yang sangat fluktuatif seperti energi terbarukan.",
    "hasil_akhir": "Model AE-LSTM menunjukkan performa tinggi dalam peramalan energi dan telah disitasi sebanyak 13 kali sejak 2023, menandakan potensi besar untuk aplikasi smart grid berbasis AI."
  },

  {
    "judul": "Deep stacked autoencoder-based long-term spectrum prediction using real-world data",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Pan, G", "Wu, Q", "Ding, G", "Wang, W", "Li, J"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10064355/",
    "rumusan_masalah": "Bagaimana memprediksi spektrum jangka panjang secara akurat menggunakan data dunia nyata dengan pendekatan deep stacked autoencoder dan Bi-LSTM?",
    "penelitian_terkini": "Penelitian menggabungkan stacked autoencoder (SAE) dan Bi-directional LSTM (Bi-LSTM) untuk membentuk arsitektur prediksi spektrum yang mendalam dan tangguh dalam skenario dunia nyata.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi spektrum jangka panjang agar alokasi frekuensi dapat dilakukan secara efisien dan adaptif dalam sistem komunikasi nirkabel.",
    "tantangan": "Pengolahan data spektrum nyata yang bervariasi dan dinamis serta integrasi optimal antara fitur ekstraksi SAE dan pemodelan urutan temporal Bi-LSTM.",
    "hasil_akhir": "Model SAE + Bi-LSTM memberikan hasil prediksi spektrum yang unggul dan telah memperoleh 30 sitasi sejak 2023, mencerminkan dampak signifikan dalam manajemen spektrum dan komunikasi kognitif berbasis AI."
  },

  {
    "judul": "Variational autoencoder-enhanced deep neural network-based detection for MIMO systems",
    "publisher": "Elsevier",
    "author": ["Omondi, G", "Olwal, TO"],
    "tahun": 2023,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2772671123002309",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi deteksi sinyal dalam sistem MIMO menggunakan pendekatan deep neural network yang diperkuat dengan variational autoencoder (VAE)?",
    "penelitian_terkini": "Penelitian ini memperkenalkan model deteksi sinyal berbasis deep neural network yang dipadukan dengan variational autoencoder (VAE-DNN-Det) untuk sistem komunikasi MIMO.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi MIMO yang lebih akurat dan efisien dengan memanfaatkan kekuatan representasi laten dari VAE dalam mendukung klasifikasi DNN.",
    "tantangan": "Mengintegrasikan arsitektur VAE ke dalam pipeline DNN secara efisien tanpa mengorbankan latency serta menghindari overfitting pada data pelatihan MIMO yang kompleks.",
    "hasil_akhir": "Model VAE-DNN-Det menunjukkan peningkatan deteksi sinyal secara signifikan pada sistem MIMO dan telah disitasi sebanyak 9 kali sejak tahun 2023, membuktikan dampaknya dalam pengembangan sistem komunikasi modern berbasis AI."
  },

  {
    "judul": "Cyber attack detection for self-driving vehicle networks using deep autoencoder algorithms",
    "publisher": "mdpi.com",
    "author": ["Alsaade, FW", "Al-Adhaileh, MH"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/1424-8220/23/8/4086",
    "rumusan_masalah": "Bagaimana mendeteksi serangan siber secara efektif dalam jaringan kendaraan otonom menggunakan algoritma deep autoencoder?",
    "penelitian_terkini": "Penelitian ini mengembangkan sistem deteksi intrusi berbasis deep learning untuk jaringan kendaraan otonom (termasuk komunikasi intra-kendaraan, V2V, dan V2I), dengan menggunakan LSTM autoencoder sebagai fondasi utama.",
    "hasil_yang_diharapkan": "Mendeteksi dan mencegah ancaman siber secara real-time dalam sistem transportasi cerdas (ITS), khususnya jaringan kendaraan tanpa pengemudi.",
    "tantangan": "Menangani volume dan variasi tinggi data kendaraan, serta menjamin akurasi dan efisiensi deteksi serangan dalam kondisi mobilitas tinggi.",
    "hasil_akhir": "Model LSTM autoencoder berhasil meningkatkan efektivitas IDS untuk kendaraan otonom, dan artikel ini telah disitasi sebanyak 52 kali sejak 2023, menunjukkan pengaruh signifikan dalam bidang keamanan transportasi cerdas berbasis AI."
  },

  {
    "judul": "Machine learning autoencoder‐based parameters prediction for solar power generation systems in smart grid",
    "publisher": "Wiley Online Library",
    "author": ["Zafar, A", "Che, Y", "Faheem, M", "Abubakar, M", "Ali, S"],
    "tahun": 2024,
    "sumber_data": "https://ietresearch.onlinelibrary.wiley.com/doi/abs/10.1049/stg2.12153",
    "rumusan_masalah": "Bagaimana memprediksi parameter sistem pembangkit listrik tenaga surya secara akurat dalam smart grid menggunakan model machine learning berbasis autoencoder?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan hybrid yang menggabungkan autoencoder dan LSTM (termasuk juga CNN-LSTM dan Autoencoder-LSTM) untuk memprediksi parameter sistem tenaga surya pada data time-series statis.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi parameter sistem pembangkit surya dalam rangka mendukung efisiensi energi dan pengelolaan beban di smart grid.",
    "tantangan": "Mengolah data energi yang kompleks dan fluktuatif, serta memilih arsitektur model yang optimal untuk prediksi parameter dengan noise minimal.",
    "hasil_akhir": "Model yang diusulkan terbukti meningkatkan performa prediktif untuk sistem tenaga surya dan telah disitasi 23 kali sejak 2024, menunjukkan efektivitasnya dalam aplikasi smart energy berbasis AI."
  },

  {
    "judul": "An ensemble deep learning model for cyber threat hunting in industrial internet of things",
    "publisher": "Elsevier",
    "author": ["Yazdinejad, A", "Kazemi, M", "Parizi, RM"],
    "tahun": 2023,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2352864822001833",
    "rumusan_masalah": "Bagaimana membangun model deep learning ansambel yang efektif untuk mendeteksi ancaman siber dalam Industrial Internet of Things (IIoT)?",
    "penelitian_terkini": "Penelitian ini menggunakan model LSTM autoencoder sebagai bagian dari sistem ansambel untuk mendeteksi aktivitas anomali dan ancaman siber pada lingkungan IIoT secara lebih akurat.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan deteksi dini terhadap serangan siber yang menargetkan sistem industri terhubung melalui pendekatan pembelajaran mendalam berbasis LSTM-AE.",
    "tantangan": "Kompleksitas dan keragaman lalu lintas data IIoT, serta tuntutan deteksi real-time dengan tingkat false positive yang rendah.",
    "hasil_akhir": "Model deep learning ansambel berbasis LSTM autoencoder terbukti sangat efektif dan telah disitasi sebanyak 166 kali sejak 2023, menunjukkan dampak besar dalam bidang keamanan siber untuk sistem industri terhubung."
  },

  {
    "judul": "An efficient heuristic-aided adaptive autoencoder-based dilated DNN with attention mechanism for enhancing the performance of the MIMO system in 5G",
    "publisher": "Springer",
    "author": ["Jeyapal, R", "Matrouk, K", "Purushothaman, D"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/article/10.1007/s00530-024-01305-z",
    "rumusan_masalah": "Bagaimana meningkatkan performa sistem MIMO dalam jaringan 5G dengan menggunakan pendekatan autoencoder adaptif dan deep neural network yang dilengkapi attention mechanism?",
    "penelitian_terkini": "Artikel ini memperkenalkan model autoencoder adaptif yang digabung dengan dilated DNN dan mekanisme attention serta dibantu oleh heuristic learning untuk menangani tantangan propagasi multipath dalam komunikasi 5G.",
    "hasil_yang_diharapkan": "Memperkuat efisiensi transmisi sinyal dan ketahanan komunikasi dalam lingkungan MIMO 5G yang padat serta kompleks.",
    "tantangan": "Mengatasi gangguan multipath dan menjaga efisiensi serta latency rendah dalam sistem komunikasi 5G berbasis MIMO yang memiliki lalu lintas data tinggi.",
    "hasil_akhir": "Model yang diusulkan menunjukkan performa yang lebih baik dalam mitigasi gangguan dan efisiensi transmisi sinyal, serta telah disitasi 4 kali sejak 2024, menunjukkan potensi awal yang menjanjikan dalam penerapan nyata sistem 5G berbasis AI."
  },

  {
    "judul": "Fault detection and classification in power grids using Shannon entropy with convolution distributed autoencoder",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Veeramachaneni, V", "Husain, SO"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10872059/",
    "rumusan_masalah": "Bagaimana mendeteksi dan mengklasifikasikan gangguan pada jaringan listrik secara akurat menggunakan pendekatan Shannon entropy dan convolutional distributed autoencoder?",
    "penelitian_terkini": "Studi ini mengintegrasikan fitur Shannon entropy dengan autoencoder terdistribusi berbasis CNN untuk meningkatkan akurasi deteksi dan klasifikasi gangguan pada sistem grid listrik.",
    "hasil_yang_diharapkan": "Meningkatkan keandalan sistem tenaga dengan mendeteksi gangguan secara lebih cepat dan akurat dalam skenario operasional nyata.",
    "tantangan": "Kesulitan RNN dalam menangani urutan data yang panjang serta kebutuhan untuk mempertahankan akurasi tinggi dalam klasifikasi gangguan multi-kelas.",
    "hasil_akhir": "Model Shannon entropy + CNN autoencoder berhasil mendeteksi dan mengklasifikasikan gangguan secara efektif, serta telah disitasi 24 kali sejak 2024, membuktikan efektivitasnya di domain energi pintar berbasis AI."
  },

  {
    "judul": "Transformer masked autoencoders for next-generation wireless communications: Architecture and opportunities",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Zayat, A", "Hasabelnaby, MA", "Obeed, M"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10316537/",
    "rumusan_masalah": "Bagaimana arsitektur Transformer Masked Autoencoders (TMAE) dapat dimanfaatkan dalam pengembangan sistem komunikasi nirkabel generasi mendatang?",
    "penelitian_terkini": "Artikel ini memperkenalkan konsep Transformer Masked Autoencoder (TMAE), yang menggabungkan kekuatan transformer dengan autoencoder dalam konteks komunikasi nirkabel untuk meningkatkan efisiensi pemrosesan sinyal dan ekstraksi fitur.",
    "hasil_yang_diharapkan": "Meningkatkan performa sistem komunikasi generasi baru melalui arsitektur deep learning yang lebih efisien dan representatif dibandingkan model DNN klasik.",
    "tantangan": "Mengintegrasikan struktur transformer dengan mekanisme masking pada autoencoder secara optimal dalam sistem komunikasi yang memiliki latensi rendah dan throughput tinggi.",
    "hasil_akhir": "TMAE dinilai menjanjikan untuk diterapkan dalam sistem komunikasi masa depan, dan telah disitasi 9 kali sejak 2023, mencerminkan minat awal yang cukup besar dalam komunitas riset komunikasi AI."
  },

  {
    "judul": "Starnet: An efficient spatiotemporal feature sharing reconstructing network for automatic modulation classification",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Zhang, X", "Wang, Z", "Wang, X", "Luo, T"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10536059/",
    "rumusan_masalah": "Bagaimana meningkatkan klasifikasi modulasi otomatis (AMC) dengan efisiensi tinggi menggunakan pendekatan spatiotemporal dalam arsitektur autoencoder?",
    "penelitian_terkini": "Penelitian ini memperkenalkan model StarNet, yang mengombinasikan autoencoder dan LSTM autoencoder dengan teknik berbagi fitur spatiotemporal untuk rekonstruksi sinyal pada tugas klasifikasi modulasi otomatis.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan efisiensi klasifikasi modulasi dalam sistem komunikasi dengan mempertahankan representasi spasial dan temporal secara optimal.",
    "tantangan": "Model LSTM AE cenderung mengabaikan informasi spasial, dan penambahan layer konvolusional meningkatkan kompleksitas jaringan secara signifikan.",
    "hasil_akhir": "Model StarNet berhasil menunjukkan efisiensi tinggi dalam klasifikasi modulasi otomatis, serta telah disitasi sebanyak 5 kali sejak tahun 2024, menunjukkan potensi awal dalam penerapan sistem komunikasi modern berbasis AI."
  },

  {
    "judul": "Deep autoencoder-based integrated model for anomaly detection and efficient feature extraction in IoT networks",
    "publisher": "mdpi.com",
    "author": ["Alaghbari, KA", "Lim, HS", "Saad, MHM", "Yong, YS"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/2624-831X/4/3/16",
    "rumusan_masalah": "Bagaimana mengembangkan model deep learning berbasis autoencoder untuk deteksi anomali dan ekstraksi fitur secara efisien pada jaringan IoT yang menggunakan protokol MQTT?",
    "penelitian_terkini": "Studi ini mengusulkan model deep autoencoder yang terintegrasi untuk melakukan deteksi anomali sekaligus ekstraksi fitur dari data IoT, menggunakan dataset MQTTset yang mencakup data normal dan serangan.",
    "hasil_yang_diharapkan": "Meningkatkan keamanan dan efisiensi komunikasi dalam jaringan IoT melalui sistem deteksi anomali berbasis pembelajaran mendalam yang ringan dan cepat.",
    "tantangan": "Menangani volume data besar dan variatif pada IoT, serta membedakan anomali dari noise atau variasi alami dalam trafik jaringan.",
    "hasil_akhir": "Model terbukti efektif dalam mendeteksi anomali dan mengekstraksi fitur penting dari data IoT, serta telah disitasi sebanyak 32 kali sejak 2023, menandakan kontribusi signifikan dalam bidang keamanan IoT berbasis AI."
  },

  {
    "judul": "Combining network data analytics function and machine learning for abnormal traffic detection in beyond 5G",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Mekrache, A", "Boutiba, K"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10436766/",
    "rumusan_masalah": "Bagaimana memanfaatkan kombinasi fungsi analitik data jaringan (NWDAF) dan pembelajaran mesin untuk mendeteksi lalu lintas abnormal dalam jaringan Beyond 5G?",
    "penelitian_terkini": "Makalah ini mengusulkan penggunaan LSTM autoencoder yang digabung dengan NWDAF untuk deteksi lalu lintas abnormal, memanfaatkan rekonstruksi input data untuk mengenali penyimpangan dari pola normal.",
    "hasil_yang_diharapkan": "Mendeteksi secara real-time lalu lintas abnormal dalam jaringan Beyond 5G guna meningkatkan keamanan dan efisiensi jaringan.",
    "tantangan": "Mengidentifikasi anomali secara akurat dalam data lalu lintas jaringan yang sangat kompleks dan dinamis, tanpa menghasilkan terlalu banyak false positives.",
    "hasil_akhir": "Model LSTM autoencoder yang diintegrasikan dengan analitik data jaringan terbukti efektif dalam deteksi lalu lintas abnormal, dan telah disitasi 19 kali sejak 2023, menunjukkan penerimaan yang baik di komunitas riset jaringan generasi berikutnya."
  },

  {
    "judul": "LSTM-autoencoder based anomaly detection using vibration data of wind turbines",
    "publisher": "mdpi.com",
    "author": ["Lee, Y", "Park, C", "Kim, N", "Ahn, J", "Jeong, J"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/1424-8220/24/9/2833",
    "rumusan_masalah": "Bagaimana menggunakan model LSTM-autoencoder untuk mendeteksi anomali secara efektif dari data getaran turbin angin secara tak terawasi?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan unsupervised learning berbasis LSTM-autoencoder untuk menganalisis data getaran dan mendeteksi pola anomali pada turbin angin.",
    "hasil_yang_diharapkan": "Mengidentifikasi potensi kerusakan atau kegagalan mekanis secara dini pada sistem turbin angin melalui deteksi pola getaran yang tidak biasa.",
    "tantangan": "Membedakan anomali aktual dari fluktuasi normal dalam sinyal getaran serta menangani kompleksitas temporal dari data turbin angin.",
    "hasil_akhir": "Model LSTM-autoencoder menunjukkan kinerja efektif dalam mendeteksi anomali, dan telah disitasi sebanyak 19 kali sejak 2024, menunjukkan kontribusi signifikan dalam pemeliharaan prediktif energi terbarukan."
  },

  {
    "judul": "A deep learning technique for intrusion detection system using a Recurrent Neural Networks based framework",
    "publisher": "Elsevier",
    "author": ["Kasongo, SM"],
    "tahun": 2023,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0140366422004601",
    "rumusan_masalah": "Bagaimana merancang sistem deteksi intrusi (IDS) yang andal dan akurat menggunakan kerangka kerja deep learning berbasis RNN (LSTM, GRU, dan Simple RNN)?",
    "penelitian_terkini": "Makalah ini mengkaji dan membandingkan performa berbagai arsitektur RNN pada dataset NSL-KDD. Pendekatan terbaik adalah XGBoost-LSTM yang menunjukkan performa superior dalam deteksi serangan jaringan.",
    "hasil_yang_diharapkan": "Mengembangkan sistem IDS berbasis pembelajaran mendalam yang mampu mendeteksi serangan siber secara real-time dan efisien dengan tingkat akurasi tinggi.",
    "tantangan": "Menangani ketidakseimbangan data, overfitting, dan pemrosesan sekuensial yang rumit dalam sistem IDS berbasis deep learning.",
    "hasil_akhir": "Model XGBoost-LSTM mencapai performa terbaik dalam pengujian dan secara signifikan meningkatkan kemampuan deteksi intrusi. Artikel ini telah disitasi sebanyak 303 kali sejak 2023, menunjukkan dampak besar dalam bidang keamanan siber berbasis AI."
  },

  {
    "judul": "A robust multi-stage intrusion detection system for in-vehicle network security using hierarchical federated learning",
    "publisher": "Elsevier",
    "author": ["Althunayyan, M", "Javed, A", "Rana, O"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2214209624001128",
    "rumusan_masalah": "Bagaimana membangun sistem deteksi intrusi multi-tahap yang kuat untuk keamanan jaringan kendaraan menggunakan pendekatan federated learning secara hierarkis?",
    "penelitian_terkini": "Makalah ini mengusulkan IDS multi-tahap yang memanfaatkan ANN untuk mendeteksi serangan yang telah dikenal dan LSTM-autoencoder untuk mengidentifikasi serangan baru atau tak dikenal dalam jaringan kendaraan.",
    "hasil_yang_diharapkan": "Meningkatkan keamanan siber pada jaringan kendaraan dengan mendeteksi berbagai tipe serangan secara terdistribusi dan efisien, tanpa perlu berbagi data mentah.",
    "tantangan": "Melindungi jaringan kendaraan dari serangan kompleks tanpa melanggar privasi data antar node kendaraan dan menghindari overhead komputasi yang tinggi.",
    "hasil_akhir": "Sistem IDS hierarkis berbasis federated learning terbukti efektif dalam mendeteksi baik serangan yang dikenal maupun yang tidak dikenal, dengan 12 sitasi sejak 2024, menunjukkan penerimaan awal yang menjanjikan dalam komunitas penelitian keamanan kendaraan."
  },

  {
    "judul": "Reconstruction-based LSTM-Autoencoder for Anomaly-Based DDoS Attack Detection over Multivariate Time-Series Data",
    "publisher": "arxiv.org",
    "author": ["Wei, Y", "Jang-Jaccard, J", "Sabrina, F", "Xu, W"],
    "tahun": 2023,
    "sumber_data": "https://arxiv.org/abs/2305.09475",
    "rumusan_masalah": "Bagaimana mendeteksi serangan DDoS berbasis anomali dengan efektif menggunakan pendekatan rekonstruksi berbasis LSTM-autoencoder pada data multivariate time-series?",
    "penelitian_terkini": "Penelitian ini mengusulkan model LSTM-Autoencoder yang memanfaatkan kemampuan LSTM untuk menangkap korelasi jangka panjang dari data deret waktu dan autoencoder untuk mendeteksi anomali melalui error rekonstruksi.",
    "hasil_yang_diharapkan": "Mendeteksi pola serangan DDoS secara dini dan akurat dalam jaringan berbasis data multivariat dengan pendekatan tanpa pengawasan.",
    "tantangan": "Mengelola kompleksitas data time-series multivariat dan memastikan sistem deteksi bekerja baik untuk data yang tidak terlihat sebelumnya.",
    "hasil_akhir": "Model yang dikembangkan berhasil mendeteksi anomali dengan akurasi tinggi. Artikel ini telah disitasi sebanyak 14 kali sejak 2023, menandakan kontribusinya dalam sistem pertahanan siber berbasis deep learning."
  },

  {
    "judul": "Covert Fault Detection with Imbalanced Data Using an Improved Autoencoder for Optical Networks",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Zhang, C", "Zhang, M", "Liu, S", "Liu, Z"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10303733/",
    "rumusan_masalah": "Bagaimana mendeteksi kesalahan tersembunyi dalam jaringan optik yang datanya tidak seimbang menggunakan autoencoder yang ditingkatkan?",
    "penelitian_terkini": "Penelitian ini memperkenalkan arsitektur autoencoder berbasis LSTM yang ditingkatkan dengan struktur rekursif untuk meningkatkan akurasi rekonstruksi input pada data jaringan optik yang tidak seimbang.",
    "hasil_yang_diharapkan": "Mengembangkan model deteksi kesalahan tersembunyi yang mampu bekerja secara efektif meskipun data bersifat tidak seimbang dan kompleks.",
    "tantangan": "Keseimbangan data yang buruk dalam jaringan optik mengganggu performa model deteksi tradisional serta sulitnya mendeteksi gangguan non-linier yang samar.",
    "hasil_akhir": "Model autoencoder berbasis LSTM yang diusulkan menunjukkan performa yang lebih baik dalam mendeteksi fault tersembunyi dan telah disitasi sebanyak 5 kali sejak 2023, mencerminkan relevansi awal dalam penelitian jaringan optik."
  },

  {
    "judul": "Anomaly Detection in Groundwater Monitoring Data Using LSTM-Autoencoder Neural Networks",
    "publisher": "Springer",
    "author": ["Roukerd, F Rezaiezadeh", "Rajabi, MM"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/article/10.1007/s10661-024-12848-z",
    "rumusan_masalah": "Bagaimana mendeteksi anomali pada data pemantauan air tanah secara akurat menggunakan model neural network berbasis LSTM-Autoencoder?",
    "penelitian_terkini": "Penelitian ini mengintegrasikan LSTM-Autoencoder dengan simulasi Monte Carlo untuk meningkatkan efektivitas deteksi anomali dalam sistem monitoring lingkungan, khususnya air tanah.",
    "hasil_yang_diharapkan": "Meningkatkan keakuratan deteksi perubahan atau anomali tak terduga pada sistem air tanah guna mendukung pengambilan keputusan dalam pengelolaan sumber daya alam.",
    "tantangan": "Menghadapi variabilitas alami data lingkungan dan ketidakteraturan temporal yang membuat deteksi anomali menjadi kompleks dan berisiko tinggi jika tidak akurat.",
    "hasil_akhir": "Model yang diusulkan berhasil mendeteksi anomali dalam data pemantauan air tanah dan telah disitasi 8 kali sejak 2024, menunjukkan efektivitas pendekatan dalam konteks lingkungan."
  },

  {
    "judul": "Deep Autoencoder Neural Networks: A Comprehensive Review and New Perspectives",
    "publisher": "Springer",
    "author": ["Mienye, ID", "Swart, TG"],
    "tahun": 2025,
    "sumber_data": "https://link.springer.com/article/10.1007/s11831-025-10260-5",
    "rumusan_masalah": "Bagaimana perkembangan, tantangan, dan arah masa depan dari penerapan deep autoencoder neural networks dalam berbagai domain teknik komputasi?",
    "penelitian_terkini": "Artikel ini menyajikan ulasan komprehensif mengenai jaringan neural autoencoder, termasuk variasi seperti LSTM dan GRU, dan solusi terhadap masalah teknis seperti vanishing gradient.",
    "hasil_yang_diharapkan": "Memberikan pemahaman mendalam tentang struktur dan manfaat autoencoder dalam konteks teknik komputasi serta membuka jalan untuk penelitian lanjutan.",
    "tantangan": "Masalah vanishing gradient pada RNN dan kebutuhan akan arsitektur yang lebih stabil dan efisien seperti LSTM dan GRU.",
    "hasil_akhir": "Artikel ini diterima baik dengan 6 sitasi sejak tahun 2025 dan menjadi referensi penting untuk riset lanjutan dalam pengembangan arsitektur deep learning."
  },

  {
    "judul": "An Autoencoder-Based Multi-Task Learning for Intrusion Detection in IoT Networks",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Dong, H", "Kotenko, I"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10158807/",
    "rumusan_masalah": "Bagaimana mendeteksi intrusi jaringan pada IoT secara akurat dan fleksibel menggunakan pendekatan pembelajaran multi-tugas berbasis autoencoder?",
    "penelitian_terkini": "Mengusulkan model multi-task learning (MTL) yang berbasis autoencoder, membandingkan dengan pendekatan sebelumnya seperti LSTM dan Adversarial Network (AN).",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan efisiensi dalam mendeteksi berbagai jenis intrusi pada jaringan IoT menggunakan model yang mampu melakukan beberapa tugas secara bersamaan.",
    "tantangan": "Kompleksitas arsitektur pembelajaran multi-tugas dan tantangan dalam menggabungkan beberapa fungsi deteksi dalam satu sistem autoencoder.",
    "hasil_akhir": "Model ini berhasil diterapkan dan mendapatkan 9 sitasi sejak 2023, menandakan kontribusinya yang signifikan dalam riset IDS berbasis deep learning untuk IoT."
  },

  {
    "judul": "Network Intrusion Detection System Based on an Adversarial Auto-Encoder with Few Labeled Training Samples",
    "publisher": "Springer",
    "author": ["Shiomoto, K"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s10922-022-09698-w",
    "rumusan_masalah": "Bagaimana merancang sistem deteksi intrusi jaringan (IDS) yang efektif dengan jumlah data label yang sangat terbatas?",
    "penelitian_terkini": "Penulis mengembangkan sistem IDS berbasis adversarial autoencoder yang dikombinasikan dengan LSTM autoencoder dan One-Class SVM, hanya menggunakan data normal dalam pelatihan.",
    "hasil_yang_diharapkan": "Menghasilkan sistem IDS yang mampu mendeteksi serangan jaringan secara efisien meskipun hanya dilatih dengan sedikit data berlabel.",
    "tantangan": "Keterbatasan data berlabel dan kebutuhan untuk mendeteksi intrusi baru atau tidak dikenal dengan presisi tinggi.",
    "hasil_akhir": "Pendekatan ini menunjukkan efektivitas tinggi dalam mengklasifikasikan serangan jaringan dan telah mendapatkan 16 sitasi sejak tahun 2023."
  },

  {
    "judul": "GAF-MAE: A Self-Supervised Automatic Modulation Classification Method Based on Gramian Angular Field and Masked Autoencoder",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Shi, Y", "Xu, H", "Zhang, Y", "Qi, Z"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10261289/",
    "rumusan_masalah": "Bagaimana mengembangkan metode klasifikasi modulasi otomatis (AMC) berbasis self-supervised learning dengan efisiensi dan akurasi tinggi tanpa label besar?",
    "penelitian_terkini": "Artikel ini mengusulkan GAF-MAE, metode klasifikasi otomatis modulasi berbasis Gramian Angular Field dan Masked Autoencoder yang tidak membutuhkan data berlabel dalam pelatihan.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi klasifikasi modulasi otomatis dalam kondisi noise tinggi dan dengan jumlah data label minimal.",
    "tantangan": "Mengklasifikasikan sinyal modulasi secara akurat dalam kondisi sinyal yang kompleks dan terbatasnya data berlabel.",
    "hasil_akhir": "Metode ini menunjukkan kinerja superior dibandingkan pendekatan sebelumnya dan telah disitasi 19 kali sejak tahun 2023."
  },

  {
    "judul": "Anomaly Detection in Network Traffic Using Deep Learning",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Sharma, K", "Chaudhary, M", "Yadav, K"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10419951/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam lalu lintas jaringan menggunakan model deep learning seperti Autoencoder dan LSTM-Autoencoder?",
    "penelitian_terkini": "Artikel ini mengusulkan pendekatan berbasis deep learning, khususnya Autoencoder dan LSTM-AE, untuk mendeteksi anomali dalam komunikasi jaringan.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi anomali dan mempercepat proses identifikasi serangan pada lalu lintas jaringan.",
    "tantangan": "Menyesuaikan arsitektur deep learning agar optimal untuk berbagai jenis data jaringan dan pola anomali yang dinamis.",
    "hasil_akhir": "Model LSTM-AE yang diusulkan menunjukkan hasil menjanjikan dalam mendeteksi anomali dan telah disitasi sebanyak 8 kali sejak 2023."
  },

  {
    "judul": "A Novel Two-Stage Deep Learning Model for Network Intrusion Detection: LSTM-AE",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Hnamte, V", "Nhung-Nguyen, H", "Hussain, J"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10101759/",
    "rumusan_masalah": "Bagaimana merancang model deep learning dua tahap yang efektif untuk mendeteksi intrusi dalam jaringan komunikasi?",
    "penelitian_terkini": "Mengembangkan sistem deteksi intrusi (IDS) berbasis deep learning yang menggabungkan Autoencoder dan LSTM dalam arsitektur dua tahap.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi anomali dan menurunkan tingkat kesalahan dalam sistem komunikasi berbasis ICT.",
    "tantangan": "Mengatasi kompleksitas struktur jaringan dan menangani volume data besar dalam mendeteksi ancaman yang tersembunyi.",
    "hasil_akhir": "Model LSTM-AE dua tahap yang diusulkan terbukti sangat efektif dan telah disitasi sebanyak 126 kali sejak 2023, menandakan kontribusi signifikan dalam riset IDS."
  },

  {
    "judul": "Network Intrusion Detection System for DDoS Attacks in ICS Using Deep Autoencoders",
    "publisher": "Springer",
    "author": ["Ortega-Fernandez, I", "Sestelo, M", "Burguillo, JC"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/article/10.1007/s11276-022-03214-3",
    "rumusan_masalah": "Bagaimana membangun sistem deteksi intrusi yang efektif terhadap serangan DDoS di sistem kontrol industri (ICS) menggunakan pendekatan deep autoencoder?",
    "penelitian_terkini": "Penggunaan autoencoder mendalam, khususnya LSTM Autoencoder, untuk mengenali pola komunikasi dalam jaringan ICS dan mendeteksi anomali berupa serangan DDoS.",
    "hasil_yang_diharapkan": "Sistem IDS yang mampu secara efektif membedakan antara lalu lintas normal dan lalu lintas yang mencurigakan dalam sistem kontrol industri.",
    "tantangan": "Menangani kompleksitas data ICS dan mempelajari pola komunikasi yang kompleks serta berulang untuk mendeteksi anomali secara akurat.",
    "hasil_akhir": "Model LSTM Autoencoder terbukti efektif dalam mendeteksi serangan DDoS pada ICS dan telah mendapat 62 sitasi sejak tahun 2024, menunjukkan relevansi dan validitasnya."
  },

  {
    "judul": "Ransomware Detection Using Stacked Autoencoder for Feature Selection",
    "publisher": "arxiv.org",
    "author": ["Nkongolo, M", "Tokmak, M"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2402.11342",
    "rumusan_masalah": "Bagaimana menggunakan stacked autoencoder secara efektif untuk seleksi fitur dalam mendeteksi ransomware?",
    "penelitian_terkini": "Pendekatan modifikasi LSTM-autoencoder digunakan untuk seleksi fitur dan deteksi anomali, termasuk penggabungan metode one-class classification.",
    "hasil_yang_diharapkan": "Sistem deteksi ransomware yang dapat mengenali pola anomali secara lebih efisien dengan representasi fitur yang optimal.",
    "tantangan": "Menghadapi kompleksitas dalam pemilihan fitur dan efisiensi deteksi anomali dengan jumlah data pelatihan yang terbatas.",
    "hasil_akhir": "Pendekatan stacked autoencoder berhasil meningkatkan deteksi ransomware dan telah disitasi sebanyak 14 kali sejak 2024, menunjukkan potensi kontribusi penting pada keamanan siber."
  },

  {
    "judul": "Autoencoder via DCNN and LSTM Models for Intrusion Detection in Industrial Control Systems of Critical Infrastructures",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Saheed, YK", "Misra, S"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10189137/",
    "rumusan_masalah": "Bagaimana merancang sistem deteksi intrusi yang efektif untuk sistem kontrol industri (ICS) menggunakan kombinasi model deep learning?",
    "penelitian_terkini": "Mengembangkan autoencoder hybrid yang menggabungkan DCNN dan LSTM untuk mengenali komunikasi ICS yang normal dan mendeteksi anomali atau intrusi.",
    "hasil_yang_diharapkan": "Meningkatkan deteksi intrusi dalam jaringan sistem kontrol industri dengan akurasi tinggi dan rendahnya false positive rate.",
    "tantangan": "Kompleksitas komunikasi dalam ICS dan kebutuhan model yang mampu belajar pola komunikasi normal secara efektif.",
    "hasil_akhir": "Model autoencoder hybrid yang dilatih pada dataset ICS dan jaringan pipa gas menunjukkan performa yang baik, dan telah dikutip 15 kali sejak tahun 2023."
  },

  {
    "judul": "Time-series Anomaly Detection in Automated Vehicles Using D-CNN-LSTM Autoencoder",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Khanmohammadi, F", "Azmi, R"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10480743/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam data deret waktu (time-series) kendaraan otomatis secara efisien?",
    "penelitian_terkini": "Pengembangan metode deteksi anomali menggunakan arsitektur hybrid D-CNN-LSTM Autoencoder untuk mengidentifikasi pola data abnormal dari kendaraan otomatis.",
    "hasil_yang_diharapkan": "Sistem deteksi anomali yang mampu menangani kompleksitas data kendaraan otomatis secara efisien dengan akurasi tinggi.",
    "tantangan": "Menangani kerumitan data sekuensial pada kendaraan otomatis dan menggabungkan berbagai jenis jaringan saraf dalam satu model.",
    "hasil_akhir": "Model D-CNN-LSTM Autoencoder terbukti efektif untuk deteksi anomali pada kendaraan otomatis dan telah mendapat 12 sitasi sejak tahun 2024."
  },

  {
    "judul": "Intrusion detection method based on stacked sparse autoencoder and sliced GRU for connected healthcare systems",
    "publisher": "Springer",
    "author": ["Gu, Z", "Wang, L", "Li, J", "Wen, M", "Liu, Y"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s13369-022-07079-8",
    "rumusan_masalah": "Bagaimana merancang metode deteksi intrusi yang efisien dan aman untuk sistem kesehatan terhubung berbasis jaringan?",
    "penelitian_terkini": "Mengembangkan sistem IDS menggunakan stacked sparse autoencoder (SAE) dan sliced GRU untuk mendeteksi intrusi dalam komunikasi sistem kesehatan berbasis internet.",
    "hasil_yang_diharapkan": "Deteksi intrusi yang lebih akurat dan ringan untuk sistem kesehatan yang terhubung dengan keamanan komunikasi data yang lebih baik.",
    "tantangan": "Menghadapi tantangan dalam efisiensi komputasi, keamanan data pasien, dan keragaman serangan siber pada sistem kesehatan modern.",
    "hasil_akhir": "Model gabungan SAE dan GRU menunjukkan performa deteksi intrusi yang efektif dan telah mendapatkan 7 sitasi sejak 2023."
  },

  {
    "judul": "A novel channel estimation framework in MIMO using serial cascaded multiscale autoencoder and attention LSTM with hybrid heuristic algorithm",
    "publisher": "mdpi.com",
    "author": ["Manasa, BMR", "Pakala, V", "Chinthaginjala, R", "Ayadi, M"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/1424-8220/23/22/9154",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi estimasi kanal dalam sistem MIMO dengan pendekatan berbasis deep learning dan algoritma hibrida?",
    "penelitian_terkini": "Mengusulkan framework baru yang menggabungkan multiscale autoencoder, attention-based LSTM, dan algoritma heuristik hibrida untuk estimasi kanal dalam jaringan MIMO.",
    "hasil_yang_diharapkan": "Estimasi kanal yang lebih akurat dan efisien dalam konsumsi energi pada komunikasi nirkabel jarak jauh berbasis MIMO.",
    "tantangan": "Menjaga akurasi tinggi sambil mengurangi konsumsi energi dan beban komputasi dalam estimasi kanal untuk komunikasi jangka panjang.",
    "hasil_akhir": "Framework yang diusulkan menunjukkan hasil yang menjanjikan dan telah disitasi sebanyak 6 kali sejak 2023."
  },

  {
    "judul": "Unsupervised Spectrum Anomaly Detection With Distillation and Memory Enhanced Autoencoders",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Qi, P", "Jiang, T", "Xu, J", "He, J", "Zheng, S"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10589480/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali spektrum secara unsupervised dengan akurasi tinggi di lingkungan jaringan IoT?",
    "penelitian_terkini": "Mengembangkan model deteksi anomali spektrum berbasis autoencoder yang diperkuat dengan memori dan distilasi pengetahuan, menggunakan LSTM dan Adversarial Autoencoder (AAE).",
    "hasil_yang_diharapkan": "Mendeteksi anomali spektrum secara efisien tanpa data label dengan meningkatkan kapasitas generalisasi melalui distilasi dan modul memori.",
    "tantangan": "Mengatasi keterbatasan data label serta meningkatkan ketahanan dan ketepatan deteksi dalam spektrum dinamis dan kompleks.",
    "hasil_akhir": "Model yang diusulkan menunjukkan hasil awal yang menjanjikan dan telah disitasi 3 kali sejak 2024."
  },

  {
    "judul": "An adaptive temporal convolutional network autoencoder for malicious data detection in mobile crowd sensing",
    "publisher": "mdpi.com",
    "author": [
      "Owoh, N",
      "Riley, J",
      "Ashawa, M",
      "Hosseinzadeh, S",
      "Philip, A"
    ],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/1424-8220/24/7/2353",
    "rumusan_masalah": "Bagaimana mendeteksi data berbahaya dalam sistem mobile crowd sensing secara adaptif dan efisien?",
    "penelitian_terkini": "Menggunakan convolutional LSTM autoencoder untuk mendeteksi pola anomali pada data yang dikumpulkan dari jaringan rumah pintar.",
    "hasil_yang_diharapkan": "Autoencoder yang mampu belajar pola komunikasi normal dan mengenali data berbahaya secara efektif dalam sistem crowd sensing.",
    "tantangan": "Menangani data yang bersifat dinamis dan bervariasi dari pengguna serta membedakan data valid dari data jahat.",
    "hasil_akhir": "Model adaptif yang menunjukkan kinerja baik untuk deteksi data berbahaya, dengan 13 sitasi sejak 2024."
  },

  {
    "judul": "GNSS Anomaly Detection with Complex-Valued LSTM Networks",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Savolainen, O", "Elango, A", "Morrison, A"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10578405/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam sinyal GNSS menggunakan pendekatan deep learning berbasis LSTM?",
    "penelitian_terkini": "Menggunakan LSTM autoencoder kompleks (complex-valued) untuk mendeteksi anomali dalam data GNSS secara unsupervised.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan sensitivitas sistem deteksi anomali pada sistem navigasi berbasis GNSS.",
    "tantangan": "Kompleksitas data GNSS dan kebutuhan akan model yang mampu memahami representasi sinyal kompleks.",
    "hasil_akhir": "Model berhasil menunjukkan efektivitas pendekatan LSTM kompleks dalam mendeteksi anomali, dengan 3 sitasi sejak 2024."
  },

  {
    "judul": "Network traffic discrimination improvement in software defined network (SDN) with deep autoencoder and ensemble method",
    "publisher": "Springer",
    "author": ["Shirmarz, A", "Ghaffari, A"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s12652-022-03810-3",
    "rumusan_masalah": "Bagaimana meningkatkan kemampuan diskriminasi lalu lintas jaringan pada SDN menggunakan deep autoencoder dan metode ensemble?",
    "penelitian_terkini": "Menggunakan kombinasi Deep Autoencoder dengan metode ensemble dan arsitektur CNN, RNN, GRU, serta LSTM untuk meningkatkan akurasi klasifikasi lalu lintas jaringan.",
    "hasil_yang_diharapkan": "Meningkatkan efisiensi pengenalan dan klasifikasi jenis lalu lintas pada jaringan SDN untuk keperluan keamanan dan manajemen jaringan.",
    "tantangan": "Kompleksitas tinggi dalam lalu lintas jaringan SDN dan kebutuhan pengolahan data real-time dengan akurasi tinggi.",
    "hasil_akhir": "Pendekatan yang diajukan berhasil meningkatkan kemampuan diskriminasi jaringan dan telah disitasi sebanyak 14 kali sejak 2023."
  },

  {
    "judul": "An autoencoder-based feature level fusion for speech emotion recognition",
    "publisher": "Elsevier",
    "author": ["Shixin, P", "Kai, C", "Tian, T", "Jingying, C"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2352864822002279",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi pengenalan emosi dari ucapan dengan menggabungkan fitur audio menggunakan autoencoder?",
    "penelitian_terkini": "Menggunakan autoencoder untuk menyatukan berbagai fitur audio sebelum diklasifikasikan oleh jaringan BLSTM dan attention mechanism.",
    "hasil_yang_diharapkan": "Model yang mampu menggabungkan informasi multimodal untuk meningkatkan kinerja pengenalan emosi dalam sinyal ucapan.",
    "tantangan": "Mengelola fitur multimodal dengan redundansi tinggi serta mempertahankan informasi penting untuk klasifikasi emosi.",
    "hasil_akhir": "Pendekatan feature fusion berbasis autoencoder menunjukkan performa lebih baik dibanding metode unimodal dan telah disitasi 30 kali sejak 2024."
  },

  {
    "judul": "Multi-task learning for IoT traffic classification: a comparative analysis of deep autoencoders",
    "publisher": "Elsevier",
    "author": ["Dong, H", "Kotenko, I"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0167739X24001341",
    "rumusan_masalah": "Bagaimana menerapkan pembelajaran multi-tugas (multi-task learning) menggunakan deep autoencoder untuk klasifikasi lalu lintas IoT secara efisien?",
    "penelitian_terkini": "Dilakukan analisis komparatif antara CNN, DNN, dan LSTM untuk klasifikasi lalu lintas IoT berbasis deep learning.",
    "hasil_yang_diharapkan": "Mendapatkan arsitektur deep learning terbaik untuk klasifikasi lalu lintas IoT dengan kinerja dan generalisasi yang lebih baik.",
    "tantangan": "Mengelola kompleksitas data lalu lintas IoT yang sangat bervariasi dan volume tinggi, serta memastikan akurasi dalam pengklasifikasian.",
    "hasil_akhir": "LSTM dan deep autoencoder memberikan hasil lebih unggul dibanding model ML tradisional dan jaringan neural lainnya. Artikel ini telah disitasi 6 kali sejak 2024."
  },

  {
    "judul": "Link adaptation in underwater wireless optical communications based on deep learning",
    "publisher": "Elsevier",
    "author": ["Zhao, X", "Qi, Z", "Pompili, D"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S1389128624000653",
    "rumusan_masalah": "Bagaimana meningkatkan adaptasi link dalam komunikasi optik bawah laut menggunakan pendekatan deep learning?",
    "penelitian_terkini": "Mengembangkan metode adaptasi link berbasis RNN (SwitchOpt RNN) dan membandingkannya dengan CNN dan autoencoder dalam kondisi SNR rendah.",
    "hasil_yang_diharapkan": "Mencapai performa komunikasi optik bawah laut yang lebih stabil dan efisien di lingkungan dengan kualitas sinyal rendah.",
    "tantangan": "Variabilitas dan tantangan sinyal dalam media bawah laut seperti SNR rendah, gangguan optik, dan fluktuasi lingkungan.",
    "hasil_akhir": "SwitchOpt RNN mengungguli CNN dan autoencoder khususnya pada kondisi SNR rendah. Artikel ini telah disitasi 11 kali sejak 2024."
  },

  {
    "judul": "LSTM-Autoencoder Based Detection of Time-Series Noise Signals for Water Supply and Sewer Pipe Leakages",
    "publisher": "mdpi.com",
    "author": [
      "Shin, Y",
      "Na, KY",
      "Kim, SE",
      "Kyung, EJ",
      "Choi, HG",
      "Jeong, J"
    ],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/2073-4441/16/18/2631",
    "rumusan_masalah": "Bagaimana mendeteksi kebocoran pada sistem pipa air dan saluran pembuangan berdasarkan sinyal derau time-series menggunakan model LSTM-Autoencoder?",
    "penelitian_terkini": "Menggunakan model LSTM-Autoencoder untuk mendeteksi sinyal noise yang menunjukkan kebocoran pipa dan membandingkan dengan pendekatan lain seperti LSTM-capsule autoencoder.",
    "hasil_yang_diharapkan": "Model yang mampu mendeteksi sinyal anomali secara akurat dalam sistem distribusi air dan pembuangan.",
    "tantangan": "Memisahkan noise alami dari sinyal kebocoran yang valid dan memastikan akurasi deteksi dalam berbagai kondisi lingkungan.",
    "hasil_akhir": "Model LSTM-Autoencoder mencapai akurasi klasifikasi sebesar 96.79%, mengungguli metode sebelumnya. Artikel ini telah disitasi sebanyak 9 kali sejak tahun 2024."
  },

  {
    "judul": "Anomaly detection based on LSTM and autoencoders using federated learning in smart electric grid",
    "publisher": "Elsevier",
    "author": [
      "Shrestha, R",
      "Mohammadi, M",
      "Sinaei, S",
      "Salcines, A",
      "..."
    ],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0743731524001151",
    "rumusan_masalah": "Bagaimana menerapkan metode LSTM dan Autoencoder berbasis federated learning untuk mendeteksi anomali dalam sistem smart electric grid?",
    "penelitian_terkini": "Menggabungkan jaringan neural seperti LSTM dan autoencoder dalam kerangka federated learning untuk deteksi anomali secara terdistribusi di smart grid.",
    "hasil_yang_diharapkan": "Sistem deteksi anomali terdistribusi yang efisien dan dapat melindungi privasi data antar node dalam jaringan listrik pintar.",
    "tantangan": "Mengatasi masalah latensi dan sinkronisasi data antar node dalam federated learning serta menjaga akurasi deteksi anomali.",
    "hasil_akhir": "Model gabungan LSTM dan autoencoder dengan federated learning menunjukkan kinerja yang efisien dalam deteksi anomali pada smart grid. Artikel ini telah disitasi sebanyak 36 kali sejak tahun 2024."
  },

  {
    "judul": "An autoencoder-based I/Q channel interaction enhancement method for automatic modulation recognition",
    "publisher": "IEEE",
    "author": ["Zhang, F", "Luo, C", "Xu, J", "Luo, Y"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10052744/",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi pengenalan modulasi otomatis (AMR) dalam sistem komunikasi non-kooperatif dengan memanfaatkan interaksi saluran I/Q?",
    "penelitian_terkini": "Mengusulkan metode peningkatan interaksi saluran I/Q berbasis autoencoder untuk memperkuat fitur representasi sinyal dalam tugas AMR.",
    "hasil_yang_diharapkan": "Model autoencoder yang mampu belajar representasi sinyal yang lebih efektif dari data I/Q untuk meningkatkan performa klasifikasi modulasi secara otomatis.",
    "tantangan": "Menangani kompleksitas sinyal dalam lingkungan komunikasi non-kooperatif dan meningkatkan generalisasi model tanpa menambah kompleksitas jaringan secara signifikan.",
    "hasil_akhir": "Metode berbasis autoencoder menunjukkan performa lebih baik dari model tradisional, namun masih sedikit di bawah performa model berbasis RNN. Artikel ini telah disitasi sebanyak 23 kali sejak tahun 2023."
  },

  {
    "judul": "IDS-DEC: A novel intrusion detection for CAN bus traffic based on deep embedded clustering",
    "publisher": "Elsevier",
    "author": ["Shi, J", "Xie, Z", "Dong, L", "Jiang, X", "Jin, X"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2214209624001050",
    "rumusan_masalah": "Bagaimana merancang sistem deteksi intrusi yang efektif untuk lalu lintas CAN bus pada kendaraan menggunakan pendekatan pembelajaran mendalam?",
    "penelitian_terkini": "Mengusulkan sistem IDS-DEC yang menggabungkan deep embedded clustering dan model deep learning berbasis LSTM Convolutional Autoencoder dengan analisis entropi.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan deteksi intrusi terhadap lalu lintas CAN bus secara akurat tanpa memerlukan banyak data berlabel.",
    "tantangan": "Menangani data CAN bus yang tidak berlabel dan kompleksitas komunikasi kendaraan secara efisien dengan mempertahankan kinerja tinggi.",
    "hasil_akhir": "Model IDS-DEC menunjukkan performa deteksi yang kompetitif dan efisien, serta telah memperoleh 5 sitasi sejak dipublikasikan pada tahun 2024."
  },

  {
    "judul": "Anomaly detection based on 1D-CNN-LSTM auto-encoder for bearing data",
    "publisher": "WSEAS Trans. Inf. Sci. Appl",
    "author": ["Lee, D", "Choo, H", "Jeong, J"],
    "tahun": 2023,
    "sumber_data": "https://www.wseas.com/journals/isa/2023/a025109-001(2023).pdf",
    "rumusan_masalah": "Bagaimana mendeteksi anomali pada data bearing dengan akurasi tinggi menggunakan kombinasi 1D-CNN dan LSTM Autoencoder?",
    "penelitian_terkini": "Mengusulkan model deep learning gabungan 1D-CNN dan LSTM Autoencoder untuk menganalisis data bearing dari pengukuran aktual, khususnya mendeteksi kerusakan ringan (fine eccentric).",
    "hasil_yang_diharapkan": "Model dapat mengenali kerusakan bearing yang sulit dideteksi oleh metode tradisional, meningkatkan akurasi deteksi anomali.",
    "tantangan": "Kesulitan dalam mendeteksi anomali halus pada data bearing dan menangani noise dari data pengukuran nyata.",
    "hasil_akhir": "Model 1D-CNN-LSTM Autoencoder terbukti efektif dalam mendeteksi kerusakan bearing dan telah memperoleh 9 sitasi sejak dipublikasikan pada tahun 2023."
  },

  {
    "judul": "An LSTM-based outlier detection approach for IoT sensor data in hierarchical Edge Computing",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Bibi, S", "Titouna, C", "Titouna, F", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10271607/",
    "rumusan_masalah": "Bagaimana mendeteksi outlier (penyimpangan data) dalam data sensor IoT secara efisien dalam lingkungan edge computing yang bersifat hierarkis?",
    "penelitian_terkini": "Mengusulkan pendekatan deteksi outlier berbasis LSTM yang dioptimalkan untuk diterapkan dalam infrastruktur edge computing dengan data IoT yang masif dan bersifat sekuensial.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan efisiensi dalam mendeteksi outlier pada data sensor IoT tanpa memerlukan sumber daya komputasi tinggi.",
    "tantangan": "Menangani data dalam jumlah besar dengan keterbatasan sumber daya di perangkat edge serta menghindari false positive/negative dalam deteksi anomali.",
    "hasil_akhir": "Model LSTM-based berhasil diterapkan untuk mendeteksi outlier pada jaringan sensor nirkabel IoT dan telah memperoleh 4 sitasi sejak tahun 2023."
  },

  {
    "judul": "A DenseNet-based learning framework toward maritime end-to-end autoencoder communication systems",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Shao, S", "Lin, B", "Wu, N", "Han, X"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10233606/",
    "rumusan_masalah": "Bagaimana mengembangkan sistem komunikasi end-to-end berbasis autoencoder yang efisien untuk lingkungan maritim yang kompleks?",
    "penelitian_terkini": "Menggabungkan DenseNet dan LSTM dalam arsitektur autoencoder untuk membangun sistem komunikasi maritim end-to-end yang cerdas dan robust.",
    "hasil_yang_diharapkan": "Meningkatkan kinerja transmisi dan rekonstruksi sinyal komunikasi di lingkungan laut melalui pembelajaran mendalam berbasis DenseNet dan LSTM.",
    "tantangan": "Kompleksitas lingkungan komunikasi maritim dan kebutuhan akan representasi fitur yang efisien serta ketahanan terhadap noise.",
    "hasil_akhir": "Framework DenseNet-LSTM autoencoder menunjukkan kinerja yang menjanjikan dalam komunikasi end-to-end dan telah disitasi sebanyak 3 kali sejak 2023."
  },

  {
    "judul": "Digital twin-enhanced predictive maintenance for indoor climate: A parallel LSTM-autoencoder failure prediction approach",
    "publisher": "Elsevier",
    "author": ["Hu, W", "Wang, X", "Tan, K", "Cai, Y"],
    "tahun": 2023,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0378778823009684",
    "rumusan_masalah": "Bagaimana mengintegrasikan digital twin dan deep learning untuk meningkatkan prediksi kegagalan dalam sistem iklim dalam ruangan?",
    "penelitian_terkini": "Mengusulkan pendekatan prediksi kegagalan menggunakan kombinasi paralel LSTM dan autoencoder, yang didukung oleh kerangka kerja pemeliharaan prediktif berbasis digital twin (DT).",
    "hasil_yang_diharapkan": "Memberikan prediksi kerusakan yang lebih akurat dalam manajemen iklim dalam ruangan guna meningkatkan efisiensi dan kenyamanan energi bangunan.",
    "tantangan": "Kompleksitas penggabungan model digital twin dengan model pembelajaran mendalam serta keakuratan dalam memprediksi gangguan sistem iklim dalam ruangan.",
    "hasil_akhir": "Model LSTM-autoencoder paralel berbasis digital twin menunjukkan hasil yang valid dan telah disitasi sebanyak 20 kali sejak 2023."
  },

  {
    "judul": "Trust my IDS: An explainable AI integrated deep learning-based transparent threat detection system for industrial networks",
    "publisher": "Elsevier",
    "author": ["Shoukat, S", "Gao, T", "Javeed, D", "Saeed, MS", "Adil, M"],
    "tahun": 2025,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0167404824004966",
    "rumusan_masalah": "Bagaimana membangun sistem deteksi ancaman yang transparan, dapat dipercaya, dan dapat dijelaskan untuk jaringan industri?",
    "penelitian_terkini": "Menggabungkan Explainable AI dengan arsitektur Long Short-Term Memory Autoencoder (LSTM-AE) dalam deteksi ancaman multikelas pada jaringan Industrial Internet of Things (IIoT).",
    "hasil_yang_diharapkan": "Meningkatkan transparansi dan akurasi dalam sistem deteksi intrusi dengan memberikan penjelasan terhadap hasil klasifikasi ancaman.",
    "tantangan": "Mengembangkan sistem yang tidak hanya akurat tetapi juga dapat dijelaskan secara intuitif oleh pengguna non-teknis di lingkungan industri yang kompleks.",
    "hasil_akhir": "Sistem berbasis Explainable AI dan LSTM-AE berhasil memberikan deteksi ancaman multikelas yang andal dan telah disitasi sebanyak 12 kali sejak 2025."
  },

  {
    "judul": "Optimizing hyperparameters for enhanced email classification and forensic analysis with stacked autoencoders",
    "publisher": "International Journal of Network (via ResearchGate)",
    "author": ["Thomas, M", "Meshram, BB"],
    "tahun": 2024,
    "sumber_data": "https://www.researchgate.net/publication/378146762",
    "rumusan_masalah": "Bagaimana mengoptimalkan hyperparameter untuk meningkatkan klasifikasi email dan analisis forensik menggunakan stacked autoencoder?",
    "penelitian_terkini": "Mengkaji kombinasi algoritma deep learning seperti stacked autoencoder, GAN, RNN, CNN, dan Mayfly optimization untuk klasifikasi spam dan analisis forensik email.",
    "hasil_yang_diharapkan": "Memperoleh model klasifikasi email yang lebih akurat, efisien, dan andal dalam mengidentifikasi spam serta mendukung analisis forensik digital.",
    "tantangan": "Menemukan konfigurasi hyperparameter yang optimal untuk berbagai arsitektur dan menangani dinamika komunikasi spam yang berubah-ubah.",
    "hasil_akhir": "Model berbasis stacked autoencoder dengan optimisasi hyperparameter menunjukkan peningkatan performa klasifikasi dan telah disitasi 5 kali sejak 2024."
  },

  {
    "judul": "Autoencoder-K-Means Algorithm for Efficient Anomaly Detection to Improve Space Operations",
    "publisher": "IEEE",
    "author": ["Akbarian, H", "Mahgoub, I", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10577704/",
    "rumusan_masalah": "Bagaimana mengembangkan metode deteksi anomali yang efisien untuk meningkatkan keandalan operasi luar angkasa berdasarkan data telemetri?",
    "penelitian_terkini": "Menggabungkan autoencoder dengan algoritma K-Means, serta menggunakan model GAN berbasis CNN dan LSTM untuk menangkap fitur spasial dan temporal dari data telemetri luar angkasa.",
    "hasil_yang_diharapkan": "Mendeteksi anomali secara akurat dan efisien dalam data luar angkasa guna mendukung pengambilan keputusan dan meningkatkan keandalan misi.",
    "tantangan": "Menangani kompleksitas data spasial-temporal dan memastikan integrasi yang efektif antara autoencoder, clustering, dan jaringan adversarial.",
    "hasil_akhir": "Model gabungan Autoencoder-K-Means dengan CNN-LSTM-GAN menunjukkan efisiensi dalam deteksi anomali dan telah disitasi 1 kali sejak 2024."
  },

  {
    "judul": "LSTM-Autoencoder for Vibration Anomaly Detection in Vertical Carousel Storage and Retrieval System (VCSRS)",
    "publisher": "MDPI - Sensors",
    "author": ["Do, JS", "Kareem, AB", "Hur, JW"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/1424-8220/23/2/1009",
    "rumusan_masalah": "Bagaimana mendeteksi anomali getaran secara akurat dalam sistem penyimpanan dan pengambilan vertikal (VCSRS) menggunakan pendekatan deep learning?",
    "penelitian_terkini": "Menggunakan model LSTM-Autoencoder untuk menganalisis data getaran dan membandingkan performanya dengan model koefisien korelasi.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan pendeteksian dini terhadap kelainan getaran guna mencegah kerusakan mekanis dalam sistem VCSRS.",
    "tantangan": "Menghadapi variasi pola getaran dalam sistem dinamis dan memastikan model dapat mengenali anomali secara andal dalam data waktu nyata.",
    "hasil_akhir": "Model LSTM-Autoencoder menunjukkan hasil yang lebih baik dibandingkan model statistik tradisional dan telah mendapatkan 44 sitasi sejak 2023."
  },

  {
    "judul": "Semisupervised Anomaly Detection of Multivariate Time Series Based on a Variational Autoencoder",
    "publisher": "Springer - Applied Intelligence",
    "author": ["Chen, N", "Tu, H", "Duan, X", "Hu, L", "Guo, C"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s10489-022-03829-1",
    "rumusan_masalah": "Bagaimana mengembangkan metode pendeteksian anomali untuk data deret waktu multivariat dengan pendekatan semi-supervised yang efisien dan akurat?",
    "penelitian_terkini": "Mengusulkan model variational autoencoder (VAE) berbasis LSTM yang semi-supervised untuk mendeteksi anomali pada data deret waktu multivariat.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi anomali dengan memanfaatkan struktur VAE dan kemampuan LSTM dalam menangkap ketergantungan temporal.",
    "tantangan": "Mengintegrasikan pendekatan semi-supervised ke dalam arsitektur VAE yang dapat bekerja baik meski label terbatas dan data bersifat sekuensial.",
    "hasil_akhir": "Model LSTM-VAE menunjukkan kinerja unggul dibanding pendekatan baseline dan telah disitasi sebanyak 50 kali sejak tahun 2023."
  },

  {
    "judul": "Deep learning-based anomaly detection for connected autonomous vehicles using spatiotemporal information",
    "publisher": "IEEE Transactions",
    "author": ["Mansourian, P", "Zhang, N", "Jaekel, A", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10164214/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali secara efektif dalam kendaraan otonom yang saling terhubung menggunakan informasi spasial dan temporal?",
    "penelitian_terkini": "Mengusulkan pendekatan deep learning menggunakan LSTM Autoencoder yang dilatih untuk masing-masing sensor kendaraan guna menangkap pola anomali berdasarkan data spasial-temporal.",
    "hasil_yang_diharapkan": "Mampu secara akurat mengenali gangguan atau kelainan yang dapat terjadi dalam sistem komunikasi internal maupun eksternal kendaraan otonom.",
    "tantangan": "Mengintegrasikan dan menyelaraskan data spasial dan temporal dalam skala besar dengan arsitektur LSTM Autoencoder yang dapat menggeneralisasi berbagai skenario lalu lintas dan komunikasi kendaraan.",
    "hasil_akhir": "Model LSTM Autoencoder berhasil mendeteksi anomali secara efektif dan telah memperoleh 59 sitasi sejak 2023, menunjukkan pengaruhnya dalam komunitas penelitian."
  },

  {
    "judul": "Unsupervised outlier detection for time-series data of indoor air quality using LSTM autoencoder with ensemble method",
    "publisher": "Springer",
    "author": ["Park, J", "Seo, Y", "Cho, J"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1186/s40537-023-00746-z",
    "rumusan_masalah": "Bagaimana mendeteksi outlier (anomali) dalam data deret waktu kualitas udara dalam ruangan secara tak terawasi (unsupervised)?",
    "penelitian_terkini": "Mengembangkan kerangka deteksi outlier berbasis LSTM Autoencoder yang dikombinasikan dengan metode ensemble untuk mempelajari pola normal dalam data kualitas udara.",
    "hasil_yang_diharapkan": "Dapat secara akurat dan adaptif mendeteksi situasi abnormal atau tak terduga dalam kualitas udara ruangan tanpa pelabelan data sebelumnya.",
    "tantangan": "Menangani variasi temporal dan non-linearitas tinggi dalam data deret waktu, serta memastikan generalisasi deteksi outlier pada kondisi lingkungan yang berbeda.",
    "hasil_akhir": "Framework LSTM-AE dengan ensemble berhasil mendeteksi berbagai outlier dan telah dikutip 39 kali sejak 2023, menunjukkan efektivitas dan relevansinya."
  },

  {
    "judul": "Insider threat detection using supervised machine learning algorithms",
    "publisher": "Springer",
    "author": ["Manoharan, P", "Yin, J", "Wang, H", "Zhang, Y"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/article/10.1007/s11235-023-01085-3",
    "rumusan_masalah": "Bagaimana mendeteksi ancaman dari dalam (insider threat) secara akurat menggunakan algoritma pembelajaran mesin terawasi?",
    "penelitian_terkini": "Menggabungkan berbagai model pembelajaran mesin termasuk LSTM, CNN, dan autoencoder untuk mendeteksi perilaku abnormal dari pengguna internal.",
    "hasil_yang_diharapkan": "Sistem dapat membedakan aktivitas normal dan mencurigakan dari pengguna untuk mendeteksi ancaman internal secara dini dan akurat.",
    "tantangan": "Kesulitan dalam membedakan perilaku abnormal dari perilaku sah, keterbatasan data ancaman internal yang berlabel, dan kebutuhan akan generalisasi model.",
    "hasil_akhir": "Model berbasis autoencoder dan deep learning terbukti efektif dalam mempelajari pola normal serta mengidentifikasi penyimpangan, dan telah memperoleh 23 sitasi sejak 2024."
  },

  {
    "judul": "Sensor Fault Detection and Classification Using Multi-Step-Ahead Prediction with an Long Short-Term Memory (LSTM) Autoencoder",
    "publisher": "mdpi.com",
    "author": ["Hasan, MN", "Jan, SU", "Koo, I"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/2076-3417/14/17/7717",
    "rumusan_masalah": "Bagaimana mendeteksi dan mengklasifikasikan kesalahan sensor secara dini menggunakan prediksi multi-langkah dengan model LSTM autoencoder?",
    "penelitian_terkini": "Menggunakan jaringan LSTM autoencoder untuk mempelajari pola sinyal sensor dan memprediksi beberapa langkah ke depan untuk mendeteksi penyimpangan.",
    "hasil_yang_diharapkan": "Model dapat mengidentifikasi anomali sensor secara akurat dan melakukan klasifikasi kesalahan secara real-time.",
    "tantangan": "Akurasi prediksi yang menurun pada horizon waktu yang panjang, serta kebutuhan pelatihan model yang tepat untuk berbagai jenis sensor.",
    "hasil_akhir": "Model LSTM autoencoder berhasil diterapkan untuk deteksi dan klasifikasi kesalahan sensor, dan telah mendapat 4 sitasi sejak 2024."
  },

  {
    "judul": "Anomaly detection using LSTM-based variational autoencoder in unsupervised data in power grid",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Guha, D", "Chatterjee, R", "Sikdar, B"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10109988/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam data tak berlabel dari jaringan listrik dengan menggunakan pendekatan unsupervised deep learning?",
    "penelitian_terkini": "Mengembangkan dan menerapkan model LSTM-based Variational Autoencoder (MVAE) untuk mendeteksi anomali dalam data power grid yang tidak berlabel.",
    "hasil_yang_diharapkan": "Model MVAE mampu membedakan data normal dan abnormal secara efisien, bahkan tanpa label pelatihan eksplisit.",
    "tantangan": "Menentukan distribusi laten yang tepat dalam struktur VAE yang dimodifikasi dan mengelola data power grid yang kompleks secara temporal.",
    "hasil_akhir": "Model LSTM-based MVAE berhasil diterapkan pada data jaringan listrik dan telah disitasi sebanyak 40 kali sejak tahun 2023."
  },

  {
    "judul": "Addag-ae: Anomaly detection in dynamic attributed graph based on graph attention network and LSTM autoencoder",
    "publisher": "mdpi.com",
    "author": ["Miao, G", "Wu, G", "Zhang, Z", "Tong, Y", "Lu, B"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/2079-9292/12/13/2763",
    "rumusan_masalah": "Bagaimana cara mendeteksi anomali dalam grafik dinamis beratribut menggunakan kombinasi Graph Attention Network (GAT) dan LSTM-Autoencoder?",
    "penelitian_terkini": "ADDAG-AE menggabungkan GAT dan LSTM-AE untuk merekonstruksi node dan atributnya, serta memprediksi perilaku anomali pada grafik dinamis.",
    "hasil_yang_diharapkan": "Sistem mampu secara akurat mendeteksi anomali pada data graf beratribut dengan menangkap baik fitur struktural maupun temporal.",
    "tantangan": "Mengintegrasikan informasi spasial dari GAT dan informasi temporal dari LSTM dalam grafik yang terus berubah.",
    "hasil_akhir": "ADDAG-AE menunjukkan performa yang menjanjikan dalam mendeteksi anomali pada data graf dinamis dan telah disitasi sebanyak 3 kali sejak 2023."
  },

  {
    "judul": "Autoencoder-LSTM Algorithm for Anomaly Detection",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Akbarian, H", "Mahgoub, I", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10374710/",
    "rumusan_masalah": "Bagaimana meningkatkan kinerja deteksi anomali dengan menggabungkan Autoencoder dan LSTM dibandingkan metode DNN-LSTM tradisional?",
    "penelitian_terkini": "Makalah ini mengusulkan algoritma AE-LSTM untuk mendeteksi anomali dan membandingkannya dengan model benchmark DNN-LSTM.",
    "hasil_yang_diharapkan": "Model AE-LSTM dapat menghasilkan akurasi deteksi anomali yang lebih tinggi dengan efisiensi yang lebih baik dibandingkan metode deep learning konvensional.",
    "tantangan": "Menyesuaikan arsitektur Autoencoder dan LSTM agar mampu belajar pola anomali dari data sekuensial secara efektif.",
    "hasil_akhir": "Model AE-LSTM menunjukkan performa yang menjanjikan dalam deteksi anomali dan telah disitasi sebanyak 5 kali sejak 2023."
  },

  {
    "judul": "Prediction model of sparse autoencoder-based bidirectional LSTM for wastewater flow rate",
    "publisher": "Springer",
    "author": ["Huang, J", "Yang, S", "Li, J", "Oh, J", "Kang, H"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s11227-022-04827-3",
    "rumusan_masalah": "Bagaimana membangun model prediksi aliran limbah air yang akurat dengan menggabungkan Sparse Autoencoder dan Bidirectional LSTM?",
    "penelitian_terkini": "Penelitian ini menggabungkan Sparse Autoencoder (SAE) dan Bidirectional Long Short-Term Memory (BLSTM) untuk memodelkan prediksi tingkat aliran limbah air.",
    "hasil_yang_diharapkan": "Model prediksi yang lebih akurat dan efisien untuk pengelolaan air limbah menggunakan pendekatan deep learning hibrid.",
    "tantangan": "Menggabungkan arsitektur SAE dan BLSTM untuk menangkap pola temporal dan spasial dari data waktu nyata yang kompleks.",
    "hasil_akhir": "Model SAE-BLSTM berhasil menunjukkan performa prediksi yang baik dan telah disitasi sebanyak 17 kali sejak tahun 2023."
  },

  {
    "judul": "GCN-based LSTM autoencoder with self-attention for bearing fault diagnosis",
    "publisher": "MDPI (Sensors)",
    "author": ["Lee, D", "Choo, H", "Jeong, J"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/1424-8220/24/15/4855",
    "rumusan_masalah": "Bagaimana meningkatkan diagnosis kerusakan bantalan dengan menggunakan arsitektur deep learning yang mampu menangani hubungan spasial dan temporal secara efektif?",
    "penelitian_terkini": "Penelitian ini menggabungkan Graph Convolutional Network (GCN), Long Short-Term Memory (LSTM), dan mekanisme self-attention dalam autoencoder untuk mendiagnosis kerusakan bantalan.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan ketahanan dalam mendeteksi kesalahan bantalan pada sistem mekanik menggunakan model deep learning berbasis GCN dan LSTM.",
    "tantangan": "Mengintegrasikan GCN, LSTM, dan self-attention secara efektif untuk memproses data waktu dan hubungan graf kompleks.",
    "hasil_akhir": "Model yang diusulkan menunjukkan performa diagnosis yang kuat dan telah dikutip 10 kali sejak diterbitkan pada tahun 2024."
  },

  {
    "judul": "RETRACTED: An effective ensemble classification framework for intrusion detection system using LSTM autoencoder",
    "publisher": "Journal of Intelligent & Fuzzy Systems (SAGE Journals)",
    "author": ["Ketepalli, G", "Bulla, P"],
    "tahun": 2024,
    "sumber_data": "https://journals.sagepub.com/doi/abs/10.3233/JIFS-232228",
    "rumusan_masalah": "Bagaimana merancang kerangka klasifikasi ansambel yang efektif untuk sistem deteksi intrusi berbasis LSTM autoencoder?",
    "penelitian_terkini": "Penelitian ini mengusulkan kombinasi LSTM dan autoencoder untuk mendeteksi pola lalu lintas jaringan dan meningkatkan akurasi sistem deteksi intrusi.",
    "hasil_yang_diharapkan": "Meningkatkan performa klasifikasi intrusi dengan memanfaatkan pendekatan ensembel berbasis deep learning.",
    "tantangan": "Artikel ini telah ditarik kembali (retracted), sehingga validitas ilmiah dan hasilnya tidak dapat dijamin.",
    "hasil_akhir": "Meskipun sempat diterbitkan dan dikutip 2 kali, artikel ini telah ditarik kembali, sehingga tidak direkomendasikan untuk dijadikan referensi utama."
  },

  {
    "judul": "Road Traffic Detection with a LSTM Autoencoder using State of Polarization on Deployed Metropolitan Fiber Cable",
    "publisher": "Conference on Optical Network Design and Modeling (ONDM) - IEEE",
    "author": ["Usmani, F", "D'Amico, A", "Bratovich, R", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10144849/",
    "rumusan_masalah": "Bagaimana memanfaatkan LSTM autoencoder untuk mendeteksi pola lalu lintas jalan dengan data optik dari kabel serat optik yang telah dipasang di lingkungan metropolitan?",
    "penelitian_terkini": "Penelitian ini mengembangkan metode deteksi lalu lintas jalan yang tidak bergantung pada kamera atau sensor fisik, melainkan menggunakan sinyal perubahan dalam State of Polarization (SOP) pada kabel fiber.",
    "hasil_yang_diharapkan": "Model LSTM autoencoder mampu mengenali pola lalu lintas jalan secara otomatis menggunakan data optik secara tidak terawasi.",
    "tantangan": "Mengolah data optik dari serat optik yang rentan terhadap noise lingkungan dan fluktuasi kecil serta menjaga akurasi deteksi dalam kondisi nyata.",
    "hasil_akhir": "Model berhasil menunjukkan bahwa LSTM autoencoder dapat digunakan untuk mendeteksi lalu lintas jalan melalui kabel fiber optik tanpa sensor tambahan, dan telah mendapat 4 sitasi sejak 2023."
  },

  {
    "judul": "Comparing Autoencoder and Isolation Forest in Network Anomaly Detection",
    "publisher": "IEEE Xplore (2023 33rd Conference of Open Innovations Association FRUCT)",
    "author": ["Smolen, T", "Benova, L"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10143005/",
    "rumusan_masalah": "Metode mana yang lebih efektif untuk deteksi anomali jaringan: autoencoder berbasis LSTM atau Isolation Forest?",
    "penelitian_terkini": "Penelitian ini membandingkan dua pendekatan populer dalam deteksi anomali jaringan, yaitu model Autoencoder berbasis LSTM dan algoritma Isolation Forest.",
    "hasil_yang_diharapkan": "Menentukan metode mana yang memberikan akurasi lebih tinggi dan lebih efisien dalam mendeteksi anomali jaringan.",
    "tantangan": "Menyesuaikan model dengan jenis data jaringan yang bervariasi serta mengatasi tantangan pada dimensi dan noise data real-world.",
    "hasil_akhir": "Model Autoencoder LSTM menunjukkan performa yang kompetitif terhadap Isolation Forest untuk tugas deteksi anomali, dan telah disitasi 8 kali sejak tahun 2023."
  },

  {
    "judul": "Joint coding-modulation for digital semantic communications via variational autoencoder",
    "publisher": "IEEE (IEEE Transactions on Communications)",
    "author": ["Bo, Y", "Duan, Y", "Shao, S", "Tao, M"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10495330/",
    "rumusan_masalah": "Bagaimana meningkatkan efisiensi dan efektivitas komunikasi semantik digital melalui pendekatan penggabungan coding dan modulasi menggunakan variational autoencoder (VAE)?",
    "penelitian_terkini": "Penelitian ini memanfaatkan VAE untuk merancang sistem komunikasi semantik digital yang menggabungkan proses pengkodean dan modulasi secara end-to-end.",
    "hasil_yang_diharapkan": "Peningkatan efisiensi spektrum dan pemahaman semantik dalam sistem komunikasi digital dengan arsitektur berbasis VAE.",
    "tantangan": "Kompleksitas dalam penggabungan pengkodean dan modulasi dalam ruang semantik, serta kestabilan pelatihan model VAE untuk data kompleks.",
    "hasil_akhir": "Model VAE menunjukkan kinerja unggul dalam komunikasi semantik digital dan telah disitasi sebanyak 57 kali sejak tahun 2024."
  },

  {
    "judul": "A deep learning-based intrusion detection approach for mobile Ad-hoc network",
    "publisher": "Springer (Soft Computing)",
    "author": ["Meddeb, R", "Jemili, F", "Triki, B", "Korbaa, O"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s00500-023-08324-4",
    "rumusan_masalah": "Bagaimana mendeteksi intrusi secara efektif dalam Mobile Ad-hoc Networks (MANET) menggunakan pendekatan deep learning?",
    "penelitian_terkini": "Menggabungkan Stacked Autoencoder dengan CNN dan LSTM untuk membentuk arsitektur deep learning dalam sistem deteksi intrusi pada jaringan MANET.",
    "hasil_yang_diharapkan": "Sistem IDS (Intrusion Detection System) berbasis deep learning yang akurat dan andal dalam mendeteksi anomali pada jaringan bergerak.",
    "tantangan": "Mengelola data jaringan yang dinamis, latensi rendah, dan keterbatasan sumber daya pada node MANET saat melatih model deep learning.",
    "hasil_akhir": "Model berhasil meningkatkan akurasi deteksi intrusi dan telah disitasi sebanyak 40 kali sejak dipublikasikan tahun 2023."
  },

  {
    "judul": "Modbus/rs-485 attack detection on communication signals with machine learning",
    "publisher": "IEEE (Communications)",
    "author": ["Ochiai, H", "Hossain, MD", "Chirupphapa, P", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10113798/",
    "rumusan_masalah": "Bagaimana mendeteksi serangan pada sinyal komunikasi Modbus/RS-485 menggunakan pendekatan machine learning?",
    "penelitian_terkini": "Penelitian memfokuskan pada penggunaan model autoencoder, termasuk MLP-autoencoder, 1D-CNN autoencoder, dan LSTM-autoencoder untuk deteksi anomali pada komunikasi industri.",
    "hasil_yang_diharapkan": "Pengembangan sistem deteksi serangan yang efektif dan efisien terhadap sinyal komunikasi berbasis Modbus/RS-485.",
    "tantangan": "Menangani keberagaman sinyal dan karakteristik trafik komunikasi industri dengan model yang mampu generalisasi dan memiliki akurasi tinggi.",
    "hasil_akhir": "MLP-autoencoder dipilih sebagai fokus utama, dengan hasil eksperimen menunjukkan efektivitas dalam mendeteksi anomali; artikel ini telah disitasi 12 kali sejak tahun 2023."
  },

  {
    "judul": "CNN autoencoder resizer: A power-efficient LoS/NLoS detector in MIMO-enabled UAV networks",
    "publisher": "IEEE (Communications)",
    "author": ["Akhtarshenas, A", "Ayoobi, N", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10817279/",
    "rumusan_masalah": "Bagaimana mendeteksi kondisi Line-of-Sight (LoS) dan Non-Line-of-Sight (NLoS) secara efisien dalam jaringan UAV dengan MIMO menggunakan pendekatan deep learning yang hemat daya?",
    "penelitian_terkini": "Mengusulkan arsitektur CNN autoencoder yang diintegrasikan dengan RNN untuk klasifikasi LoS/NLoS pada jaringan ultra-wideband (UWB) ad hoc yang digunakan dalam navigasi dalam ruangan oleh UAV.",
    "hasil_yang_diharapkan": "Sistem deteksi LoS/NLoS dengan efisiensi daya tinggi, akurasi tinggi, dan keandalan yang dapat meningkatkan keselamatan dan kinerja komunikasi UAV.",
    "tantangan": "Menghadapi keterbatasan daya UAV dan memastikan keandalan deteksi sinyal dalam kondisi kanal yang kompleks dan dinamis.",
    "hasil_akhir": "Model CNN-RNN autoencoder menunjukkan hasil menjanjikan dalam deteksi LoS/NLoS dengan efisiensi daya yang lebih baik; telah disitasi 2 kali sejak 2024."
  },

  {
    "judul": "Deep Autoencoder-Based Hybrid Network for Building Energy Consumption Forecasting",
    "publisher": "Computer Systems Science & Engineering (via ResearchGate)",
    "author": ["Khan, N", "Khan, SU"],
    "tahun": 2024,
    "sumber_data": "https://www.researchgate.net/profile/Noman-Khan-23/publication/374912116_Deep_Autoencoder-Based_Hybrid_Network_for_Building_Energy_Consumption_Forecasting/links/65b1b33e6c7ad06ab4279d4a/Deep-Autoencoder-Based-Hybrid-Network-for-Building-Energy-Consumption-Forecasting.pdf",
    "rumusan_masalah": "Bagaimana membangun model prediksi konsumsi energi bangunan yang akurat menggunakan pendekatan deep learning berbasis autoencoder?",
    "penelitian_terkini": "Mengembangkan jaringan hibrida berbasis deep autoencoder yang memanfaatkan LSTM dan convolutional LSTM untuk menangani komponen linier dan nonlinier dari data konsumsi energi.",
    "hasil_yang_diharapkan": "Prediksi konsumsi energi yang lebih akurat dan efisien untuk bangunan dengan mempertimbangkan dinamika linier dan nonlinier dari data historis.",
    "tantangan": "Menangani kompleksitas temporal dan spasial dari data konsumsi energi serta integrasi model linier dan nonlinier dalam satu arsitektur jaringan yang stabil.",
    "hasil_akhir": "Model dua fase (LSTM dan Conv-LSTM) menunjukkan performa yang baik dan telah disitasi sebanyak 5 kali sejak 2024."
  },

  {
    "judul": "Semi-2DCAE: a semi-supervision 2D-CNN AutoEncoder model for feature representation and classification of encrypted traffic",
    "publisher": "PeerJ Computer Science",
    "author": ["Cui, J", "Bai, L", "Li, G", "Lin, Z", "Zeng, P"],
    "tahun": 2023,
    "sumber_data": "https://peerj.com/articles/cs-1635/",
    "rumusan_masalah": "Bagaimana mengklasifikasikan lalu lintas terenkripsi secara efisien menggunakan pendekatan deep learning yang mampu menangani data terbatas dalam skenario semi-supervised?",
    "penelitian_terkini": "Model Semi-2DCAE yang menggabungkan 2D Convolutional AutoEncoder dengan pendekatan semi-supervised untuk representasi fitur dan klasifikasi data jaringan terenkripsi.",
    "hasil_yang_diharapkan": "Peningkatan akurasi klasifikasi terhadap data lalu lintas terenkripsi meskipun hanya tersedia sebagian label (semi-supervised).",
    "tantangan": "Kesulitan dalam menganalisis lalu lintas terenkripsi akibat teknik penyamaran seperti port randomization dan tunneling yang mengaburkan fitur utama.",
    "hasil_akhir": "Model Semi-2DCAE menunjukkan kinerja yang menjanjikan untuk klasifikasi lalu lintas terenkripsi dan telah disitasi sebanyak 5 kali sejak 2023."
  },

  {
    "judul": "Autoencoder application for anomaly detection in power consumption of lighting systems",
    "publisher": "IEEE Access",
    "author": ["Śmiałkowski, T", "Czyżewski, A"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10309114/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam konsumsi daya sistem pencahayaan secara otomatis dan efektif menggunakan model deep learning?",
    "penelitian_terkini": "Penggunaan Autoencoder yang dikombinasikan dengan LSTM dan jaringan konvolusional 1D untuk deteksi anomali pada data konsumsi energi listrik.",
    "hasil_yang_diharapkan": "Peningkatan kemampuan deteksi dini terhadap pola konsumsi daya yang tidak biasa atau abnormal dalam sistem pencahayaan.",
    "tantangan": "Membedakan anomali nyata dari variasi konsumsi listrik normal serta memilih arsitektur model yang optimal untuk performa tinggi.",
    "hasil_akhir": "Model berhasil menunjukkan efektivitas deteksi anomali pada berbagai jenis pola konsumsi listrik dan telah disitasi sebanyak 3 kali sejak 2023."
  },

  {
    "judul": "Employing Sequence-to-Sequence Stacked LSTM Autoencoder Architecture to Forecast Indian Weather",
    "publisher": "Elsevier - Procedia Computer Science",
    "author": ["Maharatha, A", "Das, R", "Mishra, J", "Nayak, SR"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S1877050924008901",
    "rumusan_masalah": "Bagaimana menerapkan arsitektur Stacked LSTM Autoencoder untuk memprediksi kondisi cuaca di India secara akurat?",
    "penelitian_terkini": "Studi ini mengeksplorasi penggunaan model sequence-to-sequence berbasis Stacked LSTM Autoencoder, serta membandingkannya dengan varian LSTM lainnya seperti vanilla LSTM dan bidirectional LSTM.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prakiraan cuaca harian berdasarkan data time-series iklim India dengan metode deep learning.",
    "tantangan": "Mengelola kompleksitas data sekuensial jangka panjang dan menentukan arsitektur LSTM yang paling optimal untuk prakiraan multivariat.",
    "hasil_akhir": "Model menunjukkan performa prediksi yang menjanjikan untuk prakiraan cuaca di India dan telah disitasi sebanyak 6 kali sejak dipublikasikan pada 2024."
  },

  {
    "judul": "A transferred spatio-temporal deep model based on multi-LSTM auto-encoder for air pollution time series missing value imputation",
    "publisher": "Elsevier - Future Generation Computer Systems",
    "author": ["Zhang, X", "Zhou, P"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0167739X24000839",
    "rumusan_masalah": "Bagaimana mengatasi hilangnya nilai pada data deret waktu polusi udara menggunakan pendekatan deep learning yang memanfaatkan informasi spasial dan temporal?",
    "penelitian_terkini": "Penelitian ini menggabungkan teknik transfer learning, deep autoencoder (DAE), dan multiple LSTM dalam satu arsitektur untuk mengimputasi nilai yang hilang pada data deret waktu polusi udara.",
    "hasil_yang_diharapkan": "Menghasilkan model yang mampu memprediksi nilai-nilai polusi udara yang hilang dengan akurasi tinggi dengan mempertimbangkan hubungan spasial-temporal antar lokasi pengukuran.",
    "tantangan": "Menggabungkan kompleksitas spasial dan temporal secara efektif dalam satu model deep learning, serta menangani ketidakkonsistenan data yang hilang.",
    "hasil_akhir": "Model yang diusulkan menunjukkan performa yang kompetitif dalam imputasi nilai yang hilang dan telah disitasi sebanyak 10 kali sejak tahun 2024."
  },

  {
    "judul": "Anomaly detection for connected autonomous vehicles using LSTM and Gaussian naïve Bayes",
    "publisher": "Springer - Conference on Wireless",
    "author": ["Mansourian, P", "Zhang, N", "Jaekel, A", "..."],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/chapter/10.1007/978-3-031-34851-8_3",
    "rumusan_masalah": "Bagaimana mendeteksi anomali pada kendaraan otonom yang terhubung (CAV) dengan mempertimbangkan komunikasi internal dan akses jaringan eksternal?",
    "penelitian_terkini": "Penelitian ini mengusulkan metode deteksi anomali berbasis LSTM Autoencoder yang dikombinasikan dengan Gaussian Naïve Bayes dan membandingkan performanya dengan metode lain.",
    "hasil_yang_diharapkan": "Meningkatkan deteksi dini terhadap perilaku anomali dalam sistem kendaraan otonom terhubung dengan akurasi tinggi.",
    "tantangan": "Mengelola kompleksitas data spasial-temporal dari kendaraan otonom dan menjaga akurasi prediksi dalam sistem distribusi komunikasi kendaraan.",
    "hasil_akhir": "Model gabungan LSTM Autoencoder dan Gaussian Naïve Bayes menunjukkan performa yang menjanjikan dan telah disitasi sebanyak 9 kali sejak 2023."
  },

  {
    "judul": "Simultaneous fault detection in satellite power systems using deep autoencoders and classifier chain",
    "publisher": "Springer - Telecommunication Systems",
    "author": ["Ganesan, M", "Lavanya, R"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s11235-023-00998-3",
    "rumusan_masalah": "Bagaimana mendeteksi beberapa jenis gangguan secara simultan pada sistem tenaga satelit dengan akurasi tinggi?",
    "penelitian_terkini": "Penelitian ini mengusulkan penggunaan deep autoencoder bersama classifier chain untuk mengklasifikasikan dan mendeteksi gangguan simultan pada sistem tenaga satelit.",
    "hasil_yang_diharapkan": "Mampu mengenali berbagai jenis gangguan secara bersamaan dan meningkatkan keandalan sistem tenaga satelit.",
    "tantangan": "Mengklasifikasikan banyak jenis gangguan secara bersamaan dan menangani ketidakseimbangan kelas dalam data gangguan.",
    "hasil_akhir": "Model deep autoencoder yang digabungkan dengan classifier chain menunjukkan performa yang baik dalam deteksi gangguan simultan dan telah disitasi 4 kali sejak 2023."
  },

  {
    "judul": "Network Anomaly Detection Using Autoencoder on Various Datasets: A Comprehensive Review",
    "publisher": "Bentham Science - Recent Patents on ...",
    "author": ["Singh, R", "Srivastava, N", "Kumar, A"],
    "tahun": 2024,
    "sumber_data": "https://www.benthamdirect.com/content/journals/eng/10.2174/0118722121242429230922070752",
    "rumusan_masalah": "Bagaimana efektivitas metode autoencoder, khususnya LSTM-autoencoder, dalam mendeteksi anomali jaringan pada berbagai dataset?",
    "penelitian_terkini": "Artikel ini merupakan tinjauan komprehensif tentang metode deteksi anomali jaringan menggunakan autoencoder, dengan fokus pada integrasi LSTM-autoencoder dan OC-SVM.",
    "hasil_yang_diharapkan": "Menunjukkan keunggulan pendekatan LSTM-autoencoder dalam mendeteksi anomali jaringan serta mengevaluasi performanya di berbagai dataset.",
    "tantangan": "Menentukan model autoencoder yang optimal, mengatasi kompleksitas data jaringan, serta membandingkan efektivitas metode di berbagai kondisi dan dataset.",
    "hasil_akhir": "LSTM autoencoder yang dikombinasikan dengan OC-SVM terbukti efektif untuk deteksi anomali jaringan dan telah disitasi sebanyak 12 kali sejak tahun 2024."
  },

  {
    "judul": "Ae-net: Novel autoencoder-based deep features for SQL injection attack detection",
    "publisher": "IEEE",
    "author": ["Thalji, N", "Raza, A", "Islam, MS", "Samee, NA"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10332180/",
    "rumusan_masalah": "Bagaimana merancang pendekatan autoencoder baru yang efektif untuk mendeteksi serangan SQL Injection dalam sistem jaringan?",
    "penelitian_terkini": "Makalah ini memperkenalkan AE-Net, sebuah pendekatan deep learning berbasis autoencoder yang dioptimalkan untuk ekstraksi fitur dalam deteksi serangan SQL Injection.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan efisiensi deteksi serangan SQL Injection dengan memanfaatkan fitur mendalam dari autoencoder.",
    "tantangan": "Mengurangi kesalahan deteksi yang tinggi pada model LSTM konvensional serta mengembangkan model yang mampu menangani data serangan yang kompleks.",
    "hasil_akhir": "AE-Net menunjukkan performa yang unggul dalam deteksi serangan SQL Injection dibanding pendekatan LSTM tradisional. Artikel ini telah disitasi sebanyak 23 kali sejak tahun 2023."
  },

  {
    "judul": "An LSTM-autoencoder based online side channel monitoring approach for cyber-physical attack detection in additive manufacturing",
    "publisher": "Springer",
    "author": ["Shi, Z", "Mamun, AA", "Kan, C", "Tian, W", "Liu, C"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s10845-021-01879-9",
    "rumusan_masalah": "Bagaimana mendeteksi serangan siber-fisik secara online dalam proses manufaktur aditif melalui analisis sinyal samping (side-channel) menggunakan pembelajaran mendalam?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan monitoring sinyal samping secara online berbasis LSTM-autoencoder untuk mendeteksi anomali akibat serangan siber dalam sistem manufaktur aditif.",
    "hasil_yang_diharapkan": "Mengembangkan sistem pendeteksi serangan yang mampu secara real-time mengenali aktivitas tidak normal berdasarkan pola sinyal yang kompleks.",
    "tantangan": "Menangkap karakteristik waktu dan representasi non-linier dari data sinyal yang rumit dengan akurasi tinggi dan latensi rendah.",
    "hasil_akhir": "Model LSTM-autoencoder berhasil menunjukkan efektivitas tinggi dalam mendeteksi serangan siber di sistem manufaktur aditif. Artikel ini telah disitasi sebanyak 80 kali sejak 2023."
  },

  {
    "judul": "Novelty detection and fault diagnosis method for bearing faults based on the hybrid deep autoencoder network",
    "publisher": "MDPI (Electronics)",
    "author": ["Zhao, Y", "Hao, H", "Chen, Y", "Zhang, Y"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/2079-9292/12/13/2826",
    "rumusan_masalah": "Bagaimana mendeteksi gangguan baru (novelty) dan mendiagnosis kerusakan bantalan secara efektif menggunakan jaringan autoencoder dalam?",
    "penelitian_terkini": "Penelitian ini menggabungkan model LSTM Autoencoder dan Stacked Autoencoder (SAE) sebagai pendekatan hibrida untuk diagnosis kesalahan bantalan.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan sensitivitas sistem diagnosis kerusakan dengan memanfaatkan kekuatan dari arsitektur deep learning LSTM dan SAE.",
    "tantangan": "Membangun jaringan hibrida yang kompleks namun efisien yang mampu menangani data getaran bearing secara real-time tanpa overfitting.",
    "hasil_akhir": "Model hibrida menunjukkan kinerja superior dibandingkan metode individual, dengan struktur 8 lapisan neural network dalam LSTM autoencoder. Artikel ini telah disitasi sebanyak 26 kali sejak 2023."
  },

  {
    "judul": "FACT: Autoencoder and Attention Conv-LSTM based Collaborative Framework for Cloud Cover Prediction",
    "publisher": "IEEE",
    "author": ["Patel, M", "Tanwar, S", "Jadav, NK", "Gupta, R", "Pau, G"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10630474/",
    "rumusan_masalah": "Bagaimana memprediksi tutupan awan secara akurat menggunakan pendekatan deep learning yang kolaboratif dan efisien?",
    "penelitian_terkini": "Artikel ini memperkenalkan FACT, kerangka kerja kolaboratif berbasis Autoencoder dan Attention Conv-LSTM untuk prediksi tutupan awan. Dibandingkan Stack-LSTM dan CNN-LSTM.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi tutupan awan dengan menggabungkan reduksi dimensi oleh autoencoder dan pemrosesan spasio-temporal oleh Attention Conv-LSTM.",
    "tantangan": "Mengelola kompleksitas data spasial-temporal dan mengoptimalkan perhatian (attention) dalam jaringan LSTM konvolusional untuk menghasilkan prediksi jangka pendek yang akurat.",
    "hasil_akhir": "FACT berhasil mengurangi dimensi data menggunakan autoencoder dan meningkatkan performa prediksi. Artikel ini telah disitasi sebanyak 2 kali sejak 2024."
  },

  {
    "judul": "A Frequency Domain Predictive Channel Model for 6G Wireless MIMO Communications Based on Deep Learning",
    "publisher": "IEEE",
    "author": ["Huang, C", "Wang, CX", "Li, Z", "Qian, Z", "Li, J"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10466759/",
    "rumusan_masalah": "Bagaimana membangun model prediksi kanal frekuensi domain untuk komunikasi nirkabel 6G MIMO menggunakan pendekatan deep learning yang akurat dan efisien?",
    "penelitian_terkini": "Studi ini mengembangkan model prediktif domain frekuensi berbasis deep learning untuk sistem komunikasi MIMO 6G, memanfaatkan Autoencoder dengan arsitektur alternatif (bukan hanya fully connected) dan jaringan LSTM.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi kanal komunikasi 6G dalam domain frekuensi dengan arsitektur deep learning yang inovatif.",
    "tantangan": "Membangun arsitektur jaringan yang mampu menangkap karakteristik temporal dan frekuensi secara efektif dalam kanal nirkabel 6G.",
    "hasil_akhir": "Model berhasil divalidasi dengan jaringan LSTM dan Autoencoder dengan desain non-konvensional. Artikel ini telah disitasi sebanyak 10 kali sejak 2024."
  },

  {
    "judul": "Intelligent Reflecting Surface Enhanced Wireless Communications With MultiHead-Attention Sparse Autoencoder-Based Channel Prediction",
    "publisher": "IEEE",
    "author": ["Chen, HY", "Wu, MH", "Yang, TW", "Liao, JW"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10231324/",
    "rumusan_masalah": "Bagaimana meningkatkan prediksi kanal dalam sistem komunikasi nirkabel yang diperkuat dengan Intelligent Reflecting Surface (IRS) menggunakan metode deep learning yang efisien?",
    "penelitian_terkini": "Mengusulkan model prediksi kanal berbasis autoencoder denoising sparsely-connected dengan perhatian multi-head (MultiHead-Attention Sparse Autoencoder), sebagai solusi untuk memprediksi kanal dalam sistem IRS.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi kanal IRS dengan model deep learning yang hemat parameter dan efisien.",
    "tantangan": "Menggabungkan kompleksitas struktur IRS dengan efisiensi dan akurasi model channel prediction berbasis deep learning dalam kondisi nirkabel yang dinamis.",
    "hasil_akhir": "Model yang diusulkan menunjukkan performa yang kompetitif dan telah disitasi 3 kali sejak dipublikasikan pada 2023."
  },

  {
    "judul": "CSI-based human activity recognition using multi-input multi-output autoencoder and fine-tuning",
    "publisher": "MDPI (Sensors)",
    "author": ["Chahoushi, M", "Nabati, M", "Asvadi, R", "Ghorashi, SA"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/1424-8220/23/7/3591",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi pengenalan aktivitas manusia berbasis CSI (Channel State Information) menggunakan pendekatan autoencoder yang disesuaikan dengan fine-tuning?",
    "penelitian_terkini": "Mengembangkan arsitektur autoencoder multi-input multi-output yang menggabungkan lapisan CNN dan LSTM, dengan fine-tuning untuk klasifikasi aktivitas manusia dari data CSI.",
    "hasil_yang_diharapkan": "Peningkatan performa deteksi aktivitas manusia dengan memanfaatkan autoencoder yang mampu menangkap fitur spasial dan temporal dari data CSI.",
    "tantangan": "Memproses sinyal CSI kompleks dan menangkap dinamika temporal aktivitas manusia secara akurat dalam lingkungan nyata.",
    "hasil_akhir": "Model menunjukkan kinerja yang kompetitif dan telah disitasi sebanyak 12 kali sejak 2023."
  },

  {
    "judul": "Anomaly detection in connected and autonomous vehicle trajectories using LSTM autoencoder and Gaussian mixture model",
    "publisher": "MDPI (Electronics)",
    "author": ["Wang, B", "Li, W", "Khattak, ZH"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/2079-9292/13/7/1251",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam lintasan kendaraan otonom dan terhubung (CAVs) secara efektif menggunakan model deep learning?",
    "penelitian_terkini": "Mengusulkan kombinasi LSTM Autoencoder dan Gaussian Mixture Model (GMM) untuk mendeteksi anomali dalam data lintasan CAVs.",
    "hasil_yang_diharapkan": "Model dapat mengidentifikasi pergerakan kendaraan yang tidak normal atau tidak biasa untuk meningkatkan keselamatan dan keandalan sistem transportasi cerdas.",
    "tantangan": "Menangani kerumitan data lintasan yang bersifat sekuensial dan dinamis dalam lingkungan lalu lintas dunia nyata.",
    "hasil_akhir": "Model gabungan LSTM Autoencoder dan GMM menunjukkan efektivitas dalam mendeteksi anomali dan telah disitasi sebanyak 10 kali sejak 2024."
  },

  {
    "judul": "Underwater wireless optical communication with one-bit quantization: A hybrid autoencoder and generative adversarial network approach",
    "publisher": "IEEE (Transactions on Wireless Communications)",
    "author": ["Zou, C", "Yang, F", "Song, J", "Han, Z"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10044696/",
    "rumusan_masalah": "Bagaimana meningkatkan performa komunikasi optik nirkabel bawah air dengan keterbatasan kuantisasi satu bit?",
    "penelitian_terkini": "Mengusulkan pendekatan hibrida yang menggabungkan Autoencoder (AE) dan Generative Adversarial Network (GAN) untuk meningkatkan efisiensi komunikasi optik bawah air.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi pemulihan sinyal dalam sistem komunikasi optik bawah air yang dibatasi oleh kuantisasi satu bit.",
    "tantangan": "Menghadapi keterbatasan kuantisasi sinyal digital dan lingkungan bawah air yang sangat dinamis dan kompleks.",
    "hasil_akhir": "Model hybrid AE-GAN berhasil meningkatkan performa sistem komunikasi bawah air dan telah disitasi sebanyak 15 kali sejak 2023."
  },

  {
    "judul": "A novel approach of botnet detection using hybrid deep learning for enhancing security in IoT networks",
    "publisher": "Elsevier (Alexandria Engineering Journal)",
    "author": ["Ali, S", "Ghazal, R", "Qadeer, N", "Saidani, O", "Alhayan, F"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S1110016824005830",
    "rumusan_masalah": "Bagaimana mendeteksi botnet secara efektif dalam jaringan IoT yang terus berkembang dengan serangan yang semakin kompleks?",
    "penelitian_terkini": "Mengusulkan pendekatan deteksi botnet berbasis deep learning hibrida dengan menggabungkan LSTM Autoencoders dan Multilayer Perceptron (MLP) khusus untuk keamanan IoT.",
    "hasil_yang_diharapkan": "Deteksi yang lebih akurat terhadap aktivitas botnet dalam jaringan IoT sekaligus mengurangi false positive.",
    "tantangan": "Menghadapi variasi besar dalam pola lalu lintas data IoT dan meningkatkan kemampuan deteksi terhadap serangan yang tidak diketahui sebelumnya.",
    "hasil_akhir": "Model hybrid LSTM Autoencoder + MLP menunjukkan performa tinggi dalam mendeteksi botnet dan telah mendapatkan 17 sitasi sejak tahun 2024."
  },

  {
    "judul": "A novel smartphone-based human activity recognition approach using convolutional autoencoder long short-term memory network",
    "publisher": "IEEE",
    "author": ["Thakur, D", "Roy, S", "Biswas, S", "Ho, ESL"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10229380/",
    "rumusan_masalah": "Bagaimana mengembangkan sistem pengenalan aktivitas manusia (HAR) berbasis smartphone yang akurat dan efisien menggunakan deep learning?",
    "penelitian_terkini": "Menggabungkan arsitektur Convolutional Neural Network (CNN), Autoencoder, dan Long Short-Term Memory (LSTM) untuk meningkatkan akurasi dan efisiensi HAR berbasis smartphone.",
    "hasil_yang_diharapkan": "Model deep learning yang mampu mendeteksi aktivitas manusia secara real-time dengan akurasi tinggi melalui sensor pada smartphone.",
    "tantangan": "Menangani keragaman sinyal sensor dan memastikan efisiensi komputasi agar dapat diterapkan langsung di perangkat mobile.",
    "hasil_akhir": "Model CNN-Autoencoder-LSTM menunjukkan sinergi efektif dalam mengklasifikasi aktivitas manusia dengan 17 sitasi sejak tahun 2023."
  },

  {
    "judul": "Deep learning in physical layer communications: Evolution and prospects in 5G and 6G networks",
    "publisher": "Wiley Online Library",
    "author": ["Mao, C", "Mu, Z", "Liang, Q", "Schizas, I", "Pan, C"],
    "tahun": 2023,
    "sumber_data": "https://ietresearch.onlinelibrary.wiley.com/doi/abs/10.1049/cmu2.12669",
    "rumusan_masalah": "Bagaimana perkembangan dan prospek penerapan deep learning, termasuk autoencoder dan GAN, dalam komunikasi lapisan fisik pada jaringan 5G dan 6G?",
    "penelitian_terkini": "Studi ini meninjau penggunaan berbagai arsitektur deep learning seperti RNN, autoencoder, dan GAN dalam konteks komunikasi lapisan fisik, dengan fokus pada sistem komunikasi masa depan.",
    "hasil_yang_diharapkan": "Menawarkan wawasan tentang bagaimana teknik deep learning dapat meningkatkan efisiensi spektral, keandalan transmisi, dan deteksi sinyal di jaringan 5G dan 6G.",
    "tantangan": "Menghadapi kompleksitas model dan kebutuhan komputasi tinggi, serta keterbatasan dalam generalisasi model deep learning untuk skenario komunikasi yang dinamis.",
    "hasil_akhir": "Artikel ini memberikan kerangka evolusi penggunaan deep learning di lapisan fisik dan telah dikutip sebanyak 14 kali sejak 2023, menandakan relevansinya di bidang jaringan generasi lanjut."
  },

  {
    "judul": "CANival: A multimodal approach to intrusion detection on the vehicle CAN bus",
    "publisher": "Elsevier",
    "author": ["Kang, H", "Vo, T", "Kim, HK", "Hong, JB"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2214209624001207",
    "rumusan_masalah": "Bagaimana mengembangkan metode deteksi intrusi yang efektif untuk sistem komunikasi Controller Area Network (CAN) pada kendaraan, yang pada dasarnya tidak memiliki mekanisme keamanan bawaan?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan multimodal berbasis deep learning untuk menganalisis lalu lintas data CAN bus guna mendeteksi perilaku mencurigakan secara real-time.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi intrusi dan mengurangi false positives pada sistem komunikasi kendaraan melalui model deteksi yang menggabungkan beberapa sumber data.",
    "tantangan": "Keterbatasan protokol CAN yang tidak menyediakan otentikasi atau enkripsi, serta kebutuhan untuk memproses data dalam waktu nyata di lingkungan sistem tertanam.",
    "hasil_akhir": "CANival terbukti efektif dalam mendeteksi anomali pada CAN bus kendaraan dan telah memperoleh 8 sitasi sejak tahun 2024, menunjukkan kontribusi penting dalam keamanan kendaraan otonom."
  },
  {
    "type": "separator",
    "title": "Cybersecurity",
    "image": "cyber-security.png"
  }
]
