[
  {
    "type": "separator",
    "title": "Mr Sindhu Ebook Summary Research",
    "image": ""
  },
  {
    "type": "separator",
    "title": "Intrusion Detection",
    "image": "intrusion.png"
  },
  {
    "judul": "Large language models in wireless application design: In-context learning-enhanced automatic network intrusion detection",
    "publisher": "IEEE",
    "author": ["Zhang, H", "Sediq, AB", "Afana, A", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10901312/",
    "rumusan_masalah": "Bagaimana memanfaatkan kemampuan in-context learning dari Large Language Models (LLMs) untuk merancang sistem deteksi intrusi jaringan otomatis yang lebih akurat dan adaptif dalam aplikasi komunikasi nirkabel?",
    "penelitian_terkini": "Penelitian ini mengeksplorasi penggunaan LLM yang telah dilatih sebelumnya untuk mendeteksi serangan jaringan seperti DDoS tanpa perlu pelatihan ulang model, menggunakan pendekatan in-context learning.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi intrusi yang lebih fleksibel, adaptif terhadap pola ancaman baru, dan tidak memerlukan pelatihan model ulang seperti metode machine learning tradisional.",
    "tantangan": "Implementasi LLM di lingkungan jaringan nirkabel yang memiliki keterbatasan sumber daya, serta kebutuhan untuk menjaga latensi rendah dan efisiensi dalam inferensi model besar.",
    "hasil_akhir": "Model LLM yang diusulkan menunjukkan performa yang kompetitif dalam mendeteksi lalu lintas jaringan berbahaya secara otomatis, dan telah mendapatkan 25 sitasi sejak tahun 2024, menunjukkan dampak yang signifikan di bidang keamanan jaringan.",
    "sitasi": 25
  },
  {
    "judul": "PLLM-CS: Pre-trained Large Language Model (LLM) for cyber threat detection in satellite networks",
    "publisher": "Elsevier",
    "author": [
      "Hassanin, M",
      "Keshk, M",
      "Salim, S",
      "Alsubaie, M",
      "Sharma, D"
    ],
    "tahun": 2025,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S1570870524002567",
    "rumusan_masalah": "Bagaimana merancang sistem deteksi ancaman siber yang efektif untuk jaringan satelit yang rentan terhadap serangan dan belum memiliki sistem deteksi intrusi yang memadai?",
    "penelitian_terkini": "Penelitian ini memperkenalkan PLLM-CS, sebuah model deteksi ancaman siber berbasis LLM yang telah dilatih sebelumnya dan diadaptasi khusus untuk konteks jaringan satelit.",
    "hasil_yang_diharapkan": "Menghadirkan sistem deteksi intrusi yang lebih akurat dan kontekstual pada jaringan satelit, dengan kemampuan generalisasi dari model LLM yang telah dilatih pada domain terkait.",
    "tantangan": "Kurangnya data pelatihan spesifik untuk domain satelit, kompleksitas dalam menyelaraskan LLM dengan protokol dan arsitektur jaringan satelit, serta keterbatasan daya komputasi pada perangkat luar angkasa.",
    "hasil_akhir": "PLLM-CS berhasil mendeteksi berbagai bentuk ancaman siber pada jaringan satelit dengan akurasi tinggi, dan telah memperoleh 38 sitasi sejak tahun 2025, menunjukkan dampak dan relevansinya dalam keamanan luar angkasa.",
    "sitasi": 38
  },
  {
    "judul": "Large Language Models for Network Intrusion Detection Systems: Foundations, Implementations, and Future Directions",
    "publisher": "arXiv.org",
    "author": [
      "Yang, S",
      "Zheng, X",
      "Zhang, X",
      "Xu, J",
      "Li, J",
      "Xie, D",
      "..."
    ],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2507.04752",
    "rumusan_masalah": "Bagaimana Large Language Models (LLMs) dapat digunakan secara efektif dalam arsitektur dan implementasi sistem deteksi intrusi jaringan (NIDS), serta tantangan yang menyertainya?",
    "penelitian_terkini": "Penelitian ini mengulas pendekatan berbasis LLM untuk NIDS, mencakup fondasi teori, implementasi praktis (seperti LLM-enhanced Processor dan LLM-based Detector), serta arahan penelitian ke depan.",
    "hasil_yang_diharapkan": "Mendorong pemanfaatan LLM dalam sistem keamanan jaringan agar mampu memahami konteks komunikasi jaringan secara lebih dalam dan adaptif terhadap serangan baru.",
    "tantangan": "Kebutuhan komputasi yang tinggi untuk menjalankan LLM dalam sistem real-time, integrasi dengan arsitektur jaringan yang kompleks, dan kurangnya data yang cocok untuk pelatihan berbasis LLM.",
    "hasil_akhir": "Studi ini menyediakan landasan teoritis dan kerangka implementasi untuk integrasi LLM dalam NIDS, serta membuka peluang riset lanjutan mengenai optimalisasi, efisiensi, dan keamanan berbasis model bahasa besar.",
    "sitasi": 0
  },
  {
    "judul": "FedLLMGuard: A federated large language model for anomaly detection in 5G networks",
    "publisher": "Elsevier",
    "author": ["Rezaei, H", "Taheri, R", "Shojafar, M"],
    "tahun": 2025,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S1389128625004402",
    "rumusan_masalah": "Bagaimana mengintegrasikan model bahasa besar (LLM) dalam skema federated learning untuk mendeteksi anomali secara efisien dan terdesentralisasi di jaringan 5G, serta mengatasi potensi serangan adversarial?",
    "penelitian_terkini": "Penelitian ini memperkenalkan FedLLMGuard, yaitu model LLM terdistribusi yang dilatih secara federatif untuk mendeteksi anomali di jaringan 5G, sekaligus mengusulkan serangan baru bernama CorruptNet untuk menguji ketahanan model.",
    "hasil_yang_diharapkan": "Menciptakan sistem deteksi anomali yang cerdas, terdistribusi, dan tahan terhadap serangan adversarial dalam ekosistem jaringan 5G yang kompleks.",
    "tantangan": "Sinkronisasi pembelajaran federatif yang efisien, keandalan LLM dalam konteks jaringan, serta ancaman dari serangan adversarial seperti CorruptNet.",
    "hasil_akhir": "FedLLMGuard menunjukkan efektivitas tinggi dalam deteksi anomali berbasis konteks secara terdistribusi, dan memperlihatkan ketahanan terhadap serangan CorruptNet yang diusulkan dalam penelitian ini.",
    "sitasi": 0
  },
  {
    "judul": "Hybrid LLM-Enhanced Intrusion Detection for Zero-Day Threats in IoT Networks",
    "publisher": "arXiv.org",
    "author": ["Al-Hammouri, MF", "Otoum, Y", "Atwa, R", "Nayak, A"],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2507.07413",
    "rumusan_masalah": "Bagaimana membangun sistem deteksi intrusi berbasis hybrid yang memanfaatkan Large Language Models (LLMs) untuk mengenali serangan zero-day dan multivector pada jaringan IoT yang rentan?",
    "penelitian_terkini": "Penelitian ini menggabungkan LLM dengan deep neural network dalam arsitektur hybrid untuk mendeteksi eksploitasi zero-day di jaringan IoT yang berkomunikasi melalui saluran publik yang tidak aman.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi intrusi cerdas yang mampu mengenali ancaman baru secara kontekstual dan cepat, terutama serangan zero-day pada ekosistem IoT.",
    "tantangan": "Kerentanan IoT terhadap berbagai bentuk serangan, keterbatasan sumber daya perangkat IoT, dan kompleksitas dalam mengintegrasikan model LLM yang besar ke dalam sistem hybrid.",
    "hasil_akhir": "Model hybrid yang dikembangkan terbukti efektif dalam mendeteksi serangan zero-day secara lebih akurat dan kontekstual, dengan memanfaatkan kekuatan pemahaman semantik dari LLM.",
    "sitasi": 0
  },
  {
    "judul": "Machine Learning-Based Intrusion Detection Systems: Capabilities, Methodologies, and Open Research Challenges",
    "publisher": "techrxiv.org",
    "author": ["Zhang, C", "Wang, N", "Hou, YT", "Lou, W"],
    "tahun": 2025,
    "sumber_data": "http://www.techrxiv.org/doi/full/10.36227/techrxiv.173627464.48290242/v1",
    "rumusan_masalah": "Apa saja kemampuan, pendekatan terkini, dan tantangan terbuka dalam pengembangan sistem deteksi intrusi berbasis machine learning, terutama terkait adaptasi terhadap protokol enkripsi yang terus berkembang dan serangan baru?",
    "penelitian_terkini": "Artikel ini merupakan tinjauan komprehensif terhadap berbagai metodologi deteksi intrusi berbasis machine learning, serta membahas potensi integrasi LLM untuk meningkatkan pemahaman konteks dalam mendeteksi serangan baru.",
    "hasil_yang_diharapkan": "Memberikan panduan sistematis untuk pengembangan IDS berbasis ML yang lebih adaptif, fleksibel, dan mampu mengantisipasi perubahan teknologi komunikasi yang cepat.",
    "tantangan": "Kesulitan adaptasi terhadap protokol enkripsi yang terus berkembang, keterbatasan data label, kompleksitas serangan baru, dan integrasi ML/LLM dalam sistem real-time.",
    "hasil_akhir": "Tinjauan ini mengidentifikasi kesenjangan penelitian dan menawarkan arahan untuk meningkatkan kemampuan deteksi serangan menggunakan ML dan LLM di masa depan, serta telah memperoleh 1 sitasi.",
    "sitasi": 1
  },
  {
    "judul": "Transforming Network Intrusion Detection Using Large Language Models",
    "publisher": "IEEE",
    "author": ["Wu, D", "Peng, Z", "Chen, M", "Liu, Y"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10976105/",
    "rumusan_masalah": "Bagaimana mengintegrasikan model bahasa besar (LLMs) dengan pendekatan machine learning klasik seperti decision tree untuk meningkatkan efektivitas sistem deteksi intrusi jaringan?",
    "penelitian_terkini": "Studi ini mengeksplorasi penggabungan decision tree dengan LLM untuk menciptakan sistem deteksi intrusi jaringan yang mampu memahami konteks komunikasi serta meningkatkan akurasi klasifikasi serangan.",
    "hasil_yang_diharapkan": "Meningkatkan kinerja sistem deteksi intrusi jaringan dengan memanfaatkan kekuatan pemrosesan semantik LLM dalam interpretasi lalu lintas jaringan dan pengambilan keputusan yang lebih cerdas.",
    "tantangan": "Sinkronisasi antara struktur logika decision tree dan representasi berbasis konteks dari LLM, serta kebutuhan akan efisiensi komputasi dalam proses deteksi waktu nyata.",
    "hasil_akhir": "Integrasi decision tree dan LLM menghasilkan pendekatan yang lebih adaptif dalam mendeteksi intrusi jaringan, menawarkan transisi yang mulus dari metode tradisional ke sistem berbasis pemahaman semantik.",
    "sitasi": 0
  },
  {
    "judul": "Leveraging Machine Learning Techniques in Intrusion Detection Systems for Internet of Things",
    "publisher": "arXiv.org",
    "author": ["Jamshidi, S", "Nikanjam, A", "Wazed, NK", "..."],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2504.07220",
    "rumusan_masalah": "Bagaimana memanfaatkan teknik machine learning, termasuk LLM, untuk membangun sistem deteksi intrusi yang efektif dalam lingkungan IoT yang kompleks dan penuh ancaman?",
    "penelitian_terkini": "Penelitian ini membahas berbagai teknik ML, termasuk penggunaan LLM, untuk menganalisis lalu lintas IoT guna mendeteksi anomali yang mengindikasikan adanya serangan siber.",
    "hasil_yang_diharapkan": "Mengembangkan IDS berbasis machine learning yang dapat secara otomatis mengenali pola lalu lintas tidak biasa di jaringan IoT, sehingga meningkatkan kemampuan deteksi terhadap serangan yang baru dan kompleks.",
    "tantangan": "Keterbatasan sumber daya perangkat IoT, kebutuhan akan data berkualitas untuk pelatihan, serta kesulitan dalam mendeteksi pola serangan yang sangat bervariasi dan tersembunyi.",
    "hasil_akhir": "Studi ini menunjukkan bahwa kombinasi teknik machine learning dan LLM dapat secara efektif meningkatkan akurasi deteksi intrusi di lingkungan IoT, dan telah memperoleh 1 sitasi sejak tahun 2025.",
    "sitasi": 1
  },
  {
    "judul": "Harnessing the advanced capabilities of LLM for adaptive intrusion detection systems",
    "publisher": "Springer",
    "author": ["Lira, OG", "Marroquin, A", "To, MA"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/chapter/10.1007/978-3-031-57942-4_44",
    "rumusan_masalah": "Bagaimana memanfaatkan kemampuan canggih dari Large Language Models (LLMs) untuk membangun sistem deteksi intrusi adaptif yang efektif dalam mendeteksi anomali dan serangan di lingkungan digital yang kompleks seperti substation IEC 61850?",
    "penelitian_terkini": "Penelitian ini mengaplikasikan LLM untuk mendukung klasifikasi biner dalam sistem komunikasi substation berbasis IEC 61850, serta menggabungkan deep learning dalam proses deteksi ancaman secara adaptif.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi intrusi adaptif yang mampu memahami konteks operasional infrastruktur kritis dan meningkatkan akurasi identifikasi anomali atau serangan.",
    "tantangan": "Kompleksitas data dari sistem kontrol industri seperti IEC 61850, kebutuhan pemrosesan real-time, dan adaptasi LLM terhadap domain spesifik seperti substation digital.",
    "hasil_akhir": "Studi ini menunjukkan bahwa LLM dapat secara efektif meningkatkan kemampuan klasifikasi biner untuk deteksi anomali pada sistem substation, dan telah memperoleh 21 sitasi sejak tahun 2024.",
    "sitasi": 21
  },
  {
    "judul": "Integrated LLM-Based Intrusion Detection with Secure Slicing xApp for Securing O-RAN-Enabled Wireless Network Deployments",
    "publisher": "arXiv.org",
    "author": ["Moore, J", "Abdalla, AS", "Khanal, P", "Marojevic, V"],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2504.00341",
    "rumusan_masalah": "Bagaimana mengintegrasikan LLM dengan aplikasi secure slicing (xApp) untuk meningkatkan deteksi dan pencegahan serangan siber seperti DDoS pada deployment jaringan nirkabel berbasis O-RAN?",
    "penelitian_terkini": "Penelitian ini mengembangkan sistem komunikasi nirkabel berbasis O-RAN yang dilengkapi dengan deteksi intrusi berbasis LLM dan xApp untuk melakukan segmentasi keamanan secara efisien.",
    "hasil_yang_diharapkan": "Meningkatkan keamanan dan efisiensi dalam mendeteksi serangan seperti DDoS dengan memanfaatkan kemampuan analitik semantik dari LLM dan segmentasi dinamis melalui secure slicing xApp.",
    "tantangan": "Kompleksitas integrasi LLM dalam sistem O-RAN, kebutuhan real-time dalam pengolahan data, dan pengelolaan beban komputasi model besar dalam infrastruktur jaringan nirkabel.",
    "hasil_akhir": "Model LLM terintegrasi dengan secure slicing xApp terbukti efektif dalam mendeteksi dan mengelola serangan DDoS pada jaringan O-RAN, serta telah memperoleh 1 sitasi sejak tahun 2025.",
    "sitasi": 1
  },
  {
    "judul": "LLM-Based Continuous Intrusion Detection Framework for Next-Gen Networks",
    "publisher": "IEEE",
    "author": ["Adjewa, F", "Esseghir, M", "..."],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/11059643/",
    "rumusan_masalah": "Bagaimana membangun kerangka deteksi intrusi berkelanjutan berbasis LLM yang mampu beradaptasi dengan dinamika ancaman pada jaringan generasi berikutnya, mengatasi keterbatasan sistem tradisional yang berbasis data statis?",
    "penelitian_terkini": "Penelitian ini memperkenalkan kerangka kerja deteksi intrusi yang terus-menerus dan kontekstual menggunakan LLM, yang dirancang untuk mengatasi kekurangan IDS tradisional yang bergantung pada dataset terbatas dan statis.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi intrusi adaptif yang mampu melakukan analisis dinamis secara real-time terhadap lalu lintas jaringan dan mengenali ancaman baru secara berkelanjutan.",
    "tantangan": "Keterbatasan IDS tradisional dalam menghadapi serangan zero-day, kesulitan memperoleh dataset terkini yang representatif, serta kebutuhan untuk melakukan pembaruan deteksi secara kontinu.",
    "hasil_akhir": "Kerangka kerja berbasis LLM yang dikembangkan menunjukkan kemampuan adaptif yang tinggi dalam mendeteksi ancaman baru di jaringan generasi berikutnya, dan telah memperoleh 4 sitasi sejak tahun 2025.",
    "sitasi": 4
  },
  {
    "judul": "Towards explainable network intrusion detection using large language models",
    "publisher": "IEEE",
    "author": ["Houssel, PRB", "Singh, P", "Layeghy, S", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10946944/",
    "rumusan_masalah": "Bagaimana memanfaatkan Large Language Models (LLMs) untuk mendeteksi serangan jaringan secara lebih transparan dan dapat dijelaskan, dibandingkan dengan pendekatan machine learning tradisional?",
    "penelitian_terkini": "Penelitian ini mengeksplorasi pemanfaatan LLM yang telah dilatih dengan instruksi spesifik untuk mendeteksi serangan berdasarkan arus jaringan, serta membandingkan keunggulan dan keterbatasannya terhadap ML tradisional.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi intrusi berbasis LLM yang tidak hanya akurat tetapi juga dapat menjelaskan alasan di balik setiap keputusan deteksinya (explainability).",
    "tantangan": "Minimnya transparansi dalam metode deteksi berbasis deep learning, serta tantangan dalam membangun sistem LLM yang mampu memberikan output yang dapat dimengerti oleh manusia (human-readable explanations).",
    "hasil_akhir": "LLM yang dilatih secara instruksional berhasil mendeteksi serangan jaringan dengan pendekatan yang lebih dapat dijelaskan, dan telah mendapatkan 16 sitasi sejak 2024.",
    "sitasi": 16
  },
  {
    "judul": "Anomaly Detection in 6G Networks Using Large Language Models (LLMs)",
    "publisher": "IEEE",
    "author": ["Abasi, AK", "Aloqaily, M", "Guizani, M"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/11059535/",
    "rumusan_masalah": "Bagaimana menerapkan LLM untuk mendeteksi anomali pada jaringan 6G yang kompleks dan berkembang secara dinamis?",
    "penelitian_terkini": "Penelitian ini mengkaji penerapan LLM dalam mendeteksi pola anomali dan serangan pada jaringan 6G, menggantikan atau menggabungkan metode deep learning tradisional.",
    "hasil_yang_diharapkan": "Sistem deteksi anomali berbasis LLM yang mampu beradaptasi dengan pola serangan yang terus berubah pada jaringan 6G.",
    "tantangan": "Mengelola kompleksitas data dan dinamika serangan di lingkungan jaringan 6G, serta membangun sistem LLM yang scalable dan efisien.",
    "hasil_akhir": "Model LLM yang diusulkan menunjukkan kinerja yang kuat dalam mendeteksi anomali pada dataset yang kompleks dan dinamis, menjadi solusi menjanjikan untuk keamanan jaringan 6G.",
    "sitasi": 0
  },
  {
    "judul": "A Systematic Comparison of Large Language Models Performance for Intrusion Detection",
    "publisher": "ACM",
    "author": ["Bui, MT", "Boffa, M", "Valentim, RV", "Navarro, JM", "..."],
    "tahun": 2024,
    "sumber_data": "https://dl.acm.org/doi/abs/10.1145/3696379",
    "rumusan_masalah": "Bagaimana performa berbagai pendekatan LLM (prompting, RAG, fine-tuning) dalam mendeteksi serangan siber dibandingkan metode machine learning tradisional?",
    "penelitian_terkini": "Penelitian membandingkan performa LLM yang menggunakan teknik berbeda (prompting, retrieval augmented generation, fine-tuning) terhadap data intrusi.",
    "hasil_yang_diharapkan": "Menentukan pendekatan LLM terbaik untuk intrusion detection berdasarkan keakuratan dan efisiensinya.",
    "tantangan": "Mengadaptasi model LLM untuk skenario serangan dunia nyata yang kompleks dan bervariasi.",
    "hasil_akhir": "Beberapa pendekatan LLM terbukti mampu mengungguli metode machine learning konvensional dalam akurasi deteksi, namun dengan trade-off pada biaya komputasi.",
    "sitasi": 2
  },
  {
    "judul": "A survey on Hybrid-CNN and LLMs for intrusion detection systems: Recent IoT datasets",
    "publisher": "IEEE",
    "author": ["Elouardi, S", "Motii, A", "Jouhari, M", "Amadou, ANH", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10767686/",
    "rumusan_masalah": "Bagaimana efektivitas model hybrid CNN dan LLM untuk deteksi intrusi dalam lingkungan IoT menggunakan dataset terbaru?",
    "penelitian_terkini": "Studi survei terhadap metode Hybrid CNN + LLM dalam sistem deteksi intrusi berbasis IoT, menggunakan beberapa dataset terkini.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan kemampuan generalisasi sistem deteksi intrusi melalui kombinasi CNN dan LLM.",
    "tantangan": "Mengelola kompleksitas komunikasi IoT dan keterbatasan sumber daya saat menerapkan model hybrid.",
    "hasil_akhir": "Hybrid CNN-LLM terbukti meningkatkan performa deteksi serangan dibanding metode konvensional dalam skenario IoT.",
    "sitasi": 8
  },
  {
    "judul": "Evaluating Large Language Models for Enhanced Intrusion Detection in Internet of Things Networks",
    "publisher": "IEEE",
    "author": ["Nwafor, E", "Baskota, U", "Parwez, MS", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10901300/",
    "rumusan_masalah": "Bagaimana kinerja model LLM dalam mendeteksi ancaman jaringan dibandingkan dengan model pembelajaran mesin konvensional di lingkungan IoT?",
    "penelitian_terkini": "Mengevaluasi framework LLM untuk deteksi ancaman di jaringan IoT, termasuk membandingkan LLM yang telah disesuaikan (fine-tuned) dengan model ML tradisional.",
    "hasil_yang_diharapkan": "Meningkatkan efektivitas dan efisiensi deteksi serangan jaringan IoT menggunakan LLM yang telah dilatih khusus.",
    "tantangan": "Membandingkan kinerja LLM dengan model tradisional dalam kondisi nyata, dan memastikan keefektifannya terhadap berbagai jenis serangan umum.",
    "hasil_akhir": "LLM yang telah disesuaikan memberikan performa deteksi serangan yang lebih tinggi dibanding baseline machine learning models.",
    "sitasi": 2
  },
  {
    "judul": "Machine Learning and Large Language Models-Based Techniques for Cyber Threat Detection: A Comparative Study",
    "publisher": "IEEE",
    "author": ["Abdennebi, A", "Morsli, R", "Kara, N", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10756998/",
    "rumusan_masalah": "Bagaimana perbandingan kinerja teknik Machine Learning dan Large Language Models dalam mendeteksi ancaman siber?",
    "penelitian_terkini": "Studi komparatif antara model ML klasik (misalnya SVM, Bi-LSTM) dan LLM dalam mendeteksi serangan siber yang berkembang cepat.",
    "hasil_yang_diharapkan": "Menemukan keunggulan dan keterbatasan masing-masing pendekatan (ML vs. LLM) dalam konteks deteksi ancaman dunia nyata.",
    "tantangan": "Cepatnya perubahan teknik serangan dan frekuensinya membutuhkan model yang adaptif dan kuat terhadap variasi.",
    "hasil_akhir": "LLM menunjukkan potensi besar dalam komunikasi nirkabel dan deteksi ancaman, melampaui sebagian metode ML tradisional.",
    "sitasi": 1
  },
  {
    "judul": "LLM-Driven APT Detection for 6G Wireless Networks: A Systematic Review and Taxonomy",
    "publisher": "arXiv",
    "author": ["Golec, M", "Khamayseh, Y", "Melhem, SB", "..."],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2505.18846",
    "rumusan_masalah": "Bagaimana LLM dapat dimanfaatkan untuk mendeteksi Advanced Persistent Threats (APT) dalam jaringan 6G?",
    "penelitian_terkini": "Ulasan sistematis tentang arsitektur dan pendekatan LLM dalam mendeteksi APT serta klasifikasi teknik berdasarkan taksonomi tertentu.",
    "hasil_yang_diharapkan": "Menawarkan kerangka kerja taksonomi dan pemahaman mendalam untuk pengembangan sistem deteksi APT berbasis LLM di jaringan 6G.",
    "tantangan": "Kebutuhan akan deteksi ancaman real-time di jaringan berkecepatan tinggi seperti 6G yang memiliki latensi sangat rendah.",
    "hasil_akhir": "LLM berpotensi besar untuk meningkatkan deteksi ancaman dan APT di lingkungan komunikasi generasi berikutnya.",
    "sitasi": 2
  },
  {
    "judul": "Large Language Model (LLM) for Telecommunications: A Comprehensive Survey on Principles, Key Techniques, and Opportunities",
    "publisher": "IEEE Xplore / arXiv",
    "author": ["Zhou, H", "Hu, C", "Yuan, Y", "Cui, Y", "Jin, Y", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10685369/",
    "rumusan_masalah": "Bagaimana prinsip kerja dan teknik kunci dari LLM dapat dimanfaatkan dalam bidang telekomunikasi, termasuk untuk deteksi dan klasifikasi serangan jaringan?",
    "penelitian_terkini": "Studi komprehensif yang membahas penerapan LLM di berbagai aplikasi telekomunikasi seperti klasifikasi serangan jaringan, pemrosesan teks teknis, dan pengelolaan jaringan berbasis AI.",
    "hasil_yang_diharapkan": "Menyediakan panduan sistematis untuk pengembangan dan penerapan LLM di domain telekomunikasi modern.",
    "tantangan": "Skalabilitas, kebutuhan data besar, interpretabilitas model, dan keamanan dalam penerapan LLM di sistem jaringan kompleks.",
    "hasil_akhir": "LLM menunjukkan potensi besar dalam merevolusi sistem telekomunikasi, baik untuk otomasi proses, deteksi serangan, hingga pengambilan keputusan berbasis teks teknis.",
    "sitasi": 151
  },
  {
    "judul": "Beyond detection: large language models and next-generation cybersecurity",
    "publisher": "peninsula-press.ae",
    "author": ["Ali, A", "Ghanem, MC"],
    "tahun": 2025,
    "sumber_data": "https://peninsula-press.ae/Journals/index.php/SHIFRA/article/view/183",
    "rumusan_masalah": "Bagaimana memanfaatkan kemampuan LLM untuk meningkatkan keamanan siber generasi berikutnya melampaui deteksi intrusi tradisional, termasuk pencegahan eksfiltrasi data dan pemantauan komunikasi?",
    "penelitian_terkini": "Penelitian ini mengeksplorasi penggunaan LLM untuk memperluas fungsi IDS tradisional menjadi sistem proaktif yang dapat mencegah eskfiltrasi data dan memonitor aliran komunikasi secara real‑time.",
    "hasil_yang_diharapkan": "Membangun kerangka keamanan siber yang adaptif dan semantik‑aware, mampu mendeteksi, mencegah, dan merespon ancaman lanjutan dengan tingkat presisi lebih tinggi daripada pendekatan rule‑based.",
    "tantangan": "Integrasi LLM dalam pipeline keamanan real‑time, handling data sensitif, optimasi latensi inferensi, dan menjaga privasi serta kepatuhan regulasi.",
    "hasil_akhir": "Framework LLM‑powered IDS berhasil mendeteksi upaya eksfiltrasi data dan memonitor komunikasi jaringan dengan lebih efektif dibanding sistem berbasis aturan, membuka jalur untuk keamanan siber generasi berikutnya.",
    "sitasi": 0
  },
  {
    "judul": "Application of large language models to DDoS attack detection",
    "publisher": "Springer",
    "author": ["Guastalla, M", "Li, Y", "Hekmati, A", "..."],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/chapter/10.1007/978-3-031-51630-6_6",
    "rumusan_masalah": "Apakah LLM dapat digunakan untuk mendeteksi serangan DDoS dengan efektivitas yang lebih tinggi dibanding metode machine learning konvensional?",
    "penelitian_terkini": "Studi ini mengevaluasi performa LLM yang telah dilatih sebelumnya dalam mendeteksi serangan DDoS, termasuk pendekatan fine-tuning untuk meningkatkan akurasi deteksi.",
    "hasil_yang_diharapkan": "Mengembangkan metode deteksi DDoS berbasis LLM yang lebih akurat dan dapat beradaptasi dengan pola serangan baru dibandingkan metode ML klasik.",
    "tantangan": "Kebutuhan sumber daya tinggi untuk pelatihan dan inferensi LLM, serta kesulitan dalam generalisasi terhadap variasi serangan DDoS yang sangat dinamis.",
    "hasil_akhir": "Model LLM yang diteliti menunjukkan performa deteksi yang lebih baik dari machine learning tradisional dalam mengidentifikasi serangan DDoS, terutama setelah dilakukan fine-tuning dengan dataset OM-WC.",
    "sitasi": 58
  },
  {
    "judul": "Efficient federated intrusion detection in 5G ecosystem using optimized BERT-based model",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Adjewa, F", "Esseghir, M", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10770340/",
    "rumusan_masalah": "Bagaimana mengembangkan sistem deteksi intrusi yang efisien dan terdistribusi (federated) di lingkungan 5G dengan memanfaatkan model BERT yang dioptimalkan?",
    "penelitian_terkini": "Mengusulkan sistem Intrusion Detection System berbasis federated learning dengan LLM (khususnya BERT yang dioptimalkan) untuk mendeteksi serangan secara cerdas dalam jaringan 5G.",
    "hasil_yang_diharapkan": "Peningkatan efisiensi dan akurasi deteksi intrusi dalam arsitektur 5G tanpa mengorbankan privasi data pengguna.",
    "tantangan": "Sinkronisasi model federated, keterbatasan komputasi perangkat edge, dan adaptasi LLM seperti BERT dalam skenario real-time jaringan seluler.",
    "hasil_akhir": "Sistem deteksi intrusi federated berbasis BERT menunjukkan performa yang menjanjikan dalam hal efisiensi dan akurasi pada ekosistem 5G.",
    "sitasi": 10
  },
  {
    "judul": "False Alarms, Real Damage: Adversarial Attacks Using LLM-based Models on Text-based Cyber Threat Intelligence Systems",
    "publisher": "arxiv.org",
    "author": ["Shafee, S", "Bessani, A", "Ferreira, PM"],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2507.06252",
    "rumusan_masalah": "Bagaimana teks adversarial berbasis LLM dapat digunakan untuk menyerang sistem intelijen ancaman siber berbasis teks?",
    "penelitian_terkini": "Mengembangkan dan mengevaluasi metode serangan multistep bernama EaTVul terhadap sistem deteksi ancaman siber berbasis teks yang memanfaatkan LLM.",
    "hasil_yang_diharapkan": "Memperlihatkan bahwa sistem intelijen ancaman siber rentan terhadap manipulasi teks dengan LLM, sehingga dapat memberikan peringatan palsu atau melewatkan ancaman nyata.",
    "tantangan": "Mendeteksi dan mencegah manipulasi teks yang terlihat sah secara sintaksis namun berbahaya secara semantik dalam sistem berbasis LLM.",
    "hasil_akhir": "Model EaTVul berhasil menunjukkan efektivitas serangan adversarial berbasis teks terhadap sistem cyber threat intelligence, menyoroti perlunya pertahanan terhadap LLM-based manipulation.",
    "sitasi": 0
  },
  {
    "judul": "A comprehensive overview of large language models (LLMs) for cyber defences: Opportunities and directions",
    "publisher": "arxiv.org",
    "author": ["Hassanin, M", "Moustafa, N"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2405.14487",
    "rumusan_masalah": "Bagaimana LLM dapat digunakan secara efektif dalam pertahanan siber, dan apa saja peluang serta arah pengembangannya di masa depan?",
    "penelitian_terkini": "Meninjau teknik-teknik pertahanan siber berbasis LLM, termasuk penerapannya dalam menganalisis komunikasi dan aliran data untuk mendeteksi ancaman.",
    "hasil_yang_diharapkan": "Memberikan panduan komprehensif tentang penggunaan LLM untuk pertahanan siber, serta mengidentifikasi area yang menjanjikan untuk penelitian dan pengembangan.",
    "tantangan": "Membuat LLM cukup efisien dan andal untuk diterapkan secara real-time pada komunikasi dan aliran data yang besar dalam lingkungan dunia nyata.",
    "hasil_akhir": "LLM terbukti sebagai alat yang kuat untuk deteksi ancaman siber, namun membutuhkan pendekatan yang tepat dalam penerapannya agar efektif dan aman.",
    "sitasi": 49
  },
  {
    "judul": "Beyond detection: Leveraging large language models for cyber attack prediction in IoT networks",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Diaf, A", "Korba, AA", "Karabadji, NE", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10621562/",
    "rumusan_masalah": "Bagaimana memanfaatkan model bahasa besar (LLM) untuk tidak hanya mendeteksi tetapi juga memprediksi serangan siber pada jaringan IoT?",
    "penelitian_terkini": "Mengembangkan prediktor paket berikutnya berbasis LLM untuk digunakan dalam sistem deteksi intrusi, serta kerangka kerja deteksi serangan menggunakan BERT dan deep learning.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan sistem untuk mengantisipasi serangan sebelum terjadi, bukan hanya mendeteksi setelah serangan dilakukan.",
    "tantangan": "Menangani kompleksitas dan heterogenitas jaringan IoT serta memastikan LLM dapat beroperasi secara efisien dalam lingkungan terbatas sumber daya.",
    "hasil_akhir": "LLM terbukti menjanjikan dalam memprediksi pola serangan siber pada jaringan IoT dengan akurasi tinggi dan pendekatan prediktif yang lebih proaktif.",
    "sitasi": 15
  },
  {
    "judul": "Labeling Network Intrusion Detection System (NIDS) Rules with MITRE ATT&CK Techniques: Machine Learning vs. Large Language Models",
    "publisher": "search.proquest.com",
    "author": ["Nir, D", "Kaiser, FK", "Giladi, S", "Sharabi, S", "..."],
    "tahun": 2025,
    "sumber_data": "https://search.proquest.com/openview/01b46566ec684bbcd7e6112a3ed33a0f/1?pq-origsite=gscholar&cbl=2061777",
    "rumusan_masalah": "Bagaimana perbandingan efektivitas antara machine learning dan large language models (LLM) dalam memberi label pada aturan NIDS berdasarkan teknik MITRE ATT&CK?",
    "penelitian_terkini": "LLM digunakan untuk secara otomatis menjalankan seluruh pipeline pelabelan serangan pada sistem deteksi intrusi jaringan (NIDS), termasuk analisis dan pemetaan ke teknik MITRE ATT&CK.",
    "hasil_yang_diharapkan": "Mengurangi beban kerja analis keamanan dengan otomatisasi pelabelan dan menghasilkan hipotesis akurat terhadap serangan.",
    "tantangan": "Membandingkan efektivitas dan akurasi pelabelan antara pendekatan ML konvensional dan LLM, serta mempertimbangkan kemampuan generalisasi dan pemahaman kontekstual LLM.",
    "hasil_akhir": "LLM menunjukkan potensi untuk menyederhanakan proses pelabelan serangan pada NIDS dengan hasil yang kompetitif terhadap pipeline machine learning tradisional.",
    "sitasi": 3
  },
  {
    "judul": "Large Language Model-Based Federated Zero-Shot Learning for Intrusion Detection in Smart Grids",
    "publisher": "Springer",
    "author": ["Dasgupta, R", "Mitra, P"],
    "tahun": 2025,
    "sumber_data": "https://link.springer.com/chapter/10.1007/978-3-031-96235-6_24",
    "rumusan_masalah": "Bagaimana memanfaatkan model bahasa besar (LLM) dalam pembelajaran nol tembakan (zero-shot learning) federatif untuk mendeteksi intrusi pada sistem smart grid?",
    "penelitian_terkini": "Menggabungkan LLM dalam kerangka federated zero-shot learning, di mana LLM global menghasilkan representasi serangan dan klien lokal menggunakan DNN untuk deteksi serangan tanpa pelabelan eksplisit.",
    "hasil_yang_diharapkan": "Meningkatkan efisiensi deteksi anomali dan komunikasi antar node dalam sistem smart grid tanpa perlu pelatihan berbasis data lokal yang lengkap.",
    "tantangan": "Sinkronisasi antara model global (LLM) dan lokal (DNN), serta akurasi dalam mendeteksi serangan tanpa pelatihan berbasis label.",
    "hasil_akhir": "Pendekatan ini memberikan deteksi serangan yang efisien dengan komunikasi yang lebih hemat dan kemampuan generalisasi lebih baik melalui representasi LLM.",
    "sitasi": 0
  },
  {
    "judul": "Utilizing large language models for DDoS attack detection",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Mahmoodi, M", "Jameii, SM"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10688345/",
    "rumusan_masalah": "Bagaimana memanfaatkan LLM seperti LLaMA 2 dalam mendeteksi serangan DDoS berdasarkan data teks dari komunikasi jaringan?",
    "penelitian_terkini": "Menggunakan LLaMA 2 yang difinetune untuk mendeteksi pola serangan DDoS pada komunikasi LAN dan internet, serta membandingkannya dengan metode deep learning lainnya.",
    "hasil_yang_diharapkan": "Model LLM mampu memberikan akurasi lebih tinggi dalam mendeteksi DDoS dibandingkan metode deep learning konvensional.",
    "tantangan": "Konversi data jaringan ke format teks yang bisa diproses oleh LLM serta optimasi proses fine-tuning pada domain spesifik serangan jaringan.",
    "hasil_akhir": "LLM seperti LLaMA 2 dapat digunakan secara efektif dalam mendeteksi DDoS dengan performa kompetitif dibandingkan model deep learning lainnya.",
    "sitasi": 4
  },
  {
    "judul": "Evaluating Language Models For Threat Detection in IoT Security Logs",
    "publisher": "arxiv.org",
    "author": ["Tejero-Fernández, JJ", "Sánchez-Macián, A"],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2507.02390",
    "rumusan_masalah": "Seberapa efektif model bahasa besar (LLM) dalam mendeteksi ancaman dan mengklasifikasikan serangan berdasarkan log keamanan IoT?",
    "penelitian_terkini": "Evaluasi terhadap tiga model LLM yang digunakan untuk mendeteksi dan mengklasifikasikan serangan dalam log IoT, serta menghasilkan saran mitigasi.",
    "hasil_yang_diharapkan": "LLM dapat menyamai atau melampaui kinerja model machine learning klasik dalam mendeteksi serangan IoT dan memberikan rekomendasi mitigasi.",
    "tantangan": "Kesesuaian LLM dengan format log IoT, serta keakuratan klasifikasi dan efektivitas mitigasi otomatis yang dihasilkan.",
    "hasil_akhir": "Model LLM menunjukkan hasil sebanding dengan metode machine learning klasik, dengan keunggulan dalam generasi teks untuk mitigasi otomatis.",
    "sitasi": 0
  },
  {
    "judul": "… Approach Framework for Enhancing Network Traffic Analysis (DAFENTA): Leveraging NumeroLogic LLM Embeddings and Transformer Models for Intrusion Detection",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Yu, N", "Davies, L", "Zhong, W"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10825828/",
    "rumusan_masalah": "Bagaimana cara meningkatkan analisis lalu lintas jaringan dan deteksi intrusi dengan memanfaatkan embedding LLM dan model transformer?",
    "penelitian_terkini": "Pengembangan kerangka kerja DAFENTA yang menggabungkan embedding dari model LLM (NumeroLogic) dengan model transformer untuk mendeteksi serangan dalam jaringan, khususnya di sistem komunikasi nirkabel.",
    "hasil_yang_diharapkan": "Meningkatkan representasi data jaringan dan efektivitas deteksi serangan melalui pendekatan pembelajaran kontekstual dengan LLM dan transformer.",
    "tantangan": "Integrasi yang efektif antara embedding LLM dengan arsitektur transformer, serta skalabilitas sistem dalam lingkungan jaringan nyata.",
    "hasil_akhir": "DAFENTA menunjukkan peningkatan dalam akurasi deteksi serangan dibanding pendekatan machine learning tradisional, dan sudah mulai disitasi oleh penelitian lain.",
    "sitasi": 1
  },
  {
    "judul": "Large language models in 6G security: challenges and opportunities",
    "publisher": "arxiv.org",
    "author": ["Nguyen, T", "Nguyen, H", "Ijaz, A", "Sheikhi, S", "..."],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2403.12239",
    "rumusan_masalah": "Apa saja tantangan dan peluang dalam penerapan Large Language Models (LLMs) untuk keamanan jaringan 6G?",
    "penelitian_terkini": "Menjelajahi peran LLM dalam keamanan 6G, termasuk potensi ancaman terhadap model LLM, penerapan dalam paradigma 'LLM-native Telecom', dan pengembangan agen otonom berbasis LLM untuk pengamanan jaringan.",
    "hasil_yang_diharapkan": "Membuka jalan bagi penerapan LLM sebagai komponen integral dalam keamanan jaringan generasi ke-6, serta merancang pendekatan baru berbasis AI untuk mengatasi ancaman siber yang kompleks.",
    "tantangan": "Ancaman terhadap LLM yang tidak langsung (indirect), integrasi LLM dalam arsitektur jaringan 6G, serta kebutuhan pelatihan dan adaptasi model dalam skala besar.",
    "hasil_akhir": "Studi ini telah menjadi referensi dalam diskusi awal tentang integrasi LLM dalam sistem komunikasi 6G dan sudah disitasi 21 kali sejak dipublikasikan.",
    "sitasi": 21
  },
  {
    "judul": "A novel generative AI-based framework for anomaly detection in multicast messages in smart grid communications",
    "publisher": "arxiv.org",
    "author": ["Zaboli, A", "Choi, SL", "Song, TJ", "Hong, J"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2406.05472",
    "rumusan_masalah": "Bagaimana cara mendeteksi anomali pada pesan multicast dalam komunikasi smart grid dengan pendekatan generative AI berbasis LLM?",
    "penelitian_terkini": "Pengembangan framework ToD berbasis LLM yang dapat mendeteksi anomali dalam pesan multicast smart grid, sebagai pendekatan baru yang belum pernah diterapkan sebelumnya.",
    "hasil_yang_diharapkan": "Sistem deteksi anomali berbasis LLM yang lebih efisien dan akurat dalam mengamankan komunikasi multicast pada infrastruktur smart grid.",
    "tantangan": "Kompleksitas data multicast, kebutuhan akurasi tinggi untuk deteksi dini, dan integrasi model generatif ke dalam sistem komunikasi real-time.",
    "hasil_akhir": "Framework ini menunjukkan performa menjanjikan dan telah memperoleh 3 sitasi dalam waktu singkat sejak publikasi awal.",
    "sitasi": 3
  },
  {
    "judul": "Applications of LLMs in quantum-aware cybersecurity leveraging LLMs for real-time anomaly detection and threat intelligence",
    "publisher": "igi-global.com",
    "author": ["Ajimon, ST", "Kumar, S"],
    "tahun": 2025,
    "sumber_data": "https://www.igi-global.com/chapter/applications-of-llms-in-quantum-aware-cybersecurity-leveraging-llms-for-real-time-anomaly-detection-and-threat-intelligence/366980",
    "rumusan_masalah": "Bagaimana Large Language Models dapat diterapkan dalam sistem keamanan siber yang menyadari keberadaan teknologi kuantum untuk mendeteksi anomali dan memberikan intelijen ancaman secara real-time?",
    "penelitian_terkini": "Menggunakan arsitektur Transformer-based deep learning dalam sistem deteksi intrusi (IDS) untuk memantau komunikasi pada jaringan seperti Controller Area Network (CAN) dengan dukungan dari LLM.",
    "hasil_yang_diharapkan": "Penggunaan LLM untuk meningkatkan kemampuan IDS dalam mengidentifikasi ancaman dan anomali secara real-time pada lingkungan sistem siber yang rentan terhadap komputasi kuantum.",
    "tantangan": "Integrasi LLM dengan sistem kuantum-aware secara efisien, penyesuaian model dengan komunikasi real-time, serta peningkatan presisi tanpa meningkatkan kompleksitas sistem.",
    "hasil_akhir": "Framework ini berhasil menarik perhatian komunitas ilmiah dengan 7 sitasi sejak publikasi, menunjukkan potensinya dalam meningkatkan deteksi ancaman berbasis LLM.",
    "sitasi": 7
  },
  {
    "judul": "Exploiting LLM embeddings for content-based IoT anomaly detection",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Wang, T", "Zhao, Z", "Wu, K"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10690230/",
    "rumusan_masalah": "Bagaimana cara memanfaatkan embeddings dari Large Language Models (LLM) untuk meningkatkan deteksi anomali berbasis konten dalam sistem IoT?",
    "penelitian_terkini": "Mengacu pada laporan intelijen ancaman Nokia 2023 yang menyebutkan 60% serangan siber pada sektor telekomunikasi, penelitian ini memanfaatkan LLM embeddings untuk mengekstraksi fitur secara otomatis guna meningkatkan performa sistem deteksi intrusi.",
    "hasil_yang_diharapkan": "Sistem deteksi anomali yang lebih efisien dan akurat dengan memanfaatkan representasi fitur dari LLM embeddings pada data IoT.",
    "tantangan": "Menggabungkan embeddings LLM dengan arsitektur deep learning yang ringan namun akurat untuk diterapkan di perangkat IoT dengan keterbatasan sumber daya.",
    "hasil_akhir": "Pendekatan ini telah menarik perhatian ilmuwan dan praktisi keamanan IoT dengan 7 sitasi sejak publikasi, menunjukkan relevansi dan potensi penerapannya.",
    "sitasi": 7
  },
  {
    "judul": "Bartpredict: Empowering IoT Security with LLM-Driven Cyber Threat Prediction",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Diaf, A", "Korba, AA", "Karabadji, NE", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10901770/",
    "rumusan_masalah": "Bagaimana memanfaatkan model LLM, khususnya BART, untuk meningkatkan kemampuan prediksi ancaman siber pada sistem keamanan IoT termasuk serangan bertahap dan serangan yang belum pernah terlihat sebelumnya?",
    "penelitian_terkini": "Mengintegrasikan LLM dengan teknik deep learning untuk membangun sistem prediksi ancaman siber yang lebih adaptif dan akurat, dengan fokus pada serangan multistage dan zero-day di lingkungan IoT.",
    "hasil_yang_diharapkan": "Sistem keamanan IoT berbasis LLM yang dapat mendeteksi dan memprediksi ancaman siber secara real-time, termasuk pola serangan kompleks dan tidak dikenal.",
    "tantangan": "Menangani kompleksitas dan generalisasi model LLM dalam konteks data IoT yang bervariasi, serta mengoptimalkan kinerja prediksi pada perangkat dengan keterbatasan komputasi.",
    "hasil_akhir": "Model BARTPredict berhasil meningkatkan efisiensi sistem deteksi intrusi dan telah mendapatkan 6 sitasi sejak publikasi, mencerminkan relevansi dan efektivitas pendekatan LLM dalam keamanan IoT.",
    "sitasi": 6
  },
  {
    "judul": "A Preliminary Study on an Intrusion Detection Method using Large Language Models in Industrial Control Systems",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Ann, SH", "Cho, SJ", "Kim, H"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10625633/",
    "rumusan_masalah": "Bagaimana memanfaatkan Large Language Models (LLM) untuk mendeteksi intrusi pada sistem kontrol industri (ICS) yang dirancang untuk komunikasi dan otomasi?",
    "penelitian_terkini": "Studi ini mengeksplorasi penggunaan LLM untuk analisis lalu lintas jaringan ICS setelah proses pra-pemrosesan, serta potensi integrasi deep learning dan NLP dalam konteks deteksi ancaman industri.",
    "hasil_yang_diharapkan": "Menguji efektivitas awal LLM dalam mendeteksi serangan terhadap infrastruktur ICS dengan memanfaatkan representasi semantik data jaringan industri.",
    "tantangan": "Keterbatasan data industri yang tersedia, kebutuhan pra-pemrosesan yang tepat untuk menyesuaikan format data ICS dengan input LLM, serta akurasi deteksi pada domain kritis industri.",
    "hasil_akhir": "Penelitian awal ini menunjukkan potensi LLM dalam deteksi intrusi ICS, membuka arah baru dalam keamanan siber untuk sistem industri melalui pendekatan berbasis bahasa alami.",
    "sitasi": 0
  },
  {
    "judul": "Towards novel malicious packet recognition: A few-shot learning approach",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Stein, K", "Mahyari, AA", "Francia, G", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10774059/",
    "rumusan_masalah": "Bagaimana menerapkan pendekatan few-shot learning dan LLM untuk mengenali paket berbahaya dengan jumlah data pelatihan terbatas?",
    "penelitian_terkini": "Studi ini membandingkan kinerja LLM dengan pendekatan deep learning lainnya dalam mengenali serangan siber berbasis paket menggunakan campuran data serangan nyata dan simulasi.",
    "hasil_yang_diharapkan": "Mengembangkan pendekatan deteksi malware berbasis few-shot learning yang efektif meskipun dengan data terbatas, serta mengevaluasi efektivitas LLM dalam konteks ini.",
    "tantangan": "Terbatasnya data pelatihan untuk jenis serangan baru, kesulitan dalam generalisasi model terhadap serangan yang belum pernah terlihat, dan evaluasi kinerja LLM di bawah skenario data terbatas.",
    "hasil_akhir": "Pendekatan few-shot learning dengan LLM menunjukkan hasil menjanjikan untuk deteksi paket berbahaya, membuka jalan bagi sistem keamanan yang lebih adaptif dan efisien.",
    "sitasi": 5
  },
  {
    "judul": "Large Language Models powered Malicious Traffic Detection: Architecture, Opportunities and Case Study",
    "publisher": "arxiv.org",
    "author": ["Zhang, X", "Meng, H", "Li, Q", "Tan, Y", "Zhang, L"],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2503.18487",
    "rumusan_masalah": "Bagaimana memanfaatkan Large Language Models (LLM) dalam mendeteksi lalu lintas jaringan berbahaya secara lebih efektif dibandingkan pendekatan tradisional seperti rule-based dan machine learning konvensional?",
    "penelitian_terkini": "Makalah ini menyajikan arsitektur deteksi lalu lintas berbahaya berbasis LLM serta studi kasus penggunaannya, menyoroti kemampuan LLM dalam mempelajari pola komunikasi jaringan.",
    "hasil_yang_diharapkan": "Menghadirkan kerangka kerja berbasis LLM yang mampu mengklasifikasikan lalu lintas berbahaya dengan akurasi tinggi dan kemampuan generalisasi yang kuat terhadap pola serangan baru.",
    "tantangan": "Kompleksitas dan volume lalu lintas jaringan yang tinggi, serta keterbatasan model lama dalam menangkap pola komunikasi modern yang dinamis.",
    "hasil_akhir": "LLM terbukti efektif dalam mendeteksi trafik berbahaya dengan mengidentifikasi pola komunikasi jaringan secara mendalam, melebihi performa metode rule-based dan ML klasik.",
    "sitasi": 0
  },
  {
    "judul": "HuntGPT: Integrating Machine Learning-Based Anomaly Detection and Explainable AI with Large Language Models (LLMs)",
    "publisher": "arxiv.org",
    "author": ["Ali, T", "Kostakos, P"],
    "tahun": 2023,
    "sumber_data": "https://arxiv.org/abs/2309.16021",
    "rumusan_masalah": "Bagaimana mengintegrasikan deteksi anomali berbasis machine learning dan Explainable AI dengan LLM untuk mendeteksi serangan siber secara efisien dan dapat dijelaskan?",
    "penelitian_terkini": "Penelitian ini memperkenalkan HuntGPT, framework yang menggabungkan ML, Explainable AI, dan LLM untuk mendeteksi serangan seperti DoS, spoofing, dan intrusi jaringan, sekaligus menyediakan penjelasan yang mudah dipahami.",
    "hasil_yang_diharapkan": "Terciptanya sistem keamanan siber cerdas berbasis LLM yang tidak hanya mendeteksi ancaman secara akurat, tetapi juga menjelaskan alasan di balik deteksi tersebut kepada pengguna.",
    "tantangan": "Menggabungkan model deteksi tradisional dengan LLM tanpa kehilangan kecepatan dan interpretabilitas; menjaga performa dalam skenario real-time.",
    "hasil_akhir": "HuntGPT berhasil memadukan deteksi anomali dengan kemampuan penjelasan berbasis LLM, dan mendapat perhatian luas dengan 98 sitasi sejak dipublikasikan.",
    "sitasi": 98
  },
  {
    "judul": "A LLM-Based Agent for the Automatic Generation and Generalization of IDS Rules",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Hu, X", "Chen, H", "Bao, H", "Wang, W", "Liu, F", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10944826/",
    "rumusan_masalah": "Bagaimana memanfaatkan LLM untuk secara otomatis membuat dan menggeneralisasi aturan Intrusion Detection System (IDS) agar mampu mengenali pola serangan baru?",
    "penelitian_terkini": "Studi ini mengembangkan agen berbasis LLM yang dapat mempelajari pola serangan siber dan secara otomatis membuat serta menyempurnakan aturan IDS melalui eksperimen iteratif.",
    "hasil_yang_diharapkan": "Sistem IDS yang dapat memperluas cakupan deteksi terhadap serangan siber baru secara otomatis dan efisien, dengan campur tangan manusia yang minimal.",
    "tantangan": "Menjamin akurasi aturan yang dihasilkan secara otomatis serta menghindari over-generalization yang bisa menyebabkan false positive/negative.",
    "hasil_akhir": "Agen berbasis LLM menunjukkan kemampuan menjanjikan dalam menghasilkan dan menggeneralisasi aturan IDS secara dinamis berdasarkan pola serangan yang dipelajari."
  },
  {
    "judul": "Roberta and Albert Model-Based Network Intrusion Detection System",
    "publisher": "taylorfrancis.com",
    "author": ["Gebremedhin, A", "Verma, DK", "Vats, S", "..."],
    "tahun": 2025,
    "sumber_data": "https://www.taylorfrancis.com/chapters/edit/10.1201/9781003635680-27/roberta-albert-model-based-network-intrusion-detection-system-abrham-gebremedhin-deepak-kumar-verma-satvik-vats-sushil-kumar-singh-vaibhav-matalia-hardik-doshi",
    "rumusan_masalah": "Bagaimana memanfaatkan model LLM seperti RoBERTa dan ALBERT untuk meningkatkan efektivitas sistem deteksi intrusi jaringan (NIDS)?",
    "penelitian_terkini": "Penelitian ini mengeksplorasi penerapan model LLM (RoBERTa dan ALBERT) dalam sistem keamanan jaringan, khususnya untuk mendeteksi serangan yang menargetkan institusi.",
    "hasil_yang_diharapkan": "Sistem deteksi intrusi berbasis LLM yang lebih akurat dan responsif dalam mengenali ancaman keamanan jaringan.",
    "tantangan": "Mengintegrasikan model LLM ke dalam sistem IDS secara efisien, serta membandingkan performa antar model dalam konteks data jaringan yang kompleks.",
    "hasil_akhir": "Studi menunjukkan bahwa integrasi model RoBERTa dan ALBERT dapat meningkatkan performa sistem deteksi intrusi dengan tingkat akurasi yang menjanjikan."
  },
  {
    "judul": "Revolutionizing Cyber Threat Detection with Large Language Models: A Privacy-Preserving BERT-Based Lightweight Model for IoT/IIoT Devices",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Ferrag, MA", "Ndhlovu, M", "Tihanyi, N", "Cordeiro, LC", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10423646/",
    "rumusan_masalah": "Bagaimana membangun model deteksi ancaman siber yang efisien, ringan, dan tetap menjaga privasi untuk perangkat IoT dan IIoT?",
    "penelitian_terkini": "Penelitian ini mengusulkan model BERT berbasis LLM yang dirancang khusus untuk perangkat IoT/IIoT dengan fokus pada efisiensi, privasi, dan ketahanan terhadap rangkaian serangan yang panjang.",
    "hasil_yang_diharapkan": "Model ringan berbasis LLM yang mampu mendeteksi serangan siber secara akurat pada perangkat dengan sumber daya terbatas tanpa mengorbankan privasi.",
    "tantangan": "Menangani keterbatasan perangkat IoT/IIoT dalam hal daya komputasi dan memastikan bahwa data pengguna tidak terekspos selama proses deteksi.",
    "hasil_akhir": "Model BERT ringan yang dikembangkan menunjukkan hasil yang sangat baik dalam mendeteksi ancaman siber dan telah dikutip sebanyak 165 kali sejak 2024, mencerminkan dampak signifikan di bidang keamanan IoT."
  },
  {
    "judul": "Large Language Models (LLM) for Estimating the Cost of Cyber-Attacks",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Razavi, H", "Jamali, MR"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10843617/",
    "rumusan_masalah": "Bagaimana cara memperkirakan kerugian biaya yang ditimbulkan oleh serangan siber secara lebih akurat dan efisien?",
    "penelitian_terkini": "Penelitian ini membandingkan efektivitas LLM dengan teknik machine learning lainnya dalam memperkirakan kerugian finansial dari serangan siber, seperti kerugian transaksi dan dampak pada pendapatan.",
    "hasil_yang_diharapkan": "Model LLM yang mampu memberikan estimasi biaya serangan siber yang lebih akurat dibandingkan metode sebelumnya.",
    "tantangan": "Kesulitan dalam kuantifikasi kerugian yang tidak langsung dan kebutuhan akan data historis serangan yang cukup untuk pelatihan model.",
    "hasil_akhir": "LLM menunjukkan keunggulan dibandingkan metode machine learning lainnya dalam memperkirakan dampak biaya serangan siber, dan telah dikutip sebanyak 8 kali sejak 2024."
  },
  {
    "judul": "Generative AI for Vulnerability Detection in 6G Wireless Networks: Advances, Case Study, and Future Directions",
    "publisher": "arxiv.org",
    "author": ["Yang, S", "Zheng, X", "Xu, J", "Li, J", "Song, D", "Chen, Z"],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2506.20488",
    "rumusan_masalah": "Bagaimana memanfaatkan AI generatif, khususnya LLM, untuk mendeteksi kerentanan pada jaringan nirkabel 6G secara efektif dan real-time?",
    "penelitian_terkini": "Penelitian ini mengkaji penggunaan LLM untuk mendeteksi kerentanan kode dan sistem dalam infrastruktur 6G, termasuk modul komunikasi dan chip.",
    "hasil_yang_diharapkan": "Sistem deteksi kerentanan berbasis LLM yang mampu melakukan analisis real-time dan mendukung keamanan jaringan 6G yang kompleks.",
    "tantangan": "Kerumitan arsitektur jaringan 6G, keterbatasan data pelatihan yang relevan, serta kebutuhan akan kemampuan generalisasi LLM dalam berbagai skenario komunikasi.",
    "hasil_akhir": "Studi kasus menunjukkan potensi kuat LLM dalam mendeteksi kerentanan, sekaligus membuka arah riset masa depan untuk integrasi AI dalam sistem 6G."
  },
  {
    "judul": "A survey on large language models for communication, network, and service management: Application insights, challenges, and future directions",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Boateng, GO", "Sami, H", "Alagha, A"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10976701/",
    "rumusan_masalah": "Bagaimana peran dan penerapan Large Language Models (LLM) dalam manajemen komunikasi, jaringan, dan layanan, serta tantangan dan arah masa depan yang menyertainya?",
    "penelitian_terkini": "Studi ini mengulas penerapan LLM untuk berbagai jenis manajemen jaringan dan komunikasi, termasuk kinerja LLM dalam deteksi serangan dan kemampuan pembelajaran kontekstual (in-context learning).",
    "hasil_yang_diharapkan": "Menyediakan panduan komprehensif mengenai manfaat, keterbatasan, dan potensi penggunaan LLM dalam domain jaringan dan layanan komunikasi modern.",
    "tantangan": "Kompleksitas pengelolaan data jaringan, adaptasi LLM pada skenario real-time, serta keterbatasan interpretabilitas dan efisiensi komputasi.",
    "hasil_akhir": "LLM terbukti mampu melampaui model DNN tradisional dalam beberapa skenario manajemen layanan dan komunikasi, bahkan dengan jumlah data yang sangat terbatas."
  },
  {
    "judul": "RF Jamming BERT Intrusion Detection Systems for Vehicular Networks",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Wickramasurendra, N", "Robson, E"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/11014799/",
    "rumusan_masalah": "Bagaimana mendeteksi serangan RF jamming pada jaringan kendaraan dengan menggunakan model BERT berbasis LLM?",
    "penelitian_terkini": "Penelitian ini mengembangkan sistem deteksi intrusi (IDS) yang menggunakan BERT—salah satu arsitektur LLM—untuk mengidentifikasi serangan RF jamming yang dapat mengganggu komunikasi dalam jaringan kendaraan.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan kecepatan deteksi serangan RF jamming dalam lingkungan kendaraan melalui penerapan model LLM yang memahami konteks sinyal dengan lebih baik.",
    "tantangan": "Tingginya kompleksitas lingkungan kendaraan, kecepatan serangan RF, dan kebutuhan untuk respons real-time yang cepat dan akurat.",
    "hasil_akhir": "Model BERT yang digunakan berhasil mengidentifikasi gangguan RF dengan tingkat akurasi yang tinggi, menunjukkan potensi besar LLM dalam keamanan jaringan kendaraan."
  },
  {
    "judul": "IoV-BERT-IDS: Hybrid network intrusion detection system in IoV using large language models",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Fu, M", "Wang, P", "Liu, M", "Zhang, Z"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10533857/",
    "rumusan_masalah": "Bagaimana membangun sistem deteksi intrusi yang efektif untuk Internet of Vehicles (IoV), khususnya dalam menghadapi kerentanan ECU dan komunikasi CAN yang tidak terenkripsi?",
    "penelitian_terkini": "Studi ini memperkenalkan IoV-BERT-IDS, sebuah sistem deteksi intrusi hybrid berbasis LLM (khususnya model BERT) untuk mendeteksi ancaman dalam ekosistem kendaraan terhubung.",
    "hasil_yang_diharapkan": "Menghasilkan IDS yang mampu mengenali serangan terhadap IoV dengan akurasi tinggi menggunakan kekuatan pemahaman konteks dari LLM.",
    "tantangan": "Tantangan utama termasuk kerentanan ECU, komunikasi CAN yang tidak terenkripsi, dan kebutuhan akan analisis data real-time yang efisien.",
    "hasil_akhir": "Model LLM-BERT yang digunakan mampu mendeteksi intrusi dengan efektivitas tinggi, dan telah dikutip sebanyak 32 kali sejak 2024, menunjukkan pengaruhnya dalam bidang ini."
  },
  {
    "judul": "Harnessing LLMs for IoT malware detection: A comparative analysis of BERT and GPT-2",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Omar, M", "Zangana, HM", "Al-Karaki, JN"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10757249/",
    "rumusan_masalah": "Bagaimana efektivitas model LLM seperti BERT dan GPT-2 dalam mendeteksi malware pada perangkat IoT?",
    "penelitian_terkini": "Penelitian ini membandingkan dua model LLM terkemuka, BERT dan GPT-2, dalam konteks deteksi malware IoT, dengan mengintegrasikan metode Machine Learning (ML) dan Deep Learning (DL).",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi malware di lingkungan IoT dengan memanfaatkan kekuatan pemahaman konteks dari model LLM.",
    "tantangan": "Tantangan utama termasuk keterbatasan komputasi pada perangkat IoT dan kebutuhan model yang efisien namun tetap akurat.",
    "hasil_akhir": "Pendekatan LLM yang digunakan terbukti meningkatkan akurasi deteksi secara signifikan, dan penelitian ini telah dikutip 5 kali sejak 2024."
  },
  {
    "judul": "The Dual Role of Large Language Models in Network Security: Survey and Research Trends",
    "publisher": "dl.acm.org",
    "author": ["Liu, H", "Xue, J", "Zhao, S", "Liu, Y", "Lu, Z"],
    "tahun": 2025,
    "sumber_data": "https://dl.acm.org/doi/abs/10.1145/3733965.3733972",
    "rumusan_masalah": "Apa peran ganda dari LLM dalam konteks keamanan jaringan dan apa tren riset terkini terkait penggunaannya?",
    "penelitian_terkini": "Studi ini menyurvei peran LLM dalam keamanan jaringan, termasuk sebagai alat pertahanan (detection/mitigation) dan juga sebagai target yang rentan terhadap serangan (misuse/attack surface).",
    "hasil_yang_diharapkan": "Memberikan pemahaman menyeluruh tentang kontribusi dan risiko penggunaan LLM dalam keamanan jaringan serta arah penelitian yang sedang berkembang.",
    "tantangan": "Risiko side-channel attack pada komunikasi nirkabel yang menggunakan LLM, serta potensi eksploitasi model oleh aktor jahat.",
    "hasil_akhir": "Makalah ini mengidentifikasi strategi pertahanan dan kerentanan dari LLM dalam sistem keamanan jaringan serta memberikan arah riset lanjutan untuk menjawab risiko-risiko tersebut."
  },
  {
    "judul": "Generative AI and Large Language Models for Cyber Security: All Insights You Need",
    "publisher": "papers.ssrn.com",
    "author": ["Ferrag, MA", "Alwahedi, F", "Battah, A", "Cherif, B", "..."],
    "tahun": 2024,
    "sumber_data": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4853709",
    "rumusan_masalah": "Bagaimana peran dan kontribusi Generative AI dan LLM dalam bidang keamanan siber, termasuk potensi risiko dan pencegahannya?",
    "penelitian_terkini": "Makalah ini memberikan eksplorasi komprehensif tentang penggunaan LLM dalam berbagai aspek keamanan siber, termasuk skenario serangan, sistem deteksi intrusi berbasis deep learning, dan pencegahan ancaman.",
    "hasil_yang_diharapkan": "Menjadi referensi utama dalam memahami bagaimana LLM dan generative AI dapat digunakan secara efektif dalam sistem keamanan siber.",
    "tantangan": "Meningkatnya kompleksitas serangan terhadap sistem LLM serta perlunya strategi mitigasi yang adaptif terhadap ancaman yang terus berkembang.",
    "hasil_akhir": "Makalah ini menyajikan wawasan mendalam dan komprehensif mengenai aplikasi LLM untuk mendeteksi dan mencegah serangan siber serta menunjukkan efektivitas pendekatan berbasis deep learning dalam mendukung keamanan sistem."
  },
  {
    "judul": "Forewarned is Forearmed: A Survey on Large Language Model-Based Agents in Autonomous Cyberattacks",
    "publisher": "arxiv.org",
    "author": [
      "Xu, M",
      "Fan, J",
      "Huang, X",
      "Zhou, C",
      "Kang, J",
      "Niyato, D",
      "..."
    ],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2505.12786",
    "rumusan_masalah": "Apa potensi ancaman siber yang dapat ditimbulkan oleh agen berbasis Large Language Model (LLM), dan bagaimana cara mengantisipasinya?",
    "penelitian_terkini": "Studi ini menyoroti penggunaan LLM dalam merancang dan melaksanakan serangan siber otonom, serta menganalisis ancaman yang timbul dari agen-agen cerdas tersebut.",
    "hasil_yang_diharapkan": "Memberikan pemahaman yang komprehensif mengenai bagaimana agen LLM dapat digunakan dalam serangan siber dan bagaimana sistem keamanan dapat dipersiapkan untuk menghadapinya.",
    "tantangan": "Mengantisipasi skenario serangan otonom berbasis LLM yang kompleks dan sulit diprediksi, serta keterbatasan alat pertahanan konvensional.",
    "hasil_akhir": "Makalah ini menawarkan survei mendalam tentang kerangka kerja, skenario, dan implikasi keamanan dari LLM-agent dalam serangan siber, serta pendekatan pencegahan berbasis teori permainan, adversarial learning, dan sistem multi-agen."
  },
  {
    "judul": "Challenges and Potential Research Directions for Machine Learning-Based Cyber-Attack Detection in IoT Networks",
    "publisher": "Elsevier",
    "author": ["Hieu, NQ", "Manh, BD", "Hoang, DT", "Nguyen, DN", "..."],
    "tahun": 2025,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/B978044329032900018X",
    "rumusan_masalah": "Apa saja tantangan utama dalam mendeteksi serangan siber pada jaringan IoT menggunakan pendekatan machine learning?",
    "penelitian_terkini": "Makalah ini membahas tantangan kompleks yang dihadapi dalam menerapkan ML untuk mendeteksi serangan pada jaringan IoT, seperti variasi teknologi komunikasi, keterbatasan perangkat, dan keterbatasan data.",
    "hasil_yang_diharapkan": "Mengidentifikasi celah riset dan merancang arah penelitian masa depan untuk meningkatkan sistem deteksi serangan siber berbasis ML di lingkungan IoT.",
    "tantangan": "Heterogenitas perangkat dan protokol komunikasi IoT, keterbatasan daya dan komputasi, serta keberagaman jenis serangan siber.",
    "hasil_akhir": "Penulis memberikan wawasan menyeluruh tentang tantangan mendasar dalam deteksi serangan berbasis ML pada jaringan IoT dan mengusulkan beberapa arah penelitian untuk mengatasinya di masa depan."
  },
  {
    "judul": "A Review of Advancements and Applications of Pre-Trained Language Models in Cybersecurity",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Liu, Z"],
    "tahun": 2024,
    "sumber_data": [
      "https://ieeexplore.ieee.org/abstract/document/10527236/",
      "https://www.researchgate.net/profile/Zefang-Liu-2/publication/380626363_A_Review_of_Advancements_and_Applications_of_Pre-Trained_Language_Models_in_Cybersecurity/links/672f057777f274616d644680/A-Review-of-Advancements-and-Applications-of-Pre-Trained-Language-Models-in-Cybersecurity.pdf"
    ],
    "rumusan_masalah": "Bagaimana kemajuan dan aplikasi model bahasa pra-latih dalam mendukung keamanan siber dibandingkan dengan pendekatan machine learning dan deep learning tradisional?",
    "penelitian_terkini": "Penelitian membandingkan performa manusia dan model bahasa besar (LLM) dalam berbagai tugas keamanan siber serta menilai keunggulan model pra-latih dibandingkan teknik tradisional.",
    "hasil_yang_diharapkan": "Menyajikan gambaran komprehensif mengenai aplikasi model pra-latih dalam cybersecurity serta mengidentifikasi keunggulan dan batasannya.",
    "tantangan": "Menghadapi komunikasi penipuan, keterbatasan model tradisional, dan kebutuhan akan model yang lebih adaptif dalam deteksi ancaman siber.",
    "hasil_akhir": "Model pra-latih menunjukkan potensi signifikan untuk meningkatkan efektivitas deteksi dan respons keamanan siber, melebihi metode machine learning dan deep learning tradisional."
  },
  {
    "judul": "Deep Learning-based Intrusion Detection Systems: A Survey",
    "publisher": "arxiv.org",
    "author": ["Xu, Z", "Wu, Y", "Wang, S", "Gao, J", "Qiu, T", "Wang, Z"],
    "tahun": 2025,
    "sumber_data": [
      "https://arxiv.org/abs/2504.07839",
      "https://arxiv.org/pdf/2504.07839"
    ],
    "rumusan_masalah": "Bagaimana metode deteksi intrusi berbasis deep learning dapat mengidentifikasi serangan dalam komunikasi jaringan dengan efektif di berbagai lingkungan, termasuk aplikasi dunia nyata dan pengaturan offline?",
    "penelitian_terkini": "Survey ini membahas teknik deep learning terbaru yang digunakan dalam sistem deteksi intrusi, serta penerapan dan tantangan dalam lingkungan nyata dan integrasi dengan model bahasa besar (LLM).",
    "hasil_yang_diharapkan": "Memberikan wawasan komprehensif mengenai kemampuan deep learning dalam mendeteksi serangan siber, dan bagaimana teknologi ini dapat diintegrasikan ke dalam sistem keamanan yang lebih luas.",
    "tantangan": "Kesulitan dalam mendeteksi serangan yang sangat kompleks dan variatif, serta kebutuhan akan data pelatihan berkualitas tinggi dan solusi efisien untuk penerapan real-time.",
    "hasil_akhir": "Metode deep learning menunjukkan potensi besar dalam meningkatkan akurasi dan efisiensi deteksi intrusi, dengan peluang integrasi ke dalam aplikasi dunia nyata dan penggunaan bersama dengan LLM."
  },
  {
    "judul": "Research on cloud platform network traffic monitoring and anomaly detection system based on large language models",
    "publisher": "arxiv.org",
    "author": ["Yang, Z", "Jin, Y", "Liu, J", "Xu, X", "Zhang, Y", "Ji, S"],
    "tahun": 2025,
    "sumber_data": [
      "https://arxiv.org/abs/2504.17807",
      "https://arxiv.org/pdf/2504.17807"
    ],
    "rumusan_masalah": "Bagaimana penerapan large language models (LLM) dapat meningkatkan sistem pemantauan trafik jaringan dan deteksi anomali pada platform cloud yang memiliki data besar dan komunikasi yang kompleks?",
    "penelitian_terkini": "Menggunakan pendekatan berbasis LLM serta teknik machine learning dan deep learning terbaru yang efisien untuk memantau dan mendeteksi anomali pada trafik jaringan cloud, termasuk integrasi federated learning untuk komunikasi efisien antar data center.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan efisiensi dalam mendeteksi anomali trafik jaringan pada platform cloud dengan memanfaatkan kemampuan LLM serta teknologi federated learning yang hemat komunikasi.",
    "tantangan": "Menangani volume data yang besar dan beragam dari data center cloud, serta memastikan komunikasi efisien dan privasi data dalam sistem federated learning.",
    "hasil_akhir": "Sistem yang dikembangkan menunjukkan efektivitas dalam monitoring trafik dan deteksi anomali menggunakan LLM, membuka peluang penerapan lebih luas di lingkungan cloud skala besar."
  },
  {
    "judul": "Network Security through Dual-Layer Log Analysis: Integrating Machine Learning Classifiers with Large Language Models for Intelligent Anomaly Detection",
    "publisher": "scholar.smu.edu",
    "author": ["Burton-Cordova, A", "Gray, ON"],
    "tahun": 2024,
    "sumber_data": [
      "https://scholar.smu.edu/datasciencereview/vol8/iss3/1/",
      "https://scholar.smu.edu/cgi/viewcontent.cgi?article=1290&context=datasciencereview"
    ],
    "rumusan_masalah": "Bagaimana mengintegrasikan machine learning dan large language models (LLM) untuk meningkatkan deteksi anomali pada data log keamanan jaringan?",
    "penelitian_terkini": "Pendekatan dual-layer menggunakan machine learning untuk preprocessing dan ekstraksi fitur pada data log, kemudian menerapkan LLM yang telah di-fine-tune untuk mendeteksi berbagai jenis serangan secara akurat.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan deteksi anomali yang lebih cerdas dan akurat dengan menggabungkan kekuatan ML dan LLM dalam analisis log jaringan.",
    "tantangan": "Mengelola kompleksitas data log besar dan memastikan integrasi efektif antara teknik ML dan LLM untuk hasil deteksi yang optimal.",
    "hasil_akhir": "Model gabungan berhasil meningkatkan akurasi deteksi berbagai serangan melalui analisis log jaringan secara cerdas dan efisien."
  },
  {
    "judul": "MAD-LLM: A Novel Approach for Alert-Based Multi-stage Attack Detection via LLM",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Du, D", "Guan, X", "Liu, Y", "Jiang, B", "Liu, S"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10885363/",
    "rumusan_masalah": "Bagaimana mengembangkan metode deteksi serangan multi-tahap berbasis alert menggunakan Large Language Models (LLM) untuk meningkatkan akurasi dan efektivitas deteksi?",
    "penelitian_terkini": "Metode ICS-CAD yang menggunakan deep learning dan causal decomposition, serta detektor serangan multi-step berbasis attack graphs telah diterapkan sebelumnya sebagai pendekatan deteksi serangan secara bertahap.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan deteksi serangan multi-tahap secara real-time dengan menggunakan LLM untuk analisis alert yang lebih cerdas dan kontekstual.",
    "tantangan": "Mengelola kompleksitas serangan multi-tahap dan memastikan sistem dapat mendeteksi serangan dengan sedikit false positive dan latency rendah.",
    "hasil_akhir": "Pendekatan MAD-LLM berhasil memberikan deteksi serangan multi-tahap yang lebih akurat dan responsif dibandingkan metode tradisional."
  },
  {
    "judul": "Exploring the emerging role of large language models in smart grid cybersecurity: a survey of attacks, detection mechanisms, and mitigation strategies",
    "publisher": "frontiersin.org",
    "author": ["Ibrahim, N", "Kashef, R"],
    "tahun": 2025,
    "sumber_data": [
      "https://www.frontiersin.org/journals/energy-research/articles/10.3389/fenrg.2025.1531655/full",
      "https://www.frontiersin.org/journals/energy-research/articles/10.3389/fenrg.2025.1531655/pdf"
    ],
    "rumusan_masalah": "Mengkaji peran LLM dalam keamanan siber jaringan smart grid, termasuk serangan yang mungkin terjadi, mekanisme deteksi, dan strategi mitigasi.",
    "penelitian_terkini": "Studi terkait AI, machine learning, dan deep learning dalam deteksi serangan, serta isu terkait poisoning yang muncul dari penggunaan LLM.",
    "hasil_yang_diharapkan": "Mengembangkan metode yang efektif untuk mendeteksi dan mencegah serangan siber di smart grid dengan memanfaatkan kemampuan LLM.",
    "tantangan": "Mengatasi berbagai permukaan serangan, lapisan komunikasi jaringan, dan risiko terkait poisoning pada model LLM.",
    "hasil_akhir": "Survey ini memberikan wawasan komprehensif mengenai potensi dan tantangan penggunaan LLM dalam keamanan siber smart grid."
  },
  {
    "judul": "Investigating Cybersecurity Incidents Using Large Language Models in Latest-Generation Wireless Networks",
    "publisher": "arxiv.org",
    "author": ["Legashev, L", "Zhigalov, A"],
    "tahun": 2025,
    "sumber_data": [
      "https://arxiv.org/abs/2504.13196",
      "https://arxiv.org/pdf/2504.13196"
    ],
    "rumusan_masalah": "Bagaimana memanfaatkan Large Language Models (LLM) untuk menyelidiki insiden keamanan siber pada jaringan nirkabel generasi terbaru?",
    "penelitian_terkini": "Studi ini mengembangkan kerangka kerja berbasis LLM untuk menganalisis dan menyelidiki serangan, termasuk serangan adversarial terhadap model machine learning, dalam sistem komunikasi nirkabel modern.",
    "hasil_yang_diharapkan": "Menghasilkan metode investigasi yang lebih efektif dan kontekstual berbasis LLM untuk menanggapi insiden keamanan di jaringan nirkabel terkini.",
    "tantangan": "Menghadapi kompleksitas serangan adversarial terhadap model ML dan memastikan LLM dapat menangani konteks komunikasi nirkabel modern secara akurat.",
    "hasil_akhir": "Framework berbasis LLM ini terbukti menjanjikan dalam investigasi insiden keamanan jaringan nirkabel generasi terbaru, meski masih perlu pengujian dan validasi lebih lanjut.",
    "sitasi": 1
  },
  {
    "judul": "Generative AI for Cybersecurity: LLM‑Driven Attack Dataset Augmentation in Web API Detection",
    "publisher": "IEEE (2025 1st International Conference on Consumer Technology)",
    "author": [
      "Pawana, IWAJ",
      "Purnama, F",
      "Kim, YJ",
      "Linawati, L",
      "You, I"
    ],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/11012893/",
    "rumusan_masalah": "Bagaimana mengatasi kekurangan dataset serangan API web dengan menggunakan LLM untuk augmentasi data serangan agar sistem deteksi API menjadi lebih efektif?",
    "penelitian_terkini": "Penelitian ini memperkenalkan metode augmentasi dataset serangan berbasis LLM untuk memperkaya data pelatihan pada deteksi API web, sehingga meningkatkan kemampuan sistem dalam mengenali kerentanan baru :contentReference[oaicite:0]{index=0}.",
    "hasil_yang_diharapkan": "Menghasilkan dataset serangan yang lebih representatif dan beragam, yang dapat meningkatkan akurasi dan ketahanan sistem deteksi intrusi API web.",
    "tantangan": "Menghasilkan data sintetik yang realistis dan beragam tanpa memperkenalkan bias atau noise, serta memastikan kompatibilitas data augmentasi dengan model deteksi.",
    "hasil_akhir": "Prototipe menunjukkan bahwa augmentasi dataset berbasis LLM mampu meningkatkan efektivitas sistem deteksi API web, meskipun belum tersedia metrik sitasi publik:contentReference[oaicite:1]{index=1}.",
    "sitasi": 0
  },
  {
    "judul": "AttackLLM: LLM-based Attack Pattern Generation for an Industrial Control System",
    "publisher": "ACM (Proceedings of the 2nd International Workshop on Cyber-Physical Systems Security)",
    "author": ["Ahmed, CM"],
    "tahun": 2025,
    "sumber_data": "https://dl.acm.org/doi/abs/10.1145/3722565.3727196",
    "rumusan_masalah": "Bagaimana menghasilkan pola serangan yang realistis dan representatif terhadap sistem kontrol industri (ICS) untuk menguji dan memperkuat model pembelajaran mesin dalam keamanan siber?",
    "penelitian_terkini": "Penelitian ini memperkenalkan AttackLLM, yang memanfaatkan Large Language Model untuk menghasilkan pola serangan terhadap ICS, yang dapat digunakan untuk evaluasi dan pelatihan sistem deteksi serangan siber berbasis ML.",
    "hasil_yang_diharapkan": "Menghasilkan pola serangan yang kompleks dan bervariasi untuk memperkaya data pengujian dan meningkatkan efektivitas sistem deteksi ancaman ICS.",
    "tantangan": "Menjaga relevansi dan akurasi pola serangan yang dihasilkan LLM agar mencerminkan skenario nyata di lingkungan ICS, serta menghindari overfitting atau data yang terlalu artifisial.",
    "hasil_akhir": "AttackLLM berhasil menghasilkan serangkaian pola serangan yang digunakan untuk mengevaluasi performa sistem deteksi berbasis ML dalam ICS. Studi ini mendapatkan 1 sitasi sejak tahun 2025.",
    "sitasi": 1
  },
  {
    "judul": "An anomaly detection model training method based on LLM knowledge distillation",
    "publisher": "IEEE (2024 International Conference)",
    "author": ["Yang, Y", "Tian, B", "Yu, F", "He, Y"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10679858/",
    "rumusan_masalah": "Bagaimana memanfaatkan pengetahuan dari Large Language Model (LLM) untuk meningkatkan pelatihan model deteksi anomali, khususnya dalam sistem deteksi intrusi jaringan?",
    "penelitian_terkini": "Penelitian ini memperkenalkan metode distilasi pengetahuan berbasis LLM untuk melatih model deteksi anomali, dengan fokus pada payload berbasis teks dan penggunaan CNN.",
    "hasil_yang_diharapkan": "Model deteksi anomali yang lebih akurat dan efisien melalui pemanfaatan pengetahuan dari LLM, serta lebih efektif dalam mengklasifikasikan jenis-jenis serangan dari data payload.",
    "tantangan": "Mentransfer pengetahuan dari LLM ke model ringan tanpa kehilangan akurasi atau kompleksitas informasi, serta menghindari kesalahan klasifikasi terhadap data jaringan yang kompleks.",
    "hasil_akhir": "Metode distilasi LLM terbukti meningkatkan performa deteksi serangan berbasis payload teks dengan CNN. Makalah ini telah mendapatkan 8 sitasi sejak dipublikasikan pada 2024.",
    "sitasi": 8
  },
  {
    "judul": "Intelligent Cyber Defense: Leveraging LLMs for Real-Time Threat Detection and Analysis",
    "publisher": "Springer (European, Mediterranean, and Middle Eastern Conference)",
    "author": ["Kakoulli, E", "Zacharioudakis, E", "Evripidou, S"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/chapter/10.1007/978-3-031-81322-1_5",
    "rumusan_masalah": "Bagaimana memanfaatkan kemampuan Large Language Models (LLMs) untuk mendeteksi dan menganalisis ancaman siber secara real-time dalam sistem pertahanan cerdas?",
    "penelitian_terkini": "Penelitian ini mengeksplorasi penggunaan LLM dalam pertahanan siber cerdas, khususnya dalam deteksi komunikasi tersembunyi dan analisis ancaman jaringan secara dinamis.",
    "hasil_yang_diharapkan": "Pengembangan sistem pertahanan siber berbasis LLM yang mampu merespons secara cepat dan akurat terhadap ancaman siber yang kompleks dan tersembunyi.",
    "tantangan": "Mengelola dampak pemrosesan real-time dari LLM, serta menyaring false positive pada sistem deteksi ancaman di lingkungan jaringan nirkabel.",
    "hasil_akhir": "LLM dinilai efektif dalam mendeteksi dan menganalisis ancaman real-time serta berpotensi besar untuk diterapkan dalam pertahanan jaringan tingkat lanjut."
  },
  {
    "judul": "Lightweight LLM-Based Anomaly Detection Framework for Securing IoTMD Enabled Diabetes Management Control Systems",
    "publisher": "IEEE Journal of Biomedical and Health Informatics",
    "author": ["Pawana, IWAJ", "Astillo, PV", "You, I"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/11027716/",
    "rumusan_masalah": "Bagaimana mengembangkan kerangka deteksi anomali berbasis LLM yang ringan untuk meningkatkan keamanan sistem kontrol manajemen diabetes berbasis IoTMD?",
    "penelitian_terkini": "Penelitian ini membandingkan efektivitas pendekatan LLM ringan terhadap metode deep learning tradisional dalam mendeteksi serangan terhadap sistem IoT medis untuk pengelolaan diabetes.",
    "hasil_yang_diharapkan": "Kerangka deteksi anomali berbasis LLM yang efisien, ringan, dan dapat diandalkan untuk mendeteksi serangan terhadap sistem kontrol medis nirkabel secara real-time.",
    "tantangan": "Menghadapi kerentanan sistem IoT medis terhadap serangan siber karena komunikasi nirkabel, serta menyeimbangkan antara akurasi deteksi dan efisiensi komputasi.",
    "hasil_akhir": "Pendekatan LLM ringan menunjukkan kinerja lebih baik dibandingkan model deep learning tradisional dalam hal akurasi deteksi dan efisiensi pada perangkat dengan sumber daya terbatas."
  },
  {
    "judul": "Labeling NIDS Rules with MITRE ATT&CK Techniques: Machine Learning vs. Large Language Models",
    "publisher": "arXiv preprint",
    "author": ["Daniel, N", "Kaiser, FK", "Giladi, S", "Sharabi, S", "..."],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2412.10978",
    "rumusan_masalah": "Bagaimana efektivitas Large Language Models (LLM) dibandingkan dengan metode machine learning tradisional dalam memberi label teknik serangan MITRE ATT&CK pada aturan NIDS?",
    "penelitian_terkini": "Studi ini mengembangkan pipeline otomatis menggunakan LLM untuk memberi label aturan Network Intrusion Detection System (NIDS) berdasarkan teknik ATT&CK, dan membandingkan performanya dengan pendekatan machine learning berbasis text mining.",
    "hasil_yang_diharapkan": "Pipeline pelabelan otomatis berbasis LLM yang akurat dan efisien dalam mengklasifikasikan aturan NIDS sesuai teknik serangan MITRE ATT&CK.",
    "tantangan": "Mencocokkan aturan NIDS berbasis teks ke dalam taksonomi serangan MITRE secara tepat, serta membandingkan kemampuan reasoning dan presisi antara LLM dan metode tradisional.",
    "hasil_akhir": "LLM mampu menjalankan seluruh pipeline labeling secara otonom dan menunjukkan kinerja kompetitif atau unggul dibanding machine learning dalam konteks pemetaan aturan ke teknik ATT&CK."
  },
  {
    "judul": "Automated IoT Fingerprinting with LLMs: Harnessing Explainable AI and Artificial Bee Colony Optimization",
    "publisher": "IEEE Security and Privacy",
    "author": ["Shrestha, Y", "Ansari, K", "Aksoy, A"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/11050828/",
    "rumusan_masalah": "Bagaimana cara otomatis mengidentifikasi perangkat IoT melalui fingerprinting menggunakan LLM dan metode optimasi seperti Artificial Bee Colony, serta bagaimana interpretabilitas model dapat ditingkatkan?",
    "penelitian_terkini": "Penelitian ini mengevaluasi kemampuan Large Language Models (LLM) dalam mengklasifikasikan paket data jaringan IoT untuk keperluan fingerprinting, dan membandingkannya dengan pendekatan deep learning konvensional sambil mengintegrasikan explainable AI dan algoritma Artificial Bee Colony Optimization.",
    "hasil_yang_diharapkan": "Pengembangan sistem fingerprinting IoT otomatis yang akurat, dapat dijelaskan (explainable), dan dioptimasi, dengan performa lebih baik atau sebanding dengan deep learning.",
    "tantangan": "Menyeimbangkan akurasi klasifikasi dengan transparansi keputusan model dan efisiensi optimasi dalam lingkungan IoT yang sangat dinamis.",
    "hasil_akhir": "LLM menunjukkan performa yang kompetitif terhadap metode deep learning dalam klasifikasi paket IoT, dan pendekatan explainable AI serta optimasi lebah buatan meningkatkan efektivitas serta keandalan sistem."
  },
  {
    "judul": "Payload-Aware Intrusion Detection with CMAE and Large Language Models",
    "publisher": "arXiv preprint arXiv:2503.20798",
    "author": ["Kim, Y", "Lee, C", "Yoon, Y"],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2503.20798",
    "rumusan_masalah": "Bagaimana meningkatkan efektivitas sistem deteksi intrusi jaringan (NIDS) dengan memanfaatkan pemahaman payload menggunakan kombinasi LLM dan Contrastive Multiscale Autoencoder (CMAE)?",
    "penelitian_terkini": "Penelitian ini memperkenalkan model LLMCMAE yang menggabungkan kekuatan Large Language Models (LLM) dan Contrastive Multiscale Autoencoder (CMAE) untuk meningkatkan deteksi intrusi berbasis payload dalam sistem keamanan siber.",
    "hasil_yang_diharapkan": "Sistem NIDS yang mampu mengenali pola serangan secara lebih akurat dan kontekstual melalui pemahaman payload yang lebih dalam menggunakan LLM dan CMAE.",
    "tantangan": "Mengintegrasikan pemrosesan bahasa alami dari LLM dengan pembelajaran representasi dari CMAE untuk mendeteksi intrusi yang kompleks dalam data jaringan.",
    "hasil_akhir": "Model LLMCMAE berhasil menunjukkan peningkatan performa dalam mendeteksi payload berbahaya dibanding metode deep neural network konvensional dalam sistem deteksi intrusi jaringan."
  },
  {
    "judul": "ChatGPT and Other Large Language Models for Cybersecurity of Smart Grid Applications",
    "publisher": "2024 IEEE Power & Energy",
    "author": ["Zaboli, A", "Choi, SL", "Song, TJ"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10688863/",
    "rumusan_masalah": "Bagaimana pemanfaatan ChatGPT dan LLM lainnya dapat meningkatkan keamanan siber dalam aplikasi smart grid?",
    "penelitian_terkini": "Penelitian ini mengembangkan sistem deteksi intrusi (IDS) berbasis deep learning yang memanfaatkan proses Human-in-the-Loop (HITL) dan Large Language Models untuk mendeteksi anomali dalam pesan komunikasi smart grid.",
    "hasil_yang_diharapkan": "Integrasi LLM (seperti ChatGPT) dalam sistem IDS yang mampu secara efisien mendeteksi dan menganalisis ancaman siber pada infrastruktur smart grid.",
    "tantangan": "Menyesuaikan LLM yang umumnya berbasis teks dengan data komunikasi spesifik smart grid serta memastikan efektivitas proses HITL dalam deteksi anomali real-time.",
    "hasil_akhir": "Sistem IDS berbasis LLM-HITL menunjukkan peningkatan kemampuan dalam mendeteksi anomali komunikasi pada aplikasi smart grid, serta telah dikutip sebanyak 30 kali sejak 2024."
  },
  {
    "judul": "Empowering Cybersecurity with LLMs: Overcoming Automation Challenges in Threat Intelligence and Detection Systems",
    "publisher": "IGI Global",
    "author": ["Renugadevi, R", "Muthumeenakshi, R"],
    "tahun": 2025,
    "sumber_data": "https://www.igi-global.com/chapter/empowering-cybersecurity-with-llms/374471",
    "rumusan_masalah": "Bagaimana mengatasi tantangan otomatisasi dalam sistem deteksi ancaman siber dengan memanfaatkan Large Language Models (LLM)?",
    "penelitian_terkini": "Penelitian ini membahas penerapan LLM untuk mendeteksi malware dan anomali keamanan dengan memanfaatkan kombinasi AI, machine learning, dan komunikasi generasi berikutnya.",
    "hasil_yang_diharapkan": "Sistem deteksi berbasis LLM yang mampu secara otomatis mengenali pola tidak wajar yang mengindikasikan potensi serangan siber.",
    "tantangan": "Mengintegrasikan LLM dengan sistem keamanan yang ada dan mengatasi kompleksitas dalam otomatisasi proses deteksi ancaman.",
    "hasil_akhir": "Model berbasis LLM menunjukkan potensi signifikan dalam memperkuat sistem intelijen ancaman dengan deteksi yang lebih adaptif dan otomatis terhadap pola anomali."
  },
  {
    "judul": "Cyber Attack Prediction: From Traditional Machine Learning to Generative Artificial Intelligence",
    "publisher": "IEEE",
    "author": ["Ankalaki, S", "Rajesh, AA", "Pallavi, M", "Hukkeri, GS"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10909100/",
    "rumusan_masalah": "Bagaimana peralihan dari machine learning tradisional ke AI generatif, khususnya LLM, dapat meningkatkan efektivitas prediksi dan deteksi serangan siber?",
    "penelitian_terkini": "Penelitian ini mengkaji pendekatan terbaru dalam mendeteksi serangan siber, termasuk honeypots, simulasi serangan, dan pembuatan kode keamanan berbasis LLM.",
    "hasil_yang_diharapkan": "Sistem prediksi dan deteksi serangan siber yang lebih adaptif dan proaktif dengan menggunakan LLM dan AI generatif.",
    "tantangan": "Kompleksitas integrasi sistem, kebutuhan akan data simulasi yang realistis, serta efisiensi model dalam mendeteksi berbagai skenario serangan.",
    "hasil_akhir": "LLM dan AI generatif memberikan pendekatan yang lebih fleksibel dan kuat dalam memprediksi serta menangani serangan siber dibanding pendekatan tradisional."
  },
  {
    "judul": "Generative AI in Intrusion Detection Systems for Internet of Things: A Systematic Literature Review",
    "publisher": "IEEE",
    "author": ["Deng, Z", "Torim, A", "Yahia, SB"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/11012727/",
    "rumusan_masalah": "Bagaimana pemanfaatan Generative AI, termasuk LLM dan GAN, dapat mengatasi keterbatasan data serangan dalam sistem deteksi intrusi pada lingkungan IoT?",
    "penelitian_terkini": "Studi ini mengulas literatur terkait penggunaan model generatif, seperti GAN dan LLM, untuk menghasilkan data pelatihan dan meningkatkan efektivitas sistem deteksi intrusi berbasis IoT.",
    "hasil_yang_diharapkan": "Kemampuan sistem IDS IoT untuk tetap efektif meskipun data serangan terbatas, melalui penggunaan data sintetik yang realistis dari model generatif.",
    "tantangan": "Kualitas dan keaslian data sintetik, keterbatasan model dalam memahami konteks IoT, serta risiko overfitting terhadap data buatan.",
    "hasil_akhir": "GenAI, termasuk LLM dan GAN, berpotensi besar dalam meningkatkan performa IDS di lingkungan IoT, terutama dalam kondisi data serangan yang terbatas."
  },
  {
    "judul": "Generative AI-in-the-Loop: Integrating LLMs and GPTs into the Next Generation Networks",
    "publisher": "arXiv.org",
    "author": ["Zhang, H", "Sediq, AB", "Afana, A"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2406.04276",
    "rumusan_masalah": "Bagaimana mengintegrasikan model generatif seperti LLM dan GPT ke dalam arsitektur jaringan komunikasi generasi berikutnya untuk menangani skenario yang tidak terduga?",
    "penelitian_terkini": "Studi ini mengeksplorasi penerapan LLM dalam mendukung keputusan real-time, manajemen trafik, serta otomatisasi proses dalam jaringan mobile dan komunikasi masa depan.",
    "hasil_yang_diharapkan": "Integrasi LLM dapat memberikan fleksibilitas, adaptivitas, dan responsivitas tinggi dalam pengelolaan jaringan cerdas dan situasi tak terduga.",
    "tantangan": "Kompleksitas implementasi di infrastruktur jaringan nyata, latency dalam inferensi LLM, serta aspek keamanan dan privasi data jaringan.",
    "hasil_akhir": "Model generatif seperti GPT berpotensi menjadi bagian tak terpisahkan dari jaringan komunikasi masa depan yang bersifat adaptif dan berbasis kecerdasan buatan."
  },
  {
    "judul": "A Survey on Intelligent Network Operations and Performance Optimization Based on Large Language Models",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Long, S", "Tan, J", "Mao, B", "Tang, F", "Li, Y"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10829820/",
    "rumusan_masalah": "Bagaimana model LLM dapat diintegrasikan untuk meningkatkan operasi jaringan dan optimasi performa, serta memberikan keamanan cerdas terhadap ancaman siber?",
    "penelitian_terkini": "Survei ini mengkaji perbedaan arsitektur LLM dengan deep learning lainnya, serta bagaimana LLM digunakan dalam pengawasan jaringan, deteksi ancaman, dan optimalisasi performa.",
    "hasil_yang_diharapkan": "Penerapan LLM akan meningkatkan efisiensi operasional jaringan secara real-time dan mempercepat deteksi serta mitigasi serangan.",
    "tantangan": "Kesulitan dalam adaptasi arsitektur LLM terhadap sistem jaringan real-time, kebutuhan daya komputasi besar, dan integrasi yang aman serta stabil.",
    "hasil_akhir": "LLM berperan sebagai fondasi sistem keamanan dan manajemen jaringan cerdas yang adaptif dalam menghadapi anomali dan serangan siber modern."
  },
  {
    "judul": "Transfer Learning in Pre-Trained Large Language Models for Malware Detection Based on System Calls",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Sánchez, PMS", "Celdrán, AH", "Bovet, G"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10773857/",
    "rumusan_masalah": "Bagaimana transfer learning pada LLM dapat dimanfaatkan untuk mendeteksi malware berdasarkan system calls secara efisien?",
    "penelitian_terkini": "Penelitian ini mengusulkan kerangka kerja deteksi malware berbasis transfer learning menggunakan model LLM yang telah dilatih sebelumnya, dengan fitur n-gram dari system calls.",
    "hasil_yang_diharapkan": "Peningkatan akurasi dan efisiensi deteksi malware melalui pemanfaatan model bahasa besar yang telah dipelajari sebelumnya.",
    "tantangan": "Mengadaptasi LLM terhadap data system call yang bersifat sekuensial dan spesifik, serta kebutuhan untuk menjaga performa dalam lingkungan serangan canggih.",
    "hasil_akhir": "LLM berbasis transfer learning terbukti efektif dalam mendeteksi malware, dan dapat dijadikan solusi inovatif untuk sistem keamanan siber modern."
  },
  {
    "judul": "A Unified Framework for Context-Aware IoT Management and State-of-the-Art IoT Traffic Anomaly Detection",
    "publisher": "arxiv.org",
    "author": ["Worae, DA", "Sheikh, A", "Mastorakis, S"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2412.19830",
    "rumusan_masalah": "Bagaimana merancang kerangka kerja terpadu yang dapat mengelola konteks IoT secara efektif dan mendeteksi anomali lalu lintas dengan akurasi tinggi?",
    "penelitian_terkini": "Mengembangkan sistem berbasis LLM dan deep learning untuk mengklasifikasikan dan mendeteksi berbagai jenis serangan pada lalu lintas IoT secara kontekstual.",
    "hasil_yang_diharapkan": "Terciptanya sistem deteksi anomali lalu lintas IoT yang andal, adaptif terhadap konteks, dan dapat membedakan berbagai jenis serangan dengan presisi tinggi.",
    "tantangan": "Mengintegrasikan konteks yang kompleks dari perangkat IoT ke dalam sistem deteksi, serta meningkatkan akurasi klasifikasi terhadap serangan yang beragam.",
    "hasil_akhir": "Sistem berbasis LLM menunjukkan peningkatan presisi dan keandalan dalam mengidentifikasi anomali lalu lintas IoT, serta dapat digunakan sebagai solusi terpadu dalam manajemen IoT kontekstual."
  },
  {
    "judul": "Large Language Model-Based Network Intrusion Detection",
    "publisher": "Springer",
    "author": ["Davey, D", "Karim, K", "Hassen, HR", "Batatia, H"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/chapter/10.1007/978-981-96-1758-6_26",
    "rumusan_masalah": "Bagaimana memanfaatkan Large Language Models (LLM) untuk meningkatkan kemampuan sistem deteksi intrusi jaringan?",
    "penelitian_terkini": "Mengembangkan sistem deteksi intrusi berbasis LLM untuk mendeteksi serangan jaringan menggunakan pendekatan pembelajaran mendalam.",
    "hasil_yang_diharapkan": "Terciptanya sistem Network Intrusion Detection System (NIDS) berbasis LLM yang akurat, adaptif, dan mampu mengidentifikasi ancaman baru secara real-time.",
    "tantangan": "Menangani kompleksitas data jaringan, latensi dalam pemrosesan real-time, dan keterbatasan data label untuk pelatihan model LLM.",
    "hasil_akhir": "Model deteksi intrusi berbasis LLM yang mampu meningkatkan efektivitas deteksi serangan jaringan secara signifikan dibandingkan metode konvensional."
  },
  {
    "judul": "Foundations of Deep Learning and Large Language Models in Cybersecurity",
    "publisher": "igi-global.com",
    "author": ["Zangana, HM", "Omar, M", "Al-Karaki, JN"],
    "tahun": 2025,
    "sumber_data": "https://www.igi-global.com/chapter/foundations-of-deep-learning-and-large-language-models-in-cybersecurity/374464",
    "rumusan_masalah": "Bagaimana pemanfaatan dan pengembangan arsitektur Deep Learning dan Large Language Models (LLM) dapat diterapkan secara efektif dalam bidang keamanan siber?",
    "penelitian_terkini": "Menelusuri peran fundamental deep learning dan LLM dalam deteksi anomali, sistem komunikasi aman, serta tantangan keamanan seperti serangan adversarial.",
    "hasil_yang_diharapkan": "Pengembangan pendekatan keamanan siber berbasis LLM yang lebih aman, efisien, dan mampu mengatasi potensi serangan terhadap sistem pembelajaran mendalam.",
    "tantangan": "Kerentanan terhadap serangan adversarial, kebutuhan akan pelatihan model besar yang memakan sumber daya, dan memastikan komunikasi yang aman melalui model berbasis DL dan LLM.",
    "hasil_akhir": "Pondasi teoretis dan praktis untuk mengintegrasikan LLM dan DL dalam sistem keamanan siber modern dengan pertimbangan risiko dan efektivitas deteksi."
  },
  {
    "judul": "An Adaptive End-to-End IoT Security Framework Using Explainable AI and LLMs",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Baral, S", "Saha, S", "Haque, A"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10811456/",
    "rumusan_masalah": "Bagaimana membangun kerangka kerja keamanan IoT yang adaptif dan dapat dijelaskan, dengan memanfaatkan kombinasi Explainable AI (XAI) dan Large Language Models (LLM)?",
    "penelitian_terkini": "Mengintegrasikan Explainable AI dan LLM dalam sistem keamanan IoT untuk mendeteksi dan merespons serangan secara efisien dan adaptif.",
    "hasil_yang_diharapkan": "Sistem keamanan IoT end-to-end yang mampu menjelaskan keputusan, mendeteksi serangan dengan akurat, dan memberikan respons otomatis menggunakan komunikasi berbasis LLM.",
    "tantangan": "Integrasi antara sistem LLM dan XAI yang efisien, membangun jalur komunikasi aman dengan penyedia LLM, dan memastikan adaptivitas terhadap jenis serangan baru.",
    "hasil_akhir": "Framework keamanan IoT berbasis LLM dan Explainable AI yang mampu memberikan deteksi serangan dan penjelasan terhadap keputusan sistem secara real time dan adaptif."
  },
  {
    "judul": "Application of Large Language Models in Cybersecurity: A Systematic Literature Review",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Hasanov, I", "Virtanen, S", "Hakkala, A", "Isoaho, J"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10767242/",
    "rumusan_masalah": "Apa saja pendekatan dan tantangan yang dihadapi dalam implementasi Large Language Models (LLM) untuk bidang keamanan siber?",
    "penelitian_terkini": "Studi literatur sistematis yang mengulas tren, penerapan, serta efektivitas LLM dalam konteks keamanan siber, termasuk dalam deteksi ancaman dan otomatisasi analisis keamanan.",
    "hasil_yang_diharapkan": "Identifikasi peluang, keterbatasan, dan arah penelitian masa depan dalam penerapan LLM untuk cybersecurity.",
    "tantangan": "Kurangnya standarisasi implementasi, keterbatasan data pelatihan yang representatif, serta potensi kesalahan interpretasi dan bias dari LLM.",
    "hasil_akhir": "Pemetaan menyeluruh atas penggunaan LLM dalam keamanan siber dan rekomendasi strategis untuk penelitian lanjutan serta penerapan praktis di berbagai domain."
  },
  {
    "judul": "Dollm: How Large Language Models Understanding Network Flow Data to Detect Carpet Bombing DDoS",
    "publisher": "arxiv.org",
    "author": ["Li, Q", "Zhang, Y", "Jia, Z", "Hu, Y", "Zhang, L", "Zhang, J"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2405.07638",
    "rumusan_masalah": "Bagaimana cara memanfaatkan Large Language Models (LLM) untuk memahami data aliran jaringan dalam mendeteksi serangan DDoS jenis carpet bombing?",
    "penelitian_terkini": "Mengusulkan metode baru yang menyelaraskan data aliran jaringan ke dalam ruang semantik LLM untuk meningkatkan deteksi DDoS.",
    "hasil_yang_diharapkan": "Sistem deteksi DDoS yang lebih akurat dan efektif dengan memanfaatkan pemahaman semantik LLM terhadap pola aliran jaringan.",
    "tantangan": "Kompleksitas data jaringan, konversi data ke bentuk yang sesuai untuk LLM, dan skalabilitas dalam lingkungan nyata.",
    "hasil_akhir": "Pendekatan DoLLM berhasil mengidentifikasi serangan carpet bombing DDoS secara lebih presisi dibandingkan metode tradisional."
  },
  {
    "judul": "Transforming IoT Security through Large Language Models: A Comprehensive Systematic Review and Future Directions",
    "publisher": "iapress.org",
    "author": ["Tawfik, M", "Abdelhaliem, AH", "Fathi, IS"],
    "tahun": 2025,
    "sumber_data": "http://iapress.org/index.php/soic/article/view/2424",
    "rumusan_masalah": "Bagaimana peran dan efektivitas LLM dalam meningkatkan keamanan IoT dibandingkan dengan metode pembelajaran mesin tradisional?",
    "penelitian_terkini": "Ulasan sistematis menyeluruh tentang penerapan LLM dalam keamanan IoT serta perbandingan terhadap metode tradisional.",
    "hasil_yang_diharapkan": "Pemahaman yang komprehensif tentang kekuatan dan keterbatasan LLM dalam konteks keamanan IoT, serta arahan untuk penelitian masa depan.",
    "tantangan": "Variasi perangkat IoT, protokol komunikasi yang beragam, dan integrasi lintas produsen.",
    "hasil_akhir": "LLM menunjukkan potensi signifikan dalam menyederhanakan dan memperkuat sistem keamanan IoT, namun masih dibutuhkan standarisasi dan penelitian lanjutan."
  },
  {
    "judul": "Enhancing Network Traffic Classification with Large Language Models",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Zhou, H", "Huang, X", "Deng, L"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10825308/",
    "rumusan_masalah": "Bagaimana cara meningkatkan klasifikasi lalu lintas jaringan menggunakan pendekatan Large Language Models (LLM)?",
    "penelitian_terkini": "Penggabungan LLM dengan metode machine learning dan deep learning untuk klasifikasi lalu lintas jaringan.",
    "hasil_yang_diharapkan": "Model klasifikasi lalu lintas jaringan yang lebih akurat dan adaptif menggunakan LLM.",
    "tantangan": "Kompleksitas lalu lintas jaringan yang terus berkembang dan kebutuhan akan prompt LLM yang sesuai.",
    "hasil_akhir": "LLM mampu meningkatkan klasifikasi lalu lintas jaringan melalui desain prompt yang cermat dan integrasi dua tahap dengan model tradisional."
  },
  {
    "judul": "Large language models for cyber security: A systematic literature review",
    "publisher": "arxiv.org",
    "author": ["Xu, HX", "Wang, SA", "Li, N", "Wang, K", "Zhao, Y", "Chen, K"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2405.04760",
    "rumusan_masalah": "Bagaimana arsitektur LLM dapat digunakan untuk mendeteksi dan mengklasifikasikan berbagai jenis serangan siber?",
    "penelitian_terkini": "Tinjauan sistematis terhadap berbagai pendekatan LLM dalam keamanan siber, mencakup arsitektur model dan metode deteksi.",
    "hasil_yang_diharapkan": "Identifikasi keunggulan dan keterbatasan LLM dalam konteks keamanan siber serta pemetaan tren penelitian.",
    "tantangan": "Kompleksitas serangan siber yang beragam dan kebutuhan adaptasi model LLM untuk konteks keamanan.",
    "hasil_akhir": "LLM menunjukkan potensi tinggi dalam deteksi serangan siber melalui kemampuan klasifikasi dan generalisasi terhadap pola serangan."
  },
  {
    "judul": "IoT vulnerability detection using featureless LLM CyBert model",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Binhulayyil, S", "Li, S", "Saxena, N"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10945147/",
    "rumusan_masalah": "Bagaimana cara mendeteksi kerentanan IoT tanpa menggunakan fitur eksplisit dengan memanfaatkan model LLM seperti CyBert?",
    "penelitian_terkini": "Pendekatan deteksi kerentanan berbasis deep learning dan LLM tanpa ekstraksi fitur manual pada perangkat IoT.",
    "hasil_yang_diharapkan": "Peningkatan akurasi dan efisiensi runtime dalam mendeteksi serangan terhadap perangkat IoT.",
    "tantangan": "Mengatasi keterbatasan pendekatan tradisional berbasis fitur dalam mendeteksi kerentanan sistem IoT.",
    "hasil_akhir": "Model CyBert dan SecurityLLM menunjukkan performa tinggi dalam mendeteksi serangan secara otomatis tanpa fitur eksplisit."
  },
  {
    "judul": "A Generative AI-Driven CTI Framework for IDS using Machine Learning and Knowledge Graph",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Amin, QK", "Gillani, SHAS", "Shah, SNM"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/11004337/",
    "rumusan_masalah": "Bagaimana cara mengintegrasikan AI generatif dan knowledge graph untuk meningkatkan kemampuan reasoning dalam sistem deteksi intrusi (IDS)?",
    "penelitian_terkini": "Penggunaan LLM dengan Retrieval-Augmented Generation (RAG), graph-based reasoning, dan CVEID untuk mendeteksi serta mengklasifikasi serangan siber.",
    "hasil_yang_diharapkan": "Framework IDS yang mampu mendeteksi serangan siber sekaligus mengidentifikasi jenis dan kerentanan (CVE) yang terkait secara efisien.",
    "tantangan": "Meningkatkan akurasi deteksi dan interpretabilitas hasil dalam sistem IDS berbasis AI dengan menggabungkan banyak sumber pengetahuan.",
    "hasil_akhir": "Framework berhasil mengintegrasikan LLM dengan pengetahuan CTI berbasis graph dan teknik ML untuk mendeteksi dan menjelaskan serangan secara otomatis."
  },
  {
    "judul": "Exploring the Role of Large Language Models in Cybersecurity: A Systematic Survey",
    "publisher": "arxiv.org",
    "author": ["Tian, S", "Zhang, T", "Liu, J", "Wang, J", "Wu, X", "Zhu, X"],
    "tahun": 2025,
    "sumber_data": "https://arxiv.org/abs/2504.15622",
    "rumusan_masalah": "Bagaimana peran dan efektivitas LLM dalam meningkatkan pertahanan terhadap serangan siber serta tantangan implementasinya?",
    "penelitian_terkini": "Survey sistematis terhadap berbagai pendekatan penggunaan LLM dalam keamanan siber, termasuk penerapan dalam mendeteksi dan merespons serangan seperti foothold attacks.",
    "hasil_yang_diharapkan": "Pemetaan menyeluruh atas aplikasi LLM di berbagai domain cybersecurity dan identifikasi celah riset untuk pengembangan masa depan.",
    "tantangan": "Isu terkait deployment LLM dalam konteks keamanan siber, keterbatasan data, serta integrasi dengan sistem keamanan tradisional.",
    "hasil_akhir": "Studi ini menyajikan tinjauan mendalam tentang potensi, kendala, dan arah penelitian LLM di bidang cybersecurity, serta memberikan rekomendasi implementatif."
  },
  {
    "judul": "Security posture detection using LLM",
    "publisher": "pubs.aip.org",
    "author": ["Garde, T", "Rathi, M", "Dubey, S"],
    "tahun": 2024,
    "sumber_data": "https://pubs.aip.org/aip/acp/article-abstract/3156/1/070008/3316335",
    "rumusan_masalah": "Bagaimana cara menggunakan Large Language Models (LLM) untuk mendeteksi posture keamanan perangkat dan kerentanannya?",
    "penelitian_terkini": "Studi ini menunjukkan pendekatan baru dalam mendeteksi posture keamanan dengan memanfaatkan LLM untuk mengenali potensi serangan dan kerentanan secara proaktif.",
    "hasil_yang_diharapkan": "Model yang dapat mengidentifikasi celah keamanan dalam sistem dan jaringan digital secara otomatis dengan memanfaatkan kemampuan pemahaman konteks dari LLM.",
    "tantangan": "Mengintegrasikan LLM dengan sistem keamanan tradisional dan menangani kompleksitas data dari berbagai jenis perangkat digital.",
    "hasil_akhir": "Penelitian ini menegaskan efektivitas LLM dalam meningkatkan deteksi posture keamanan secara proaktif dan adaptif dalam lingkungan digital yang kompleks."
  },
  {
    "judul": "Enhancing machine learning model interpretability in intrusion detection systems through SHAP explanations and LLM-generated descriptions",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Khediri, A", "Slimi, H", "Yahiaoui, A"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10541168/",
    "rumusan_masalah": "Bagaimana meningkatkan interpretabilitas model machine learning dalam sistem deteksi intrusi (IDS) menggunakan SHAP dan deskripsi dari LLM?",
    "penelitian_terkini": "Penelitian ini menggabungkan metode SHAP (SHapley Additive exPlanations) dan deskripsi berbasis LLM untuk memberikan pemahaman yang lebih transparan terhadap keputusan model IDS.",
    "hasil_yang_diharapkan": "Model IDS yang tidak hanya akurat, tetapi juga mudah dipahami oleh manusia melalui visualisasi SHAP dan narasi otomatis dari LLM.",
    "tantangan": "Menerjemahkan keluaran model kompleks menjadi penjelasan yang informatif dan dapat dipercaya bagi pengguna akhir.",
    "hasil_akhir": "Sistem yang mampu menjelaskan alasan di balik deteksi intrusi secara transparan, membantu analis keamanan memahami dan mempercayai hasil deteksi yang dihasilkan model."
  },
  {
    "judul": "Advanced network intrusion detection with TabTransformer",
    "publisher": "centuryscipub.com",
    "author": ["Wang, X", "Qiao, Y", "Xiong, J", "Zhao, Z"],
    "tahun": 2024,
    "sumber_data": "https://centuryscipub.com/index.php/jtpes/article/view/527",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi deteksi intrusi jaringan dengan memanfaatkan arsitektur TabTransformer?",
    "penelitian_terkini": "Penelitian ini mengeksplorasi penggunaan TabTransformer, sebuah model deep learning yang dirancang untuk data tabular, dalam konteks deteksi intrusi jaringan.",
    "hasil_yang_diharapkan": "Sistem deteksi intrusi yang lebih akurat dan efisien dalam mengidentifikasi aktivitas berbahaya dalam komunikasi jaringan.",
    "tantangan": "Menangani kompleksitas pola serangan jaringan yang beragam dan volume data yang besar dalam lingkungan nyata.",
    "hasil_akhir": "Model berbasis TabTransformer menunjukkan performa superior dibanding metode konvensional dalam mendeteksi serangan jaringan."
  },
  {
    "judul": "AdvTG: An Adversarial Traffic Generation Framework to Deceive DL-Based Malicious Traffic Detection Models",
    "publisher": "dl.acm.org",
    "author": ["Sun, P", "Yun, X", "Li, S", "Yin, T", "Si, C", "Xie, J"],
    "tahun": 2025,
    "sumber_data": "https://dl.acm.org/doi/abs/10.1145/3696410.3714876",
    "rumusan_masalah": "Bagaimana cara menghasilkan lalu lintas jaringan yang mampu mengecoh sistem deteksi lalu lintas berbahaya berbasis deep learning?",
    "penelitian_terkini": "Mengembangkan framework AdvTG yang memanfaatkan Large Language Model (LLM) dan Reinforcement Learning (RL) untuk menghasilkan lalu lintas yang bersifat adversarial terhadap sistem deteksi.",
    "hasil_yang_diharapkan": "Menguji kelemahan model deteksi serangan berbasis deep learning melalui simulasi serangan realistis menggunakan lalu lintas yang dihasilkan secara otomatis.",
    "tantangan": "Menghasilkan lalu lintas jaringan yang cukup realistis dan efektif dalam mengecoh model deteksi tanpa terdeteksi.",
    "hasil_akhir": "Framework AdvTG berhasil menunjukkan bahwa model deteksi deep learning dapat ditipu oleh lalu lintas yang dihasilkan secara adversarial."
  },
  {
    "judul": "Large Language Models in Cyberattacks",
    "publisher": "Springer",
    "author": ["Lebed, SV", "Namiot, DE", "Zubareva, EV", "Khenkin, PV"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/article/10.1134/S1064562425700012",
    "rumusan_masalah": "Bagaimana Large Language Model (LLM) dapat dimanfaatkan dalam perencanaan dan pelaksanaan serangan siber terhadap sistem berbasis AI dan model pembelajaran mesin?",
    "penelitian_terkini": "Meneliti penggunaan LLM oleh pihak penyerang untuk menghasilkan serangan adversarial terhadap sistem AI dan ML serta mengeksploitasi kelemahan model-model tersebut.",
    "hasil_yang_diharapkan": "Memberikan pemahaman lebih dalam tentang potensi penyalahgunaan LLM dalam dunia keamanan siber serta meningkatkan kewaspadaan terhadap risiko tersebut.",
    "tantangan": "Mengidentifikasi dan mengukur efektivitas serangan yang dihasilkan oleh LLM terhadap sistem pembelajaran mesin dan AI yang kompleks.",
    "hasil_akhir": "LLM terbukti mampu digunakan oleh penyerang untuk menyusun dan melancarkan serangan canggih terhadap model AI dan sistem keamanan digital."
  },
  {
    "judul": "Exploring LLM-based multi-agent situation awareness for zero-trust space-air-ground integrated network",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Cao, X", "Nan, G", "Guo, H", "Mu, H", "Wang, L"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10963886/",
    "rumusan_masalah": "Bagaimana penerapan Large Language Model (LLM) dalam meningkatkan kesadaran situasi multi-agen pada jaringan terintegrasi luar angkasa-udara-darat (SAGIN) berbasis zero-trust?",
    "penelitian_terkini": "Mengembangkan framework LLM-SA yang mampu mengekstrak fitur serangan penting dari informasi SAG-Attack, serta mengintegrasikan pendekatan multi-agen berbasis LLM dalam lingkungan jaringan SAGIN.",
    "hasil_yang_diharapkan": "Sistem kesadaran situasi yang cerdas dan adaptif terhadap serangan siber pada arsitektur jaringan luar angkasa-udara-darat yang kompleks dengan prinsip zero-trust.",
    "tantangan": "Mengkoordinasikan multi-agen berbasis LLM untuk memproses data real-time dari berbagai domain dan menghasilkan kesadaran situasi yang akurat dalam lingkungan yang tidak saling percaya (zero-trust).",
    "hasil_akhir": "LLM-SA terbukti efektif dalam meningkatkan pemahaman situasional melalui ekstraksi fitur serangan yang relevan dan koordinasi antar agen pada jaringan SAGIN berbasis zero-trust."
  },
  {
    "judul": "LLM-Powered Agentic AI Approach to Securing EV Charging Systems Against Cyber Threats",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Honnalli, R", "Farooq, J"],
    "tahun": 2025,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/11027017/",
    "rumusan_masalah": "Bagaimana cara melindungi sistem pengisian daya kendaraan listrik (EV) dari ancaman siber seperti pencurian energi dan manipulasi komunikasi menggunakan pendekatan AI berbasis LLM?",
    "penelitian_terkini": "Mengembangkan sistem deteksi ancaman berbasis LLM (Large Language Model) dan agen AI untuk mengidentifikasi serta merespons serangan siber terhadap sistem EV, kemudian membandingkannya dengan model machine learning tradisional.",
    "hasil_yang_diharapkan": "Terciptanya sistem deteksi ancaman yang lebih responsif dan akurat berbasis LLM yang dapat memberikan keamanan lebih baik bagi sistem pengisian daya EV.",
    "tantangan": "Menghadapi kompleksitas serangan siber yang bersifat dinamis terhadap sistem EV, serta membangun model LLM yang adaptif dan efisien dalam lingkungan waktu nyata.",
    "hasil_akhir": "Sistem deteksi berbasis LLM menunjukkan kinerja superior dalam mendeteksi serangan dibandingkan dengan metode pembelajaran mesin tradisional, memberikan solusi keamanan proaktif untuk infrastruktur EV."
  },

  {
    "judul": "A review on deep learning autoencoder in the design of next-generation communication systems",
    "publisher": "arxiv.org",
    "author": ["Alnaseri, O", "Alzubaidi, L", "Himeur, Y"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2412.13843",
    "rumusan_masalah": "Bagaimana peran dan penerapan deep learning autoencoder dalam merancang sistem komunikasi generasi berikutnya?",
    "penelitian_terkini": "Studi ini meninjau pendekatan deep learning khususnya autoencoder dalam sistem komunikasi modern seperti komunikasi optik (FSO), termasuk penerapan deep belief network (DBN) untuk proses demodulasi panjang gelombang dan denoising sinyal.",
    "hasil_yang_diharapkan": "Menjelaskan potensi dan efektivitas arsitektur autoencoder dalam meningkatkan performa transmisi dan pengolahan sinyal di sistem komunikasi masa depan.",
    "tantangan": "Kompleksitas model deep learning, kebutuhan data pelatihan besar, serta kesesuaian model dengan lingkungan komunikasi yang dinamis.",
    "hasil_akhir": "Autoencoder terbukti mampu meningkatkan kualitas sinyal dan mendukung sistem komunikasi canggih, namun masih dibutuhkan penelitian lebih lanjut untuk optimalisasi dan penerapan skala luas."
  },

  {
    "judul": "LSTM-Autoencoder For Faster-Than-Nyquist Optical Wireless MIMO Communication System",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Xingyu, Z", "Minghua, C", "Yue, Z", "Luxia, Z"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10808071/",
    "rumusan_masalah": "Bagaimana penerapan LSTM-autoencoder dapat meningkatkan efisiensi sistem komunikasi MIMO optik nirkabel dengan laju lebih cepat dari Nyquist?",
    "penelitian_terkini": "Studi ini mengembangkan sistem komunikasi nirkabel optik MIMO generasi mendatang yang menggantikan modul transmisi konvensional dengan jaringan neural, khususnya LSTM-autoencoder.",
    "hasil_yang_diharapkan": "Meningkatkan efisiensi transmisi data dan mengurangi kompleksitas sistem dengan memanfaatkan deep learning untuk menggantikan komponen tradisional dalam komunikasi optik MIMO.",
    "tantangan": "Integrasi jaringan neural dalam sistem komunikasi fisik secara langsung, validasi performa di berbagai kondisi kanal optik, serta kebutuhan pelatihan model yang presisi.",
    "hasil_akhir": "LSTM-autoencoder berhasil diterapkan untuk menggantikan modul transmisi tradisional, memberikan kinerja tinggi dalam komunikasi optik nirkabel dengan efisiensi spektral yang lebih baik dari batas Nyquist."
  },

  {
    "judul": "Attention-assisted autoencoder neural network for end-to-end optimization of multi-access fiber-terahertz communication systems",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Li, Z", "Dong, B", "Li, G", "Jia, J", "Sun, A", "Shen, W"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10235947/",
    "rumusan_masalah": "Bagaimana mengoptimalkan sistem komunikasi fiber-terahertz multi-akses secara end-to-end menggunakan autoencoder berbasis attention?",
    "penelitian_terkini": "Penelitian ini mengembangkan sistem komunikasi fiber-terahertz terintegrasi secara end-to-end dengan pendekatan autoencoder neural network yang dilengkapi modul attention (AMAE).",
    "hasil_yang_diharapkan": "Meningkatkan efisiensi dan kapasitas sistem fiber-terahertz melalui pemrosesan otomatis berbasis deep learning, mengurangi ketergantungan pada desain blok manual.",
    "tantangan": "Kompleksitas integrasi attention mechanism dalam autoencoder, serta keandalan transmisi pada frekuensi tinggi seperti THz.",
    "hasil_akhir": "AMAE berhasil mengoptimalkan performa sistem fiber-terahertz secara menyeluruh, dan telah mendapat 10 sitasi sejak tahun 2023 sebagai bukti kontribusi signifikan pada bidang komunikasi optik canggih."
  },

  {
    "judul": "Internet of Things Data Transfer Method Using Neural Network Autoencoder",
    "publisher": "infotelesc.kpi.ua",
    "author": ["Siemens, E", "Kurdecha, V", "Ushakov, S"],
    "tahun": 2023,
    "sumber_data": "http://infotelesc.kpi.ua/article/view/281959",
    "rumusan_masalah": "Bagaimana metode autoencoder berbasis neural network dapat digunakan untuk mentransfer data dalam sistem Internet of Things (IoT)?",
    "penelitian_terkini": "Penelitian mengembangkan model DeepZip yang memanfaatkan Recurrent Neural Network (RNN) dan teori informasi untuk mengompresi dan mentransfer data IoT secara efisien.",
    "hasil_yang_diharapkan": "Mengurangi ukuran data yang ditransfer dalam sistem IoT dengan tetap mempertahankan integritas informasi melalui metode pembelajaran sekuensial.",
    "tantangan": "Menghadapi tantangan kompleksitas kompresi data sekuensial waktu nyata dan efisiensi algoritma dalam perangkat IoT yang memiliki sumber daya terbatas.",
    "hasil_akhir": "Model DeepZip berhasil menunjukkan efisiensi dalam mentransfer data IoT dengan menggunakan RNN, dan telah mendapat 7 sitasi sejak 2023, membuktikan relevansi pendekatan ini dalam pengembangan komunikasi IoT."
  },

  {
    "judul": "Attention-aided autoencoder-based channel prediction for intelligent reflecting surface-assisted millimeter-wave communications",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Chen, HY", "Wu, MH", "Yang, TW"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10120965/",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi prediksi kanal pada komunikasi gelombang milimeter yang dibantu oleh intelligent reflecting surface (IRS) menggunakan autoencoder dengan attention mechanism?",
    "penelitian_terkini": "Penelitian ini mengusulkan model convolutional denoising autoencoder yang dibantu oleh attention untuk memprediksi kanal komunikasi IRS-mmWave, menggantikan metode LSTM tradisional yang sensitif terhadap inisialisasi bobot acak.",
    "hasil_yang_diharapkan": "Meningkatkan keandalan dan akurasi prediksi kanal dalam sistem IRS-mmWave melalui pendekatan autoencoder berbasis attention.",
    "tantangan": "Sensitivitas model seperti LSTM terhadap inisialisasi bobot acak, serta kebutuhan pengolahan sinyal yang efisien pada frekuensi tinggi.",
    "hasil_akhir": "Model autoencoder berbasis attention berhasil menunjukkan performa superior dalam prediksi kanal IRS-mmWave dan telah memperoleh 14 sitasi sejak 2023, menandakan pengaruh penting di bidang komunikasi generasi baru."
  },

  {
    "judul": "Enhancing intrusion detection systems: Innovative deep learning approaches using CNN, RNN, DBN and autoencoders for robust network security",
    "publisher": "ph.pollub.pl",
    "author": ["HOSSAIN, Y", "FERDOUS, Z", "WAHID, T"],
    "tahun": 2025,
    "sumber_data": "https://ph.pollub.pl/index.php/acs/article/view/6667",
    "rumusan_masalah": "Bagaimana meningkatkan sistem deteksi intrusi (IDS) menggunakan pendekatan deep learning seperti CNN, RNN, DBN, dan autoencoder untuk mencapai keamanan jaringan yang lebih kuat?",
    "penelitian_terkini": "Penelitian ini mengevaluasi dan menggabungkan beberapa pendekatan deep learning, termasuk convolutional neural networks (CNN), recurrent neural networks (RNN), deep belief networks (DBN), dan autoencoder, untuk membangun IDS yang adaptif dan tangguh.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi intrusi yang lebih akurat, efisien, dan mampu beradaptasi terhadap berbagai jenis serangan jaringan secara real-time.",
    "tantangan": "Mengelola kompleksitas model deep learning secara efisien untuk data lalu lintas jaringan besar dan variatif serta memastikan generalisasi model terhadap ancaman baru.",
    "hasil_akhir": "Model gabungan deep learning ini berhasil meningkatkan kemampuan IDS dan telah memperoleh 2 sitasi sejak awal tahun 2025, menunjukkan potensi kontribusi dalam bidang keamanan siber berbasis AI."
  },

  {
    "judul": "Elephant Flows Detection Using Deep Neural Network, Convolutional Neural Network, Long Short‐Term Memory, and Autoencoder",
    "publisher": "Wiley Online Library",
    "author": ["Geremew, G Wassie", "Ding, J"],
    "tahun": 2023,
    "sumber_data": "https://onlinelibrary.wiley.com/doi/abs/10.1155/2023/1495642",
    "rumusan_masalah": "Bagaimana mendeteksi elephant flows dalam jaringan menggunakan pendekatan deep learning seperti DNN, CNN, LSTM, dan autoencoder?",
    "penelitian_terkini": "Penelitian ini menggabungkan berbagai teknik deep learning, termasuk CNN, LSTM, dan autoencoder, untuk membangun sistem deteksi aliran data besar (elephant flows) yang akurat dan efisien.",
    "hasil_yang_diharapkan": "Mengidentifikasi elephant flows secara tepat waktu untuk mendukung manajemen lalu lintas jaringan dan mencegah kemacetan atau gangguan performa jaringan.",
    "tantangan": "Membandingkan performa berbagai model deep learning dengan dataset pelatihan dan validasi agar diperoleh model terbaik yang mampu bekerja optimal dalam kondisi jaringan nyata.",
    "hasil_akhir": "Model berbasis deep learning berhasil mendeteksi elephant flows dengan performa tinggi dan telah mendapat 11 sitasi sejak 2023, menunjukkan kontribusinya dalam pengelolaan jaringan cerdas berbasis AI."
  },

  {
    "judul": "Nonlinearity mitigation in a fiber-wireless integrated system based on low-complexity autoencoder and BiLSTM-ANN equalizer",
    "publisher": "opg.optica.org",
    "author": [
      "Liu, X",
      "Zhang, J",
      "Zhu, M",
      "Tong, W",
      "Xin, Z",
      "Wang, Y",
      "Lei, M"
    ],
    "tahun": 2023,
    "sumber_data": "https://opg.optica.org/abstract.cfm?uri=oe-31-12-20005",
    "rumusan_masalah": "Bagaimana mengurangi dampak nonlinieritas dalam sistem terintegrasi fiber-wireless menggunakan autoencoder berkompleksitas rendah dan equalizer BiLSTM-ANN?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan berbasis autoencoder dan BiLSTM-ANN untuk mengatasi distorsi nonlinier dalam sistem komunikasi optik dan nirkabel terintegrasi.",
    "hasil_yang_diharapkan": "Mengurangi kesalahan transmisi akibat nonlinieritas dengan cara yang efisien dan hemat sumber daya menggunakan model deep learning ringan.",
    "tantangan": "Mencapai keseimbangan antara akurasi mitigasi nonlinieritas dan kompleksitas perhitungan, serta membandingkan efektivitas berbagai model autoencoder.",
    "hasil_akhir": "Model yang diajukan berhasil meningkatkan kinerja sistem fiber-wireless terintegrasi dengan kompleksitas rendah, dan telah disitasi 8 kali sejak tahun 2023, menunjukkan efektivitas dan kontribusinya di bidang komunikasi optik canggih."
  },

  {
    "judul": "Symbol detection and channel estimation for space optical communications using neural network and autoencoder",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Elfikky, A", "Rezki, Z"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10373105/",
    "rumusan_masalah": "Bagaimana mendeteksi simbol dan melakukan estimasi kanal secara efisien dalam sistem komunikasi optik ruang angkasa menggunakan neural network dan autoencoder?",
    "penelitian_terkini": "Penelitian ini mengembangkan model autoencoder inovatif untuk membangun sistem komunikasi lapisan fisik secara lengkap, khususnya dalam konteks komunikasi optik di luar angkasa.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi simbol dan estimasi kanal pada sistem komunikasi ruang dengan pendekatan pembelajaran mesin end-to-end.",
    "tantangan": "Menghadapi kondisi ekstrem dan distorsi saluran pada komunikasi optik ruang, serta merancang arsitektur autoencoder yang mampu beradaptasi dengan variabilitas kanal.",
    "hasil_akhir": "Model autoencoder dan neural network yang diajukan terbukti efektif dalam komunikasi optik ruang dan telah disitasi sebanyak 11 kali sejak tahun 2023, menandakan kontribusinya terhadap sistem komunikasi luar angkasa berbasis AI."
  },

  {
    "judul": "Autoencoder-Based Neural Network Model for Anomaly Detection in Wireless Body Area Networks",
    "publisher": "mdpi.com",
    "author": ["Rassam, MA"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/2624-831X/5/4/39",
    "rumusan_masalah": "Bagaimana menggunakan model neural network berbasis autoencoder untuk mendeteksi anomali dalam Wireless Body Area Networks (WBANs)?",
    "penelitian_terkini": "Penelitian ini mengembangkan model autoencoder convolutional neural network (CNN) untuk deteksi anomali dalam jaringan WBAN dengan pendekatan berbasis error rekonstruksi.",
    "hasil_yang_diharapkan": "Mendeteksi gangguan atau aktivitas abnormal secara akurat dalam sistem WBAN secara otomatis dan efisien untuk mendukung layanan kesehatan berbasis IoT.",
    "tantangan": "Menjaga akurasi deteksi tinggi dalam kondisi sinyal bising dan mempertahankan efisiensi komputasi untuk perangkat wearable dengan daya terbatas.",
    "hasil_akhir": "Model autoencoder-CNN menunjukkan potensi tinggi untuk deteksi anomali WBAN dan telah disitasi sebanyak 3 kali sejak 2024, menunjukkan penerimaan awal yang positif dalam komunitas penelitian IoT dan kesehatan digital."
  },

  {
    "judul": "Network intrusion detection system based security system for cloud services using novel recurrent neural network-autoencoder (NRNN-AE) and genetic",
    "publisher": "Trans Tech Publ",
    "author": ["Priya, S", "Ponmagal, RS"],
    "tahun": 2023,
    "sumber_data": "https://www.scientific.net/AST.124.729",
    "rumusan_masalah": "Bagaimana membangun sistem keamanan cloud service yang efektif dengan mendeteksi intrusi jaringan menggunakan NRNN-AE dan algoritma genetika?",
    "penelitian_terkini": "Penelitian ini memperkenalkan algoritma baru NRNN-AE yang menggabungkan recurrent neural network dan autoencoder untuk mengenali pola anomali jaringan serta memprediksi serangan terhadap keamanan jaringan cloud.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi intrusi yang mampu mengidentifikasi variasi perilaku abnormal secara akurat untuk meningkatkan keamanan layanan cloud.",
    "tantangan": "Mengelola keakuratan deteksi dalam lingkungan cloud yang dinamis serta mengoptimalkan kombinasi model deep learning dan algoritma genetika.",
    "hasil_akhir": "NRNN-AE terbukti efektif dalam mendeteksi ancaman keamanan cloud dan telah disitasi 4 kali sejak tahun 2023, menandakan relevansi pendekatannya dalam keamanan siber berbasis AI."
  },

  {
    "judul": "One model to find them all deep learning for multivariate time-series anomaly detection in mobile network data",
    "publisher": "ieeexplore.ieee.org",
    "author": ["González, GG", "Tagliafico, SM"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10345720/",
    "rumusan_masalah": "Bagaimana menerapkan satu model deep learning yang efektif untuk mendeteksi anomali multivariate time-series dalam data jaringan seluler?",
    "penelitian_terkini": "Penelitian menggunakan dataset TELCO untuk menguji stabilitas model seperti vanilla RNN, LSTM, dan Autoencoder dalam mendeteksi anomali pada data jaringan seluler yang kompleks.",
    "hasil_yang_diharapkan": "Membangun pendekatan universal berbasis deep learning yang dapat secara akurat mendeteksi berbagai jenis anomali dalam data multivariate dari jaringan mobile.",
    "tantangan": "Menangani kompleksitas data multivariate time-series dan membandingkan efektivitas beberapa arsitektur deep learning secara adil dan menyeluruh.",
    "hasil_akhir": "Autoencoder dan model deep learning lainnya menunjukkan hasil kompetitif dalam deteksi anomali data jaringan seluler dan artikel ini telah disitasi sebanyak 19 kali sejak 2023, menandakan pengaruh kuatnya di bidang network intelligence dan time-series anomaly detection."
  },

  {
    "judul": "NFA: A neural factorization autoencoder based online telephony fraud detection",
    "publisher": "Elsevier",
    "author": ["Wahid, A", "Msahli, M", "Bifet, A", "Memmi, G"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S235286482300055X",
    "rumusan_masalah": "Bagaimana mendeteksi penipuan dalam teleponi daring secara real-time menggunakan pendekatan autoencoder dan neural factorization?",
    "penelitian_terkini": "Model Neural Factorization Autoencoder (NFA) dirancang untuk menganalisis pola panggilan pelanggan dan mengidentifikasi aktivitas teleponi yang mencurigakan. NFA menggabungkan kekuatan Neural Factorization Machines (NFM) dengan autoencoder dan jaringan saraf lainnya.",
    "hasil_yang_diharapkan": "Mendeteksi panggilan penipuan secara online dengan akurasi tinggi dan respons cepat, berdasarkan pola perilaku pengguna.",
    "tantangan": "Menghadapi dinamika perilaku pengguna, ketidakseimbangan data (fraud vs. non-fraud), dan kebutuhan deteksi waktu nyata dalam skala besar.",
    "hasil_akhir": "Model NFA berhasil mendeteksi penipuan secara efisien dalam sistem telepon daring dan telah disitasi 12 kali sejak 2024, menunjukkan kontribusi kuat dalam keamanan jaringan dan analitik perilaku pelanggan."
  },

  {
    "judul": "Enhancing power generation forecasting in smart grids using hybrid autoencoder long short-term memory machine learning model",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Zafar, A", "Che, Y", "Ahmed, M", "Sarfraz, M", "Ahmad, A"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10288460/",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi peramalan pembangkitan energi dalam smart grid menggunakan model pembelajaran mesin hybrid Autoencoder-LSTM?",
    "penelitian_terkini": "Penelitian ini mengevaluasi efektivitas model Autoencoder-LSTM (AE-LSTM) dalam meramalkan pembangkitan energi dengan menggunakan kombinasi Autoencoder, LSTM, RNN, dan DBN.",
    "hasil_yang_diharapkan": "Menghasilkan model ramalan energi yang lebih akurat dan andal untuk mendukung pengelolaan beban dan efisiensi energi dalam sistem grid pintar.",
    "tantangan": "Kompleksitas dalam mengintegrasikan berbagai jenis model deep learning serta kebutuhan akurasi tinggi pada data yang sangat fluktuatif seperti energi terbarukan.",
    "hasil_akhir": "Model AE-LSTM menunjukkan performa tinggi dalam peramalan energi dan telah disitasi sebanyak 13 kali sejak 2023, menandakan potensi besar untuk aplikasi smart grid berbasis AI."
  },

  {
    "judul": "Deep stacked autoencoder-based long-term spectrum prediction using real-world data",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Pan, G", "Wu, Q", "Ding, G", "Wang, W", "Li, J"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10064355/",
    "rumusan_masalah": "Bagaimana memprediksi spektrum jangka panjang secara akurat menggunakan data dunia nyata dengan pendekatan deep stacked autoencoder dan Bi-LSTM?",
    "penelitian_terkini": "Penelitian menggabungkan stacked autoencoder (SAE) dan Bi-directional LSTM (Bi-LSTM) untuk membentuk arsitektur prediksi spektrum yang mendalam dan tangguh dalam skenario dunia nyata.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi spektrum jangka panjang agar alokasi frekuensi dapat dilakukan secara efisien dan adaptif dalam sistem komunikasi nirkabel.",
    "tantangan": "Pengolahan data spektrum nyata yang bervariasi dan dinamis serta integrasi optimal antara fitur ekstraksi SAE dan pemodelan urutan temporal Bi-LSTM.",
    "hasil_akhir": "Model SAE + Bi-LSTM memberikan hasil prediksi spektrum yang unggul dan telah memperoleh 30 sitasi sejak 2023, mencerminkan dampak signifikan dalam manajemen spektrum dan komunikasi kognitif berbasis AI."
  },

  {
    "judul": "Variational autoencoder-enhanced deep neural network-based detection for MIMO systems",
    "publisher": "Elsevier",
    "author": ["Omondi, G", "Olwal, TO"],
    "tahun": 2023,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2772671123002309",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi deteksi sinyal dalam sistem MIMO menggunakan pendekatan deep neural network yang diperkuat dengan variational autoencoder (VAE)?",
    "penelitian_terkini": "Penelitian ini memperkenalkan model deteksi sinyal berbasis deep neural network yang dipadukan dengan variational autoencoder (VAE-DNN-Det) untuk sistem komunikasi MIMO.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi MIMO yang lebih akurat dan efisien dengan memanfaatkan kekuatan representasi laten dari VAE dalam mendukung klasifikasi DNN.",
    "tantangan": "Mengintegrasikan arsitektur VAE ke dalam pipeline DNN secara efisien tanpa mengorbankan latency serta menghindari overfitting pada data pelatihan MIMO yang kompleks.",
    "hasil_akhir": "Model VAE-DNN-Det menunjukkan peningkatan deteksi sinyal secara signifikan pada sistem MIMO dan telah disitasi sebanyak 9 kali sejak tahun 2023, membuktikan dampaknya dalam pengembangan sistem komunikasi modern berbasis AI."
  },

  {
    "judul": "Cyber attack detection for self-driving vehicle networks using deep autoencoder algorithms",
    "publisher": "mdpi.com",
    "author": ["Alsaade, FW", "Al-Adhaileh, MH"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/1424-8220/23/8/4086",
    "rumusan_masalah": "Bagaimana mendeteksi serangan siber secara efektif dalam jaringan kendaraan otonom menggunakan algoritma deep autoencoder?",
    "penelitian_terkini": "Penelitian ini mengembangkan sistem deteksi intrusi berbasis deep learning untuk jaringan kendaraan otonom (termasuk komunikasi intra-kendaraan, V2V, dan V2I), dengan menggunakan LSTM autoencoder sebagai fondasi utama.",
    "hasil_yang_diharapkan": "Mendeteksi dan mencegah ancaman siber secara real-time dalam sistem transportasi cerdas (ITS), khususnya jaringan kendaraan tanpa pengemudi.",
    "tantangan": "Menangani volume dan variasi tinggi data kendaraan, serta menjamin akurasi dan efisiensi deteksi serangan dalam kondisi mobilitas tinggi.",
    "hasil_akhir": "Model LSTM autoencoder berhasil meningkatkan efektivitas IDS untuk kendaraan otonom, dan artikel ini telah disitasi sebanyak 52 kali sejak 2023, menunjukkan pengaruh signifikan dalam bidang keamanan transportasi cerdas berbasis AI."
  },

  {
    "judul": "Machine learning autoencoder‐based parameters prediction for solar power generation systems in smart grid",
    "publisher": "Wiley Online Library",
    "author": ["Zafar, A", "Che, Y", "Faheem, M", "Abubakar, M", "Ali, S"],
    "tahun": 2024,
    "sumber_data": "https://ietresearch.onlinelibrary.wiley.com/doi/abs/10.1049/stg2.12153",
    "rumusan_masalah": "Bagaimana memprediksi parameter sistem pembangkit listrik tenaga surya secara akurat dalam smart grid menggunakan model machine learning berbasis autoencoder?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan hybrid yang menggabungkan autoencoder dan LSTM (termasuk juga CNN-LSTM dan Autoencoder-LSTM) untuk memprediksi parameter sistem tenaga surya pada data time-series statis.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi parameter sistem pembangkit surya dalam rangka mendukung efisiensi energi dan pengelolaan beban di smart grid.",
    "tantangan": "Mengolah data energi yang kompleks dan fluktuatif, serta memilih arsitektur model yang optimal untuk prediksi parameter dengan noise minimal.",
    "hasil_akhir": "Model yang diusulkan terbukti meningkatkan performa prediktif untuk sistem tenaga surya dan telah disitasi 23 kali sejak 2024, menunjukkan efektivitasnya dalam aplikasi smart energy berbasis AI."
  },

  {
    "judul": "An ensemble deep learning model for cyber threat hunting in industrial internet of things",
    "publisher": "Elsevier",
    "author": ["Yazdinejad, A", "Kazemi, M", "Parizi, RM"],
    "tahun": 2023,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2352864822001833",
    "rumusan_masalah": "Bagaimana membangun model deep learning ansambel yang efektif untuk mendeteksi ancaman siber dalam Industrial Internet of Things (IIoT)?",
    "penelitian_terkini": "Penelitian ini menggunakan model LSTM autoencoder sebagai bagian dari sistem ansambel untuk mendeteksi aktivitas anomali dan ancaman siber pada lingkungan IIoT secara lebih akurat.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan deteksi dini terhadap serangan siber yang menargetkan sistem industri terhubung melalui pendekatan pembelajaran mendalam berbasis LSTM-AE.",
    "tantangan": "Kompleksitas dan keragaman lalu lintas data IIoT, serta tuntutan deteksi real-time dengan tingkat false positive yang rendah.",
    "hasil_akhir": "Model deep learning ansambel berbasis LSTM autoencoder terbukti sangat efektif dan telah disitasi sebanyak 166 kali sejak 2023, menunjukkan dampak besar dalam bidang keamanan siber untuk sistem industri terhubung."
  },

  {
    "judul": "An efficient heuristic-aided adaptive autoencoder-based dilated DNN with attention mechanism for enhancing the performance of the MIMO system in 5G",
    "publisher": "Springer",
    "author": ["Jeyapal, R", "Matrouk, K", "Purushothaman, D"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/article/10.1007/s00530-024-01305-z",
    "rumusan_masalah": "Bagaimana meningkatkan performa sistem MIMO dalam jaringan 5G dengan menggunakan pendekatan autoencoder adaptif dan deep neural network yang dilengkapi attention mechanism?",
    "penelitian_terkini": "Artikel ini memperkenalkan model autoencoder adaptif yang digabung dengan dilated DNN dan mekanisme attention serta dibantu oleh heuristic learning untuk menangani tantangan propagasi multipath dalam komunikasi 5G.",
    "hasil_yang_diharapkan": "Memperkuat efisiensi transmisi sinyal dan ketahanan komunikasi dalam lingkungan MIMO 5G yang padat serta kompleks.",
    "tantangan": "Mengatasi gangguan multipath dan menjaga efisiensi serta latency rendah dalam sistem komunikasi 5G berbasis MIMO yang memiliki lalu lintas data tinggi.",
    "hasil_akhir": "Model yang diusulkan menunjukkan performa yang lebih baik dalam mitigasi gangguan dan efisiensi transmisi sinyal, serta telah disitasi 4 kali sejak 2024, menunjukkan potensi awal yang menjanjikan dalam penerapan nyata sistem 5G berbasis AI."
  },

  {
    "judul": "Fault detection and classification in power grids using Shannon entropy with convolution distributed autoencoder",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Veeramachaneni, V", "Husain, SO"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10872059/",
    "rumusan_masalah": "Bagaimana mendeteksi dan mengklasifikasikan gangguan pada jaringan listrik secara akurat menggunakan pendekatan Shannon entropy dan convolutional distributed autoencoder?",
    "penelitian_terkini": "Studi ini mengintegrasikan fitur Shannon entropy dengan autoencoder terdistribusi berbasis CNN untuk meningkatkan akurasi deteksi dan klasifikasi gangguan pada sistem grid listrik.",
    "hasil_yang_diharapkan": "Meningkatkan keandalan sistem tenaga dengan mendeteksi gangguan secara lebih cepat dan akurat dalam skenario operasional nyata.",
    "tantangan": "Kesulitan RNN dalam menangani urutan data yang panjang serta kebutuhan untuk mempertahankan akurasi tinggi dalam klasifikasi gangguan multi-kelas.",
    "hasil_akhir": "Model Shannon entropy + CNN autoencoder berhasil mendeteksi dan mengklasifikasikan gangguan secara efektif, serta telah disitasi 24 kali sejak 2024, membuktikan efektivitasnya di domain energi pintar berbasis AI."
  },

  {
    "judul": "Transformer masked autoencoders for next-generation wireless communications: Architecture and opportunities",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Zayat, A", "Hasabelnaby, MA", "Obeed, M"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10316537/",
    "rumusan_masalah": "Bagaimana arsitektur Transformer Masked Autoencoders (TMAE) dapat dimanfaatkan dalam pengembangan sistem komunikasi nirkabel generasi mendatang?",
    "penelitian_terkini": "Artikel ini memperkenalkan konsep Transformer Masked Autoencoder (TMAE), yang menggabungkan kekuatan transformer dengan autoencoder dalam konteks komunikasi nirkabel untuk meningkatkan efisiensi pemrosesan sinyal dan ekstraksi fitur.",
    "hasil_yang_diharapkan": "Meningkatkan performa sistem komunikasi generasi baru melalui arsitektur deep learning yang lebih efisien dan representatif dibandingkan model DNN klasik.",
    "tantangan": "Mengintegrasikan struktur transformer dengan mekanisme masking pada autoencoder secara optimal dalam sistem komunikasi yang memiliki latensi rendah dan throughput tinggi.",
    "hasil_akhir": "TMAE dinilai menjanjikan untuk diterapkan dalam sistem komunikasi masa depan, dan telah disitasi 9 kali sejak 2023, mencerminkan minat awal yang cukup besar dalam komunitas riset komunikasi AI."
  },

  {
    "judul": "Starnet: An efficient spatiotemporal feature sharing reconstructing network for automatic modulation classification",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Zhang, X", "Wang, Z", "Wang, X", "Luo, T"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10536059/",
    "rumusan_masalah": "Bagaimana meningkatkan klasifikasi modulasi otomatis (AMC) dengan efisiensi tinggi menggunakan pendekatan spatiotemporal dalam arsitektur autoencoder?",
    "penelitian_terkini": "Penelitian ini memperkenalkan model StarNet, yang mengombinasikan autoencoder dan LSTM autoencoder dengan teknik berbagi fitur spatiotemporal untuk rekonstruksi sinyal pada tugas klasifikasi modulasi otomatis.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan efisiensi klasifikasi modulasi dalam sistem komunikasi dengan mempertahankan representasi spasial dan temporal secara optimal.",
    "tantangan": "Model LSTM AE cenderung mengabaikan informasi spasial, dan penambahan layer konvolusional meningkatkan kompleksitas jaringan secara signifikan.",
    "hasil_akhir": "Model StarNet berhasil menunjukkan efisiensi tinggi dalam klasifikasi modulasi otomatis, serta telah disitasi sebanyak 5 kali sejak tahun 2024, menunjukkan potensi awal dalam penerapan sistem komunikasi modern berbasis AI."
  },

  {
    "judul": "Deep autoencoder-based integrated model for anomaly detection and efficient feature extraction in IoT networks",
    "publisher": "mdpi.com",
    "author": ["Alaghbari, KA", "Lim, HS", "Saad, MHM", "Yong, YS"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/2624-831X/4/3/16",
    "rumusan_masalah": "Bagaimana mengembangkan model deep learning berbasis autoencoder untuk deteksi anomali dan ekstraksi fitur secara efisien pada jaringan IoT yang menggunakan protokol MQTT?",
    "penelitian_terkini": "Studi ini mengusulkan model deep autoencoder yang terintegrasi untuk melakukan deteksi anomali sekaligus ekstraksi fitur dari data IoT, menggunakan dataset MQTTset yang mencakup data normal dan serangan.",
    "hasil_yang_diharapkan": "Meningkatkan keamanan dan efisiensi komunikasi dalam jaringan IoT melalui sistem deteksi anomali berbasis pembelajaran mendalam yang ringan dan cepat.",
    "tantangan": "Menangani volume data besar dan variatif pada IoT, serta membedakan anomali dari noise atau variasi alami dalam trafik jaringan.",
    "hasil_akhir": "Model terbukti efektif dalam mendeteksi anomali dan mengekstraksi fitur penting dari data IoT, serta telah disitasi sebanyak 32 kali sejak 2023, menandakan kontribusi signifikan dalam bidang keamanan IoT berbasis AI."
  },

  {
    "judul": "Combining network data analytics function and machine learning for abnormal traffic detection in beyond 5G",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Mekrache, A", "Boutiba, K"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10436766/",
    "rumusan_masalah": "Bagaimana memanfaatkan kombinasi fungsi analitik data jaringan (NWDAF) dan pembelajaran mesin untuk mendeteksi lalu lintas abnormal dalam jaringan Beyond 5G?",
    "penelitian_terkini": "Makalah ini mengusulkan penggunaan LSTM autoencoder yang digabung dengan NWDAF untuk deteksi lalu lintas abnormal, memanfaatkan rekonstruksi input data untuk mengenali penyimpangan dari pola normal.",
    "hasil_yang_diharapkan": "Mendeteksi secara real-time lalu lintas abnormal dalam jaringan Beyond 5G guna meningkatkan keamanan dan efisiensi jaringan.",
    "tantangan": "Mengidentifikasi anomali secara akurat dalam data lalu lintas jaringan yang sangat kompleks dan dinamis, tanpa menghasilkan terlalu banyak false positives.",
    "hasil_akhir": "Model LSTM autoencoder yang diintegrasikan dengan analitik data jaringan terbukti efektif dalam deteksi lalu lintas abnormal, dan telah disitasi 19 kali sejak 2023, menunjukkan penerimaan yang baik di komunitas riset jaringan generasi berikutnya."
  },

  {
    "judul": "LSTM-autoencoder based anomaly detection using vibration data of wind turbines",
    "publisher": "mdpi.com",
    "author": ["Lee, Y", "Park, C", "Kim, N", "Ahn, J", "Jeong, J"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/1424-8220/24/9/2833",
    "rumusan_masalah": "Bagaimana menggunakan model LSTM-autoencoder untuk mendeteksi anomali secara efektif dari data getaran turbin angin secara tak terawasi?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan unsupervised learning berbasis LSTM-autoencoder untuk menganalisis data getaran dan mendeteksi pola anomali pada turbin angin.",
    "hasil_yang_diharapkan": "Mengidentifikasi potensi kerusakan atau kegagalan mekanis secara dini pada sistem turbin angin melalui deteksi pola getaran yang tidak biasa.",
    "tantangan": "Membedakan anomali aktual dari fluktuasi normal dalam sinyal getaran serta menangani kompleksitas temporal dari data turbin angin.",
    "hasil_akhir": "Model LSTM-autoencoder menunjukkan kinerja efektif dalam mendeteksi anomali, dan telah disitasi sebanyak 19 kali sejak 2024, menunjukkan kontribusi signifikan dalam pemeliharaan prediktif energi terbarukan."
  },

  {
    "judul": "A deep learning technique for intrusion detection system using a Recurrent Neural Networks based framework",
    "publisher": "Elsevier",
    "author": ["Kasongo, SM"],
    "tahun": 2023,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0140366422004601",
    "rumusan_masalah": "Bagaimana merancang sistem deteksi intrusi (IDS) yang andal dan akurat menggunakan kerangka kerja deep learning berbasis RNN (LSTM, GRU, dan Simple RNN)?",
    "penelitian_terkini": "Makalah ini mengkaji dan membandingkan performa berbagai arsitektur RNN pada dataset NSL-KDD. Pendekatan terbaik adalah XGBoost-LSTM yang menunjukkan performa superior dalam deteksi serangan jaringan.",
    "hasil_yang_diharapkan": "Mengembangkan sistem IDS berbasis pembelajaran mendalam yang mampu mendeteksi serangan siber secara real-time dan efisien dengan tingkat akurasi tinggi.",
    "tantangan": "Menangani ketidakseimbangan data, overfitting, dan pemrosesan sekuensial yang rumit dalam sistem IDS berbasis deep learning.",
    "hasil_akhir": "Model XGBoost-LSTM mencapai performa terbaik dalam pengujian dan secara signifikan meningkatkan kemampuan deteksi intrusi. Artikel ini telah disitasi sebanyak 303 kali sejak 2023, menunjukkan dampak besar dalam bidang keamanan siber berbasis AI."
  },

  {
    "judul": "A robust multi-stage intrusion detection system for in-vehicle network security using hierarchical federated learning",
    "publisher": "Elsevier",
    "author": ["Althunayyan, M", "Javed, A", "Rana, O"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2214209624001128",
    "rumusan_masalah": "Bagaimana membangun sistem deteksi intrusi multi-tahap yang kuat untuk keamanan jaringan kendaraan menggunakan pendekatan federated learning secara hierarkis?",
    "penelitian_terkini": "Makalah ini mengusulkan IDS multi-tahap yang memanfaatkan ANN untuk mendeteksi serangan yang telah dikenal dan LSTM-autoencoder untuk mengidentifikasi serangan baru atau tak dikenal dalam jaringan kendaraan.",
    "hasil_yang_diharapkan": "Meningkatkan keamanan siber pada jaringan kendaraan dengan mendeteksi berbagai tipe serangan secara terdistribusi dan efisien, tanpa perlu berbagi data mentah.",
    "tantangan": "Melindungi jaringan kendaraan dari serangan kompleks tanpa melanggar privasi data antar node kendaraan dan menghindari overhead komputasi yang tinggi.",
    "hasil_akhir": "Sistem IDS hierarkis berbasis federated learning terbukti efektif dalam mendeteksi baik serangan yang dikenal maupun yang tidak dikenal, dengan 12 sitasi sejak 2024, menunjukkan penerimaan awal yang menjanjikan dalam komunitas penelitian keamanan kendaraan."
  },

  {
    "judul": "Reconstruction-based LSTM-Autoencoder for Anomaly-Based DDoS Attack Detection over Multivariate Time-Series Data",
    "publisher": "arxiv.org",
    "author": ["Wei, Y", "Jang-Jaccard, J", "Sabrina, F", "Xu, W"],
    "tahun": 2023,
    "sumber_data": "https://arxiv.org/abs/2305.09475",
    "rumusan_masalah": "Bagaimana mendeteksi serangan DDoS berbasis anomali dengan efektif menggunakan pendekatan rekonstruksi berbasis LSTM-autoencoder pada data multivariate time-series?",
    "penelitian_terkini": "Penelitian ini mengusulkan model LSTM-Autoencoder yang memanfaatkan kemampuan LSTM untuk menangkap korelasi jangka panjang dari data deret waktu dan autoencoder untuk mendeteksi anomali melalui error rekonstruksi.",
    "hasil_yang_diharapkan": "Mendeteksi pola serangan DDoS secara dini dan akurat dalam jaringan berbasis data multivariat dengan pendekatan tanpa pengawasan.",
    "tantangan": "Mengelola kompleksitas data time-series multivariat dan memastikan sistem deteksi bekerja baik untuk data yang tidak terlihat sebelumnya.",
    "hasil_akhir": "Model yang dikembangkan berhasil mendeteksi anomali dengan akurasi tinggi. Artikel ini telah disitasi sebanyak 14 kali sejak 2023, menandakan kontribusinya dalam sistem pertahanan siber berbasis deep learning."
  },

  {
    "judul": "Covert Fault Detection with Imbalanced Data Using an Improved Autoencoder for Optical Networks",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Zhang, C", "Zhang, M", "Liu, S", "Liu, Z"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10303733/",
    "rumusan_masalah": "Bagaimana mendeteksi kesalahan tersembunyi dalam jaringan optik yang datanya tidak seimbang menggunakan autoencoder yang ditingkatkan?",
    "penelitian_terkini": "Penelitian ini memperkenalkan arsitektur autoencoder berbasis LSTM yang ditingkatkan dengan struktur rekursif untuk meningkatkan akurasi rekonstruksi input pada data jaringan optik yang tidak seimbang.",
    "hasil_yang_diharapkan": "Mengembangkan model deteksi kesalahan tersembunyi yang mampu bekerja secara efektif meskipun data bersifat tidak seimbang dan kompleks.",
    "tantangan": "Keseimbangan data yang buruk dalam jaringan optik mengganggu performa model deteksi tradisional serta sulitnya mendeteksi gangguan non-linier yang samar.",
    "hasil_akhir": "Model autoencoder berbasis LSTM yang diusulkan menunjukkan performa yang lebih baik dalam mendeteksi fault tersembunyi dan telah disitasi sebanyak 5 kali sejak 2023, mencerminkan relevansi awal dalam penelitian jaringan optik."
  },

  {
    "judul": "Anomaly Detection in Groundwater Monitoring Data Using LSTM-Autoencoder Neural Networks",
    "publisher": "Springer",
    "author": ["Roukerd, F Rezaiezadeh", "Rajabi, MM"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/article/10.1007/s10661-024-12848-z",
    "rumusan_masalah": "Bagaimana mendeteksi anomali pada data pemantauan air tanah secara akurat menggunakan model neural network berbasis LSTM-Autoencoder?",
    "penelitian_terkini": "Penelitian ini mengintegrasikan LSTM-Autoencoder dengan simulasi Monte Carlo untuk meningkatkan efektivitas deteksi anomali dalam sistem monitoring lingkungan, khususnya air tanah.",
    "hasil_yang_diharapkan": "Meningkatkan keakuratan deteksi perubahan atau anomali tak terduga pada sistem air tanah guna mendukung pengambilan keputusan dalam pengelolaan sumber daya alam.",
    "tantangan": "Menghadapi variabilitas alami data lingkungan dan ketidakteraturan temporal yang membuat deteksi anomali menjadi kompleks dan berisiko tinggi jika tidak akurat.",
    "hasil_akhir": "Model yang diusulkan berhasil mendeteksi anomali dalam data pemantauan air tanah dan telah disitasi 8 kali sejak 2024, menunjukkan efektivitas pendekatan dalam konteks lingkungan."
  },

  {
    "judul": "Deep Autoencoder Neural Networks: A Comprehensive Review and New Perspectives",
    "publisher": "Springer",
    "author": ["Mienye, ID", "Swart, TG"],
    "tahun": 2025,
    "sumber_data": "https://link.springer.com/article/10.1007/s11831-025-10260-5",
    "rumusan_masalah": "Bagaimana perkembangan, tantangan, dan arah masa depan dari penerapan deep autoencoder neural networks dalam berbagai domain teknik komputasi?",
    "penelitian_terkini": "Artikel ini menyajikan ulasan komprehensif mengenai jaringan neural autoencoder, termasuk variasi seperti LSTM dan GRU, dan solusi terhadap masalah teknis seperti vanishing gradient.",
    "hasil_yang_diharapkan": "Memberikan pemahaman mendalam tentang struktur dan manfaat autoencoder dalam konteks teknik komputasi serta membuka jalan untuk penelitian lanjutan.",
    "tantangan": "Masalah vanishing gradient pada RNN dan kebutuhan akan arsitektur yang lebih stabil dan efisien seperti LSTM dan GRU.",
    "hasil_akhir": "Artikel ini diterima baik dengan 6 sitasi sejak tahun 2025 dan menjadi referensi penting untuk riset lanjutan dalam pengembangan arsitektur deep learning."
  },

  {
    "judul": "An Autoencoder-Based Multi-Task Learning for Intrusion Detection in IoT Networks",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Dong, H", "Kotenko, I"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10158807/",
    "rumusan_masalah": "Bagaimana mendeteksi intrusi jaringan pada IoT secara akurat dan fleksibel menggunakan pendekatan pembelajaran multi-tugas berbasis autoencoder?",
    "penelitian_terkini": "Mengusulkan model multi-task learning (MTL) yang berbasis autoencoder, membandingkan dengan pendekatan sebelumnya seperti LSTM dan Adversarial Network (AN).",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan efisiensi dalam mendeteksi berbagai jenis intrusi pada jaringan IoT menggunakan model yang mampu melakukan beberapa tugas secara bersamaan.",
    "tantangan": "Kompleksitas arsitektur pembelajaran multi-tugas dan tantangan dalam menggabungkan beberapa fungsi deteksi dalam satu sistem autoencoder.",
    "hasil_akhir": "Model ini berhasil diterapkan dan mendapatkan 9 sitasi sejak 2023, menandakan kontribusinya yang signifikan dalam riset IDS berbasis deep learning untuk IoT."
  },

  {
    "judul": "Network Intrusion Detection System Based on an Adversarial Auto-Encoder with Few Labeled Training Samples",
    "publisher": "Springer",
    "author": ["Shiomoto, K"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s10922-022-09698-w",
    "rumusan_masalah": "Bagaimana merancang sistem deteksi intrusi jaringan (IDS) yang efektif dengan jumlah data label yang sangat terbatas?",
    "penelitian_terkini": "Penulis mengembangkan sistem IDS berbasis adversarial autoencoder yang dikombinasikan dengan LSTM autoencoder dan One-Class SVM, hanya menggunakan data normal dalam pelatihan.",
    "hasil_yang_diharapkan": "Menghasilkan sistem IDS yang mampu mendeteksi serangan jaringan secara efisien meskipun hanya dilatih dengan sedikit data berlabel.",
    "tantangan": "Keterbatasan data berlabel dan kebutuhan untuk mendeteksi intrusi baru atau tidak dikenal dengan presisi tinggi.",
    "hasil_akhir": "Pendekatan ini menunjukkan efektivitas tinggi dalam mengklasifikasikan serangan jaringan dan telah mendapatkan 16 sitasi sejak tahun 2023."
  },

  {
    "judul": "GAF-MAE: A Self-Supervised Automatic Modulation Classification Method Based on Gramian Angular Field and Masked Autoencoder",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Shi, Y", "Xu, H", "Zhang, Y", "Qi, Z"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10261289/",
    "rumusan_masalah": "Bagaimana mengembangkan metode klasifikasi modulasi otomatis (AMC) berbasis self-supervised learning dengan efisiensi dan akurasi tinggi tanpa label besar?",
    "penelitian_terkini": "Artikel ini mengusulkan GAF-MAE, metode klasifikasi otomatis modulasi berbasis Gramian Angular Field dan Masked Autoencoder yang tidak membutuhkan data berlabel dalam pelatihan.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi klasifikasi modulasi otomatis dalam kondisi noise tinggi dan dengan jumlah data label minimal.",
    "tantangan": "Mengklasifikasikan sinyal modulasi secara akurat dalam kondisi sinyal yang kompleks dan terbatasnya data berlabel.",
    "hasil_akhir": "Metode ini menunjukkan kinerja superior dibandingkan pendekatan sebelumnya dan telah disitasi 19 kali sejak tahun 2023."
  },

  {
    "judul": "Anomaly Detection in Network Traffic Using Deep Learning",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Sharma, K", "Chaudhary, M", "Yadav, K"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10419951/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam lalu lintas jaringan menggunakan model deep learning seperti Autoencoder dan LSTM-Autoencoder?",
    "penelitian_terkini": "Artikel ini mengusulkan pendekatan berbasis deep learning, khususnya Autoencoder dan LSTM-AE, untuk mendeteksi anomali dalam komunikasi jaringan.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi anomali dan mempercepat proses identifikasi serangan pada lalu lintas jaringan.",
    "tantangan": "Menyesuaikan arsitektur deep learning agar optimal untuk berbagai jenis data jaringan dan pola anomali yang dinamis.",
    "hasil_akhir": "Model LSTM-AE yang diusulkan menunjukkan hasil menjanjikan dalam mendeteksi anomali dan telah disitasi sebanyak 8 kali sejak 2023."
  },

  {
    "judul": "A Novel Two-Stage Deep Learning Model for Network Intrusion Detection: LSTM-AE",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Hnamte, V", "Nhung-Nguyen, H", "Hussain, J"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10101759/",
    "rumusan_masalah": "Bagaimana merancang model deep learning dua tahap yang efektif untuk mendeteksi intrusi dalam jaringan komunikasi?",
    "penelitian_terkini": "Mengembangkan sistem deteksi intrusi (IDS) berbasis deep learning yang menggabungkan Autoencoder dan LSTM dalam arsitektur dua tahap.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi anomali dan menurunkan tingkat kesalahan dalam sistem komunikasi berbasis ICT.",
    "tantangan": "Mengatasi kompleksitas struktur jaringan dan menangani volume data besar dalam mendeteksi ancaman yang tersembunyi.",
    "hasil_akhir": "Model LSTM-AE dua tahap yang diusulkan terbukti sangat efektif dan telah disitasi sebanyak 126 kali sejak 2023, menandakan kontribusi signifikan dalam riset IDS."
  },

  {
    "judul": "Network Intrusion Detection System for DDoS Attacks in ICS Using Deep Autoencoders",
    "publisher": "Springer",
    "author": ["Ortega-Fernandez, I", "Sestelo, M", "Burguillo, JC"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/article/10.1007/s11276-022-03214-3",
    "rumusan_masalah": "Bagaimana membangun sistem deteksi intrusi yang efektif terhadap serangan DDoS di sistem kontrol industri (ICS) menggunakan pendekatan deep autoencoder?",
    "penelitian_terkini": "Penggunaan autoencoder mendalam, khususnya LSTM Autoencoder, untuk mengenali pola komunikasi dalam jaringan ICS dan mendeteksi anomali berupa serangan DDoS.",
    "hasil_yang_diharapkan": "Sistem IDS yang mampu secara efektif membedakan antara lalu lintas normal dan lalu lintas yang mencurigakan dalam sistem kontrol industri.",
    "tantangan": "Menangani kompleksitas data ICS dan mempelajari pola komunikasi yang kompleks serta berulang untuk mendeteksi anomali secara akurat.",
    "hasil_akhir": "Model LSTM Autoencoder terbukti efektif dalam mendeteksi serangan DDoS pada ICS dan telah mendapat 62 sitasi sejak tahun 2024, menunjukkan relevansi dan validitasnya."
  },

  {
    "judul": "Ransomware Detection Using Stacked Autoencoder for Feature Selection",
    "publisher": "arxiv.org",
    "author": ["Nkongolo, M", "Tokmak, M"],
    "tahun": 2024,
    "sumber_data": "https://arxiv.org/abs/2402.11342",
    "rumusan_masalah": "Bagaimana menggunakan stacked autoencoder secara efektif untuk seleksi fitur dalam mendeteksi ransomware?",
    "penelitian_terkini": "Pendekatan modifikasi LSTM-autoencoder digunakan untuk seleksi fitur dan deteksi anomali, termasuk penggabungan metode one-class classification.",
    "hasil_yang_diharapkan": "Sistem deteksi ransomware yang dapat mengenali pola anomali secara lebih efisien dengan representasi fitur yang optimal.",
    "tantangan": "Menghadapi kompleksitas dalam pemilihan fitur dan efisiensi deteksi anomali dengan jumlah data pelatihan yang terbatas.",
    "hasil_akhir": "Pendekatan stacked autoencoder berhasil meningkatkan deteksi ransomware dan telah disitasi sebanyak 14 kali sejak 2024, menunjukkan potensi kontribusi penting pada keamanan siber."
  },

  {
    "judul": "Autoencoder via DCNN and LSTM Models for Intrusion Detection in Industrial Control Systems of Critical Infrastructures",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Saheed, YK", "Misra, S"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10189137/",
    "rumusan_masalah": "Bagaimana merancang sistem deteksi intrusi yang efektif untuk sistem kontrol industri (ICS) menggunakan kombinasi model deep learning?",
    "penelitian_terkini": "Mengembangkan autoencoder hybrid yang menggabungkan DCNN dan LSTM untuk mengenali komunikasi ICS yang normal dan mendeteksi anomali atau intrusi.",
    "hasil_yang_diharapkan": "Meningkatkan deteksi intrusi dalam jaringan sistem kontrol industri dengan akurasi tinggi dan rendahnya false positive rate.",
    "tantangan": "Kompleksitas komunikasi dalam ICS dan kebutuhan model yang mampu belajar pola komunikasi normal secara efektif.",
    "hasil_akhir": "Model autoencoder hybrid yang dilatih pada dataset ICS dan jaringan pipa gas menunjukkan performa yang baik, dan telah dikutip 15 kali sejak tahun 2023."
  },

  {
    "judul": "Time-series Anomaly Detection in Automated Vehicles Using D-CNN-LSTM Autoencoder",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Khanmohammadi, F", "Azmi, R"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10480743/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam data deret waktu (time-series) kendaraan otomatis secara efisien?",
    "penelitian_terkini": "Pengembangan metode deteksi anomali menggunakan arsitektur hybrid D-CNN-LSTM Autoencoder untuk mengidentifikasi pola data abnormal dari kendaraan otomatis.",
    "hasil_yang_diharapkan": "Sistem deteksi anomali yang mampu menangani kompleksitas data kendaraan otomatis secara efisien dengan akurasi tinggi.",
    "tantangan": "Menangani kerumitan data sekuensial pada kendaraan otomatis dan menggabungkan berbagai jenis jaringan saraf dalam satu model.",
    "hasil_akhir": "Model D-CNN-LSTM Autoencoder terbukti efektif untuk deteksi anomali pada kendaraan otomatis dan telah mendapat 12 sitasi sejak tahun 2024."
  },

  {
    "judul": "Intrusion detection method based on stacked sparse autoencoder and sliced GRU for connected healthcare systems",
    "publisher": "Springer",
    "author": ["Gu, Z", "Wang, L", "Li, J", "Wen, M", "Liu, Y"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s13369-022-07079-8",
    "rumusan_masalah": "Bagaimana merancang metode deteksi intrusi yang efisien dan aman untuk sistem kesehatan terhubung berbasis jaringan?",
    "penelitian_terkini": "Mengembangkan sistem IDS menggunakan stacked sparse autoencoder (SAE) dan sliced GRU untuk mendeteksi intrusi dalam komunikasi sistem kesehatan berbasis internet.",
    "hasil_yang_diharapkan": "Deteksi intrusi yang lebih akurat dan ringan untuk sistem kesehatan yang terhubung dengan keamanan komunikasi data yang lebih baik.",
    "tantangan": "Menghadapi tantangan dalam efisiensi komputasi, keamanan data pasien, dan keragaman serangan siber pada sistem kesehatan modern.",
    "hasil_akhir": "Model gabungan SAE dan GRU menunjukkan performa deteksi intrusi yang efektif dan telah mendapatkan 7 sitasi sejak 2023."
  },

  {
    "judul": "A novel channel estimation framework in MIMO using serial cascaded multiscale autoencoder and attention LSTM with hybrid heuristic algorithm",
    "publisher": "mdpi.com",
    "author": ["Manasa, BMR", "Pakala, V", "Chinthaginjala, R", "Ayadi, M"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/1424-8220/23/22/9154",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi estimasi kanal dalam sistem MIMO dengan pendekatan berbasis deep learning dan algoritma hibrida?",
    "penelitian_terkini": "Mengusulkan framework baru yang menggabungkan multiscale autoencoder, attention-based LSTM, dan algoritma heuristik hibrida untuk estimasi kanal dalam jaringan MIMO.",
    "hasil_yang_diharapkan": "Estimasi kanal yang lebih akurat dan efisien dalam konsumsi energi pada komunikasi nirkabel jarak jauh berbasis MIMO.",
    "tantangan": "Menjaga akurasi tinggi sambil mengurangi konsumsi energi dan beban komputasi dalam estimasi kanal untuk komunikasi jangka panjang.",
    "hasil_akhir": "Framework yang diusulkan menunjukkan hasil yang menjanjikan dan telah disitasi sebanyak 6 kali sejak 2023."
  },

  {
    "judul": "Unsupervised Spectrum Anomaly Detection With Distillation and Memory Enhanced Autoencoders",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Qi, P", "Jiang, T", "Xu, J", "He, J", "Zheng, S"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10589480/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali spektrum secara unsupervised dengan akurasi tinggi di lingkungan jaringan IoT?",
    "penelitian_terkini": "Mengembangkan model deteksi anomali spektrum berbasis autoencoder yang diperkuat dengan memori dan distilasi pengetahuan, menggunakan LSTM dan Adversarial Autoencoder (AAE).",
    "hasil_yang_diharapkan": "Mendeteksi anomali spektrum secara efisien tanpa data label dengan meningkatkan kapasitas generalisasi melalui distilasi dan modul memori.",
    "tantangan": "Mengatasi keterbatasan data label serta meningkatkan ketahanan dan ketepatan deteksi dalam spektrum dinamis dan kompleks.",
    "hasil_akhir": "Model yang diusulkan menunjukkan hasil awal yang menjanjikan dan telah disitasi 3 kali sejak 2024."
  },

  {
    "judul": "An adaptive temporal convolutional network autoencoder for malicious data detection in mobile crowd sensing",
    "publisher": "mdpi.com",
    "author": [
      "Owoh, N",
      "Riley, J",
      "Ashawa, M",
      "Hosseinzadeh, S",
      "Philip, A"
    ],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/1424-8220/24/7/2353",
    "rumusan_masalah": "Bagaimana mendeteksi data berbahaya dalam sistem mobile crowd sensing secara adaptif dan efisien?",
    "penelitian_terkini": "Menggunakan convolutional LSTM autoencoder untuk mendeteksi pola anomali pada data yang dikumpulkan dari jaringan rumah pintar.",
    "hasil_yang_diharapkan": "Autoencoder yang mampu belajar pola komunikasi normal dan mengenali data berbahaya secara efektif dalam sistem crowd sensing.",
    "tantangan": "Menangani data yang bersifat dinamis dan bervariasi dari pengguna serta membedakan data valid dari data jahat.",
    "hasil_akhir": "Model adaptif yang menunjukkan kinerja baik untuk deteksi data berbahaya, dengan 13 sitasi sejak 2024."
  },

  {
    "judul": "GNSS Anomaly Detection with Complex-Valued LSTM Networks",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Savolainen, O", "Elango, A", "Morrison, A"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10578405/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam sinyal GNSS menggunakan pendekatan deep learning berbasis LSTM?",
    "penelitian_terkini": "Menggunakan LSTM autoencoder kompleks (complex-valued) untuk mendeteksi anomali dalam data GNSS secara unsupervised.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan sensitivitas sistem deteksi anomali pada sistem navigasi berbasis GNSS.",
    "tantangan": "Kompleksitas data GNSS dan kebutuhan akan model yang mampu memahami representasi sinyal kompleks.",
    "hasil_akhir": "Model berhasil menunjukkan efektivitas pendekatan LSTM kompleks dalam mendeteksi anomali, dengan 3 sitasi sejak 2024."
  },

  {
    "judul": "Network traffic discrimination improvement in software defined network (SDN) with deep autoencoder and ensemble method",
    "publisher": "Springer",
    "author": ["Shirmarz, A", "Ghaffari, A"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s12652-022-03810-3",
    "rumusan_masalah": "Bagaimana meningkatkan kemampuan diskriminasi lalu lintas jaringan pada SDN menggunakan deep autoencoder dan metode ensemble?",
    "penelitian_terkini": "Menggunakan kombinasi Deep Autoencoder dengan metode ensemble dan arsitektur CNN, RNN, GRU, serta LSTM untuk meningkatkan akurasi klasifikasi lalu lintas jaringan.",
    "hasil_yang_diharapkan": "Meningkatkan efisiensi pengenalan dan klasifikasi jenis lalu lintas pada jaringan SDN untuk keperluan keamanan dan manajemen jaringan.",
    "tantangan": "Kompleksitas tinggi dalam lalu lintas jaringan SDN dan kebutuhan pengolahan data real-time dengan akurasi tinggi.",
    "hasil_akhir": "Pendekatan yang diajukan berhasil meningkatkan kemampuan diskriminasi jaringan dan telah disitasi sebanyak 14 kali sejak 2023."
  },

  {
    "judul": "An autoencoder-based feature level fusion for speech emotion recognition",
    "publisher": "Elsevier",
    "author": ["Shixin, P", "Kai, C", "Tian, T", "Jingying, C"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2352864822002279",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi pengenalan emosi dari ucapan dengan menggabungkan fitur audio menggunakan autoencoder?",
    "penelitian_terkini": "Menggunakan autoencoder untuk menyatukan berbagai fitur audio sebelum diklasifikasikan oleh jaringan BLSTM dan attention mechanism.",
    "hasil_yang_diharapkan": "Model yang mampu menggabungkan informasi multimodal untuk meningkatkan kinerja pengenalan emosi dalam sinyal ucapan.",
    "tantangan": "Mengelola fitur multimodal dengan redundansi tinggi serta mempertahankan informasi penting untuk klasifikasi emosi.",
    "hasil_akhir": "Pendekatan feature fusion berbasis autoencoder menunjukkan performa lebih baik dibanding metode unimodal dan telah disitasi 30 kali sejak 2024."
  },

  {
    "judul": "Multi-task learning for IoT traffic classification: a comparative analysis of deep autoencoders",
    "publisher": "Elsevier",
    "author": ["Dong, H", "Kotenko, I"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0167739X24001341",
    "rumusan_masalah": "Bagaimana menerapkan pembelajaran multi-tugas (multi-task learning) menggunakan deep autoencoder untuk klasifikasi lalu lintas IoT secara efisien?",
    "penelitian_terkini": "Dilakukan analisis komparatif antara CNN, DNN, dan LSTM untuk klasifikasi lalu lintas IoT berbasis deep learning.",
    "hasil_yang_diharapkan": "Mendapatkan arsitektur deep learning terbaik untuk klasifikasi lalu lintas IoT dengan kinerja dan generalisasi yang lebih baik.",
    "tantangan": "Mengelola kompleksitas data lalu lintas IoT yang sangat bervariasi dan volume tinggi, serta memastikan akurasi dalam pengklasifikasian.",
    "hasil_akhir": "LSTM dan deep autoencoder memberikan hasil lebih unggul dibanding model ML tradisional dan jaringan neural lainnya. Artikel ini telah disitasi 6 kali sejak 2024."
  },

  {
    "judul": "Link adaptation in underwater wireless optical communications based on deep learning",
    "publisher": "Elsevier",
    "author": ["Zhao, X", "Qi, Z", "Pompili, D"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S1389128624000653",
    "rumusan_masalah": "Bagaimana meningkatkan adaptasi link dalam komunikasi optik bawah laut menggunakan pendekatan deep learning?",
    "penelitian_terkini": "Mengembangkan metode adaptasi link berbasis RNN (SwitchOpt RNN) dan membandingkannya dengan CNN dan autoencoder dalam kondisi SNR rendah.",
    "hasil_yang_diharapkan": "Mencapai performa komunikasi optik bawah laut yang lebih stabil dan efisien di lingkungan dengan kualitas sinyal rendah.",
    "tantangan": "Variabilitas dan tantangan sinyal dalam media bawah laut seperti SNR rendah, gangguan optik, dan fluktuasi lingkungan.",
    "hasil_akhir": "SwitchOpt RNN mengungguli CNN dan autoencoder khususnya pada kondisi SNR rendah. Artikel ini telah disitasi 11 kali sejak 2024."
  },

  {
    "judul": "LSTM-Autoencoder Based Detection of Time-Series Noise Signals for Water Supply and Sewer Pipe Leakages",
    "publisher": "mdpi.com",
    "author": [
      "Shin, Y",
      "Na, KY",
      "Kim, SE",
      "Kyung, EJ",
      "Choi, HG",
      "Jeong, J"
    ],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/2073-4441/16/18/2631",
    "rumusan_masalah": "Bagaimana mendeteksi kebocoran pada sistem pipa air dan saluran pembuangan berdasarkan sinyal derau time-series menggunakan model LSTM-Autoencoder?",
    "penelitian_terkini": "Menggunakan model LSTM-Autoencoder untuk mendeteksi sinyal noise yang menunjukkan kebocoran pipa dan membandingkan dengan pendekatan lain seperti LSTM-capsule autoencoder.",
    "hasil_yang_diharapkan": "Model yang mampu mendeteksi sinyal anomali secara akurat dalam sistem distribusi air dan pembuangan.",
    "tantangan": "Memisahkan noise alami dari sinyal kebocoran yang valid dan memastikan akurasi deteksi dalam berbagai kondisi lingkungan.",
    "hasil_akhir": "Model LSTM-Autoencoder mencapai akurasi klasifikasi sebesar 96.79%, mengungguli metode sebelumnya. Artikel ini telah disitasi sebanyak 9 kali sejak tahun 2024."
  },

  {
    "judul": "Anomaly detection based on LSTM and autoencoders using federated learning in smart electric grid",
    "publisher": "Elsevier",
    "author": [
      "Shrestha, R",
      "Mohammadi, M",
      "Sinaei, S",
      "Salcines, A",
      "..."
    ],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0743731524001151",
    "rumusan_masalah": "Bagaimana menerapkan metode LSTM dan Autoencoder berbasis federated learning untuk mendeteksi anomali dalam sistem smart electric grid?",
    "penelitian_terkini": "Menggabungkan jaringan neural seperti LSTM dan autoencoder dalam kerangka federated learning untuk deteksi anomali secara terdistribusi di smart grid.",
    "hasil_yang_diharapkan": "Sistem deteksi anomali terdistribusi yang efisien dan dapat melindungi privasi data antar node dalam jaringan listrik pintar.",
    "tantangan": "Mengatasi masalah latensi dan sinkronisasi data antar node dalam federated learning serta menjaga akurasi deteksi anomali.",
    "hasil_akhir": "Model gabungan LSTM dan autoencoder dengan federated learning menunjukkan kinerja yang efisien dalam deteksi anomali pada smart grid. Artikel ini telah disitasi sebanyak 36 kali sejak tahun 2024."
  },

  {
    "judul": "An autoencoder-based I/Q channel interaction enhancement method for automatic modulation recognition",
    "publisher": "IEEE",
    "author": ["Zhang, F", "Luo, C", "Xu, J", "Luo, Y"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10052744/",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi pengenalan modulasi otomatis (AMR) dalam sistem komunikasi non-kooperatif dengan memanfaatkan interaksi saluran I/Q?",
    "penelitian_terkini": "Mengusulkan metode peningkatan interaksi saluran I/Q berbasis autoencoder untuk memperkuat fitur representasi sinyal dalam tugas AMR.",
    "hasil_yang_diharapkan": "Model autoencoder yang mampu belajar representasi sinyal yang lebih efektif dari data I/Q untuk meningkatkan performa klasifikasi modulasi secara otomatis.",
    "tantangan": "Menangani kompleksitas sinyal dalam lingkungan komunikasi non-kooperatif dan meningkatkan generalisasi model tanpa menambah kompleksitas jaringan secara signifikan.",
    "hasil_akhir": "Metode berbasis autoencoder menunjukkan performa lebih baik dari model tradisional, namun masih sedikit di bawah performa model berbasis RNN. Artikel ini telah disitasi sebanyak 23 kali sejak tahun 2023."
  },

  {
    "judul": "IDS-DEC: A novel intrusion detection for CAN bus traffic based on deep embedded clustering",
    "publisher": "Elsevier",
    "author": ["Shi, J", "Xie, Z", "Dong, L", "Jiang, X", "Jin, X"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2214209624001050",
    "rumusan_masalah": "Bagaimana merancang sistem deteksi intrusi yang efektif untuk lalu lintas CAN bus pada kendaraan menggunakan pendekatan pembelajaran mendalam?",
    "penelitian_terkini": "Mengusulkan sistem IDS-DEC yang menggabungkan deep embedded clustering dan model deep learning berbasis LSTM Convolutional Autoencoder dengan analisis entropi.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan deteksi intrusi terhadap lalu lintas CAN bus secara akurat tanpa memerlukan banyak data berlabel.",
    "tantangan": "Menangani data CAN bus yang tidak berlabel dan kompleksitas komunikasi kendaraan secara efisien dengan mempertahankan kinerja tinggi.",
    "hasil_akhir": "Model IDS-DEC menunjukkan performa deteksi yang kompetitif dan efisien, serta telah memperoleh 5 sitasi sejak dipublikasikan pada tahun 2024."
  },

  {
    "judul": "Anomaly detection based on 1D-CNN-LSTM auto-encoder for bearing data",
    "publisher": "WSEAS Trans. Inf. Sci. Appl",
    "author": ["Lee, D", "Choo, H", "Jeong, J"],
    "tahun": 2023,
    "sumber_data": "https://www.wseas.com/journals/isa/2023/a025109-001(2023).pdf",
    "rumusan_masalah": "Bagaimana mendeteksi anomali pada data bearing dengan akurasi tinggi menggunakan kombinasi 1D-CNN dan LSTM Autoencoder?",
    "penelitian_terkini": "Mengusulkan model deep learning gabungan 1D-CNN dan LSTM Autoencoder untuk menganalisis data bearing dari pengukuran aktual, khususnya mendeteksi kerusakan ringan (fine eccentric).",
    "hasil_yang_diharapkan": "Model dapat mengenali kerusakan bearing yang sulit dideteksi oleh metode tradisional, meningkatkan akurasi deteksi anomali.",
    "tantangan": "Kesulitan dalam mendeteksi anomali halus pada data bearing dan menangani noise dari data pengukuran nyata.",
    "hasil_akhir": "Model 1D-CNN-LSTM Autoencoder terbukti efektif dalam mendeteksi kerusakan bearing dan telah memperoleh 9 sitasi sejak dipublikasikan pada tahun 2023."
  },

  {
    "judul": "An LSTM-based outlier detection approach for IoT sensor data in hierarchical Edge Computing",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Bibi, S", "Titouna, C", "Titouna, F", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10271607/",
    "rumusan_masalah": "Bagaimana mendeteksi outlier (penyimpangan data) dalam data sensor IoT secara efisien dalam lingkungan edge computing yang bersifat hierarkis?",
    "penelitian_terkini": "Mengusulkan pendekatan deteksi outlier berbasis LSTM yang dioptimalkan untuk diterapkan dalam infrastruktur edge computing dengan data IoT yang masif dan bersifat sekuensial.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan efisiensi dalam mendeteksi outlier pada data sensor IoT tanpa memerlukan sumber daya komputasi tinggi.",
    "tantangan": "Menangani data dalam jumlah besar dengan keterbatasan sumber daya di perangkat edge serta menghindari false positive/negative dalam deteksi anomali.",
    "hasil_akhir": "Model LSTM-based berhasil diterapkan untuk mendeteksi outlier pada jaringan sensor nirkabel IoT dan telah memperoleh 4 sitasi sejak tahun 2023."
  },

  {
    "judul": "A DenseNet-based learning framework toward maritime end-to-end autoencoder communication systems",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Shao, S", "Lin, B", "Wu, N", "Han, X"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10233606/",
    "rumusan_masalah": "Bagaimana mengembangkan sistem komunikasi end-to-end berbasis autoencoder yang efisien untuk lingkungan maritim yang kompleks?",
    "penelitian_terkini": "Menggabungkan DenseNet dan LSTM dalam arsitektur autoencoder untuk membangun sistem komunikasi maritim end-to-end yang cerdas dan robust.",
    "hasil_yang_diharapkan": "Meningkatkan kinerja transmisi dan rekonstruksi sinyal komunikasi di lingkungan laut melalui pembelajaran mendalam berbasis DenseNet dan LSTM.",
    "tantangan": "Kompleksitas lingkungan komunikasi maritim dan kebutuhan akan representasi fitur yang efisien serta ketahanan terhadap noise.",
    "hasil_akhir": "Framework DenseNet-LSTM autoencoder menunjukkan kinerja yang menjanjikan dalam komunikasi end-to-end dan telah disitasi sebanyak 3 kali sejak 2023."
  },

  {
    "judul": "Digital twin-enhanced predictive maintenance for indoor climate: A parallel LSTM-autoencoder failure prediction approach",
    "publisher": "Elsevier",
    "author": ["Hu, W", "Wang, X", "Tan, K", "Cai, Y"],
    "tahun": 2023,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0378778823009684",
    "rumusan_masalah": "Bagaimana mengintegrasikan digital twin dan deep learning untuk meningkatkan prediksi kegagalan dalam sistem iklim dalam ruangan?",
    "penelitian_terkini": "Mengusulkan pendekatan prediksi kegagalan menggunakan kombinasi paralel LSTM dan autoencoder, yang didukung oleh kerangka kerja pemeliharaan prediktif berbasis digital twin (DT).",
    "hasil_yang_diharapkan": "Memberikan prediksi kerusakan yang lebih akurat dalam manajemen iklim dalam ruangan guna meningkatkan efisiensi dan kenyamanan energi bangunan.",
    "tantangan": "Kompleksitas penggabungan model digital twin dengan model pembelajaran mendalam serta keakuratan dalam memprediksi gangguan sistem iklim dalam ruangan.",
    "hasil_akhir": "Model LSTM-autoencoder paralel berbasis digital twin menunjukkan hasil yang valid dan telah disitasi sebanyak 20 kali sejak 2023."
  },

  {
    "judul": "Trust my IDS: An explainable AI integrated deep learning-based transparent threat detection system for industrial networks",
    "publisher": "Elsevier",
    "author": ["Shoukat, S", "Gao, T", "Javeed, D", "Saeed, MS", "Adil, M"],
    "tahun": 2025,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0167404824004966",
    "rumusan_masalah": "Bagaimana membangun sistem deteksi ancaman yang transparan, dapat dipercaya, dan dapat dijelaskan untuk jaringan industri?",
    "penelitian_terkini": "Menggabungkan Explainable AI dengan arsitektur Long Short-Term Memory Autoencoder (LSTM-AE) dalam deteksi ancaman multikelas pada jaringan Industrial Internet of Things (IIoT).",
    "hasil_yang_diharapkan": "Meningkatkan transparansi dan akurasi dalam sistem deteksi intrusi dengan memberikan penjelasan terhadap hasil klasifikasi ancaman.",
    "tantangan": "Mengembangkan sistem yang tidak hanya akurat tetapi juga dapat dijelaskan secara intuitif oleh pengguna non-teknis di lingkungan industri yang kompleks.",
    "hasil_akhir": "Sistem berbasis Explainable AI dan LSTM-AE berhasil memberikan deteksi ancaman multikelas yang andal dan telah disitasi sebanyak 12 kali sejak 2025."
  },

  {
    "judul": "Optimizing hyperparameters for enhanced email classification and forensic analysis with stacked autoencoders",
    "publisher": "International Journal of Network (via ResearchGate)",
    "author": ["Thomas, M", "Meshram, BB"],
    "tahun": 2024,
    "sumber_data": "https://www.researchgate.net/publication/378146762",
    "rumusan_masalah": "Bagaimana mengoptimalkan hyperparameter untuk meningkatkan klasifikasi email dan analisis forensik menggunakan stacked autoencoder?",
    "penelitian_terkini": "Mengkaji kombinasi algoritma deep learning seperti stacked autoencoder, GAN, RNN, CNN, dan Mayfly optimization untuk klasifikasi spam dan analisis forensik email.",
    "hasil_yang_diharapkan": "Memperoleh model klasifikasi email yang lebih akurat, efisien, dan andal dalam mengidentifikasi spam serta mendukung analisis forensik digital.",
    "tantangan": "Menemukan konfigurasi hyperparameter yang optimal untuk berbagai arsitektur dan menangani dinamika komunikasi spam yang berubah-ubah.",
    "hasil_akhir": "Model berbasis stacked autoencoder dengan optimisasi hyperparameter menunjukkan peningkatan performa klasifikasi dan telah disitasi 5 kali sejak 2024."
  },

  {
    "judul": "Autoencoder-K-Means Algorithm for Efficient Anomaly Detection to Improve Space Operations",
    "publisher": "IEEE",
    "author": ["Akbarian, H", "Mahgoub, I", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10577704/",
    "rumusan_masalah": "Bagaimana mengembangkan metode deteksi anomali yang efisien untuk meningkatkan keandalan operasi luar angkasa berdasarkan data telemetri?",
    "penelitian_terkini": "Menggabungkan autoencoder dengan algoritma K-Means, serta menggunakan model GAN berbasis CNN dan LSTM untuk menangkap fitur spasial dan temporal dari data telemetri luar angkasa.",
    "hasil_yang_diharapkan": "Mendeteksi anomali secara akurat dan efisien dalam data luar angkasa guna mendukung pengambilan keputusan dan meningkatkan keandalan misi.",
    "tantangan": "Menangani kompleksitas data spasial-temporal dan memastikan integrasi yang efektif antara autoencoder, clustering, dan jaringan adversarial.",
    "hasil_akhir": "Model gabungan Autoencoder-K-Means dengan CNN-LSTM-GAN menunjukkan efisiensi dalam deteksi anomali dan telah disitasi 1 kali sejak 2024."
  },

  {
    "judul": "LSTM-Autoencoder for Vibration Anomaly Detection in Vertical Carousel Storage and Retrieval System (VCSRS)",
    "publisher": "MDPI - Sensors",
    "author": ["Do, JS", "Kareem, AB", "Hur, JW"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/1424-8220/23/2/1009",
    "rumusan_masalah": "Bagaimana mendeteksi anomali getaran secara akurat dalam sistem penyimpanan dan pengambilan vertikal (VCSRS) menggunakan pendekatan deep learning?",
    "penelitian_terkini": "Menggunakan model LSTM-Autoencoder untuk menganalisis data getaran dan membandingkan performanya dengan model koefisien korelasi.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan pendeteksian dini terhadap kelainan getaran guna mencegah kerusakan mekanis dalam sistem VCSRS.",
    "tantangan": "Menghadapi variasi pola getaran dalam sistem dinamis dan memastikan model dapat mengenali anomali secara andal dalam data waktu nyata.",
    "hasil_akhir": "Model LSTM-Autoencoder menunjukkan hasil yang lebih baik dibandingkan model statistik tradisional dan telah mendapatkan 44 sitasi sejak 2023."
  },

  {
    "judul": "Semisupervised Anomaly Detection of Multivariate Time Series Based on a Variational Autoencoder",
    "publisher": "Springer - Applied Intelligence",
    "author": ["Chen, N", "Tu, H", "Duan, X", "Hu, L", "Guo, C"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s10489-022-03829-1",
    "rumusan_masalah": "Bagaimana mengembangkan metode pendeteksian anomali untuk data deret waktu multivariat dengan pendekatan semi-supervised yang efisien dan akurat?",
    "penelitian_terkini": "Mengusulkan model variational autoencoder (VAE) berbasis LSTM yang semi-supervised untuk mendeteksi anomali pada data deret waktu multivariat.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi anomali dengan memanfaatkan struktur VAE dan kemampuan LSTM dalam menangkap ketergantungan temporal.",
    "tantangan": "Mengintegrasikan pendekatan semi-supervised ke dalam arsitektur VAE yang dapat bekerja baik meski label terbatas dan data bersifat sekuensial.",
    "hasil_akhir": "Model LSTM-VAE menunjukkan kinerja unggul dibanding pendekatan baseline dan telah disitasi sebanyak 50 kali sejak tahun 2023."
  },

  {
    "judul": "Deep learning-based anomaly detection for connected autonomous vehicles using spatiotemporal information",
    "publisher": "IEEE Transactions",
    "author": ["Mansourian, P", "Zhang, N", "Jaekel, A", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10164214/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali secara efektif dalam kendaraan otonom yang saling terhubung menggunakan informasi spasial dan temporal?",
    "penelitian_terkini": "Mengusulkan pendekatan deep learning menggunakan LSTM Autoencoder yang dilatih untuk masing-masing sensor kendaraan guna menangkap pola anomali berdasarkan data spasial-temporal.",
    "hasil_yang_diharapkan": "Mampu secara akurat mengenali gangguan atau kelainan yang dapat terjadi dalam sistem komunikasi internal maupun eksternal kendaraan otonom.",
    "tantangan": "Mengintegrasikan dan menyelaraskan data spasial dan temporal dalam skala besar dengan arsitektur LSTM Autoencoder yang dapat menggeneralisasi berbagai skenario lalu lintas dan komunikasi kendaraan.",
    "hasil_akhir": "Model LSTM Autoencoder berhasil mendeteksi anomali secara efektif dan telah memperoleh 59 sitasi sejak 2023, menunjukkan pengaruhnya dalam komunitas penelitian."
  },

  {
    "judul": "Unsupervised outlier detection for time-series data of indoor air quality using LSTM autoencoder with ensemble method",
    "publisher": "Springer",
    "author": ["Park, J", "Seo, Y", "Cho, J"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1186/s40537-023-00746-z",
    "rumusan_masalah": "Bagaimana mendeteksi outlier (anomali) dalam data deret waktu kualitas udara dalam ruangan secara tak terawasi (unsupervised)?",
    "penelitian_terkini": "Mengembangkan kerangka deteksi outlier berbasis LSTM Autoencoder yang dikombinasikan dengan metode ensemble untuk mempelajari pola normal dalam data kualitas udara.",
    "hasil_yang_diharapkan": "Dapat secara akurat dan adaptif mendeteksi situasi abnormal atau tak terduga dalam kualitas udara ruangan tanpa pelabelan data sebelumnya.",
    "tantangan": "Menangani variasi temporal dan non-linearitas tinggi dalam data deret waktu, serta memastikan generalisasi deteksi outlier pada kondisi lingkungan yang berbeda.",
    "hasil_akhir": "Framework LSTM-AE dengan ensemble berhasil mendeteksi berbagai outlier dan telah dikutip 39 kali sejak 2023, menunjukkan efektivitas dan relevansinya."
  },

  {
    "judul": "Insider threat detection using supervised machine learning algorithms",
    "publisher": "Springer",
    "author": ["Manoharan, P", "Yin, J", "Wang, H", "Zhang, Y"],
    "tahun": 2024,
    "sumber_data": "https://link.springer.com/article/10.1007/s11235-023-01085-3",
    "rumusan_masalah": "Bagaimana mendeteksi ancaman dari dalam (insider threat) secara akurat menggunakan algoritma pembelajaran mesin terawasi?",
    "penelitian_terkini": "Menggabungkan berbagai model pembelajaran mesin termasuk LSTM, CNN, dan autoencoder untuk mendeteksi perilaku abnormal dari pengguna internal.",
    "hasil_yang_diharapkan": "Sistem dapat membedakan aktivitas normal dan mencurigakan dari pengguna untuk mendeteksi ancaman internal secara dini dan akurat.",
    "tantangan": "Kesulitan dalam membedakan perilaku abnormal dari perilaku sah, keterbatasan data ancaman internal yang berlabel, dan kebutuhan akan generalisasi model.",
    "hasil_akhir": "Model berbasis autoencoder dan deep learning terbukti efektif dalam mempelajari pola normal serta mengidentifikasi penyimpangan, dan telah memperoleh 23 sitasi sejak 2024."
  },

  {
    "judul": "Sensor Fault Detection and Classification Using Multi-Step-Ahead Prediction with an Long Short-Term Memory (LSTM) Autoencoder",
    "publisher": "mdpi.com",
    "author": ["Hasan, MN", "Jan, SU", "Koo, I"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/2076-3417/14/17/7717",
    "rumusan_masalah": "Bagaimana mendeteksi dan mengklasifikasikan kesalahan sensor secara dini menggunakan prediksi multi-langkah dengan model LSTM autoencoder?",
    "penelitian_terkini": "Menggunakan jaringan LSTM autoencoder untuk mempelajari pola sinyal sensor dan memprediksi beberapa langkah ke depan untuk mendeteksi penyimpangan.",
    "hasil_yang_diharapkan": "Model dapat mengidentifikasi anomali sensor secara akurat dan melakukan klasifikasi kesalahan secara real-time.",
    "tantangan": "Akurasi prediksi yang menurun pada horizon waktu yang panjang, serta kebutuhan pelatihan model yang tepat untuk berbagai jenis sensor.",
    "hasil_akhir": "Model LSTM autoencoder berhasil diterapkan untuk deteksi dan klasifikasi kesalahan sensor, dan telah mendapat 4 sitasi sejak 2024."
  },

  {
    "judul": "Anomaly detection using LSTM-based variational autoencoder in unsupervised data in power grid",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Guha, D", "Chatterjee, R", "Sikdar, B"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10109988/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam data tak berlabel dari jaringan listrik dengan menggunakan pendekatan unsupervised deep learning?",
    "penelitian_terkini": "Mengembangkan dan menerapkan model LSTM-based Variational Autoencoder (MVAE) untuk mendeteksi anomali dalam data power grid yang tidak berlabel.",
    "hasil_yang_diharapkan": "Model MVAE mampu membedakan data normal dan abnormal secara efisien, bahkan tanpa label pelatihan eksplisit.",
    "tantangan": "Menentukan distribusi laten yang tepat dalam struktur VAE yang dimodifikasi dan mengelola data power grid yang kompleks secara temporal.",
    "hasil_akhir": "Model LSTM-based MVAE berhasil diterapkan pada data jaringan listrik dan telah disitasi sebanyak 40 kali sejak tahun 2023."
  },

  {
    "judul": "Addag-ae: Anomaly detection in dynamic attributed graph based on graph attention network and LSTM autoencoder",
    "publisher": "mdpi.com",
    "author": ["Miao, G", "Wu, G", "Zhang, Z", "Tong, Y", "Lu, B"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/2079-9292/12/13/2763",
    "rumusan_masalah": "Bagaimana cara mendeteksi anomali dalam grafik dinamis beratribut menggunakan kombinasi Graph Attention Network (GAT) dan LSTM-Autoencoder?",
    "penelitian_terkini": "ADDAG-AE menggabungkan GAT dan LSTM-AE untuk merekonstruksi node dan atributnya, serta memprediksi perilaku anomali pada grafik dinamis.",
    "hasil_yang_diharapkan": "Sistem mampu secara akurat mendeteksi anomali pada data graf beratribut dengan menangkap baik fitur struktural maupun temporal.",
    "tantangan": "Mengintegrasikan informasi spasial dari GAT dan informasi temporal dari LSTM dalam grafik yang terus berubah.",
    "hasil_akhir": "ADDAG-AE menunjukkan performa yang menjanjikan dalam mendeteksi anomali pada data graf dinamis dan telah disitasi sebanyak 3 kali sejak 2023."
  },

  {
    "judul": "Autoencoder-LSTM Algorithm for Anomaly Detection",
    "publisher": "ieeexplore.ieee.org",
    "author": ["Akbarian, H", "Mahgoub, I", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10374710/",
    "rumusan_masalah": "Bagaimana meningkatkan kinerja deteksi anomali dengan menggabungkan Autoencoder dan LSTM dibandingkan metode DNN-LSTM tradisional?",
    "penelitian_terkini": "Makalah ini mengusulkan algoritma AE-LSTM untuk mendeteksi anomali dan membandingkannya dengan model benchmark DNN-LSTM.",
    "hasil_yang_diharapkan": "Model AE-LSTM dapat menghasilkan akurasi deteksi anomali yang lebih tinggi dengan efisiensi yang lebih baik dibandingkan metode deep learning konvensional.",
    "tantangan": "Menyesuaikan arsitektur Autoencoder dan LSTM agar mampu belajar pola anomali dari data sekuensial secara efektif.",
    "hasil_akhir": "Model AE-LSTM menunjukkan performa yang menjanjikan dalam deteksi anomali dan telah disitasi sebanyak 5 kali sejak 2023."
  },

  {
    "judul": "Prediction model of sparse autoencoder-based bidirectional LSTM for wastewater flow rate",
    "publisher": "Springer",
    "author": ["Huang, J", "Yang, S", "Li, J", "Oh, J", "Kang, H"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s11227-022-04827-3",
    "rumusan_masalah": "Bagaimana membangun model prediksi aliran limbah air yang akurat dengan menggabungkan Sparse Autoencoder dan Bidirectional LSTM?",
    "penelitian_terkini": "Penelitian ini menggabungkan Sparse Autoencoder (SAE) dan Bidirectional Long Short-Term Memory (BLSTM) untuk memodelkan prediksi tingkat aliran limbah air.",
    "hasil_yang_diharapkan": "Model prediksi yang lebih akurat dan efisien untuk pengelolaan air limbah menggunakan pendekatan deep learning hibrid.",
    "tantangan": "Menggabungkan arsitektur SAE dan BLSTM untuk menangkap pola temporal dan spasial dari data waktu nyata yang kompleks.",
    "hasil_akhir": "Model SAE-BLSTM berhasil menunjukkan performa prediksi yang baik dan telah disitasi sebanyak 17 kali sejak tahun 2023."
  },

  {
    "judul": "GCN-based LSTM autoencoder with self-attention for bearing fault diagnosis",
    "publisher": "MDPI (Sensors)",
    "author": ["Lee, D", "Choo, H", "Jeong, J"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/1424-8220/24/15/4855",
    "rumusan_masalah": "Bagaimana meningkatkan diagnosis kerusakan bantalan dengan menggunakan arsitektur deep learning yang mampu menangani hubungan spasial dan temporal secara efektif?",
    "penelitian_terkini": "Penelitian ini menggabungkan Graph Convolutional Network (GCN), Long Short-Term Memory (LSTM), dan mekanisme self-attention dalam autoencoder untuk mendiagnosis kerusakan bantalan.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan ketahanan dalam mendeteksi kesalahan bantalan pada sistem mekanik menggunakan model deep learning berbasis GCN dan LSTM.",
    "tantangan": "Mengintegrasikan GCN, LSTM, dan self-attention secara efektif untuk memproses data waktu dan hubungan graf kompleks.",
    "hasil_akhir": "Model yang diusulkan menunjukkan performa diagnosis yang kuat dan telah dikutip 10 kali sejak diterbitkan pada tahun 2024."
  },

  {
    "judul": "RETRACTED: An effective ensemble classification framework for intrusion detection system using LSTM autoencoder",
    "publisher": "Journal of Intelligent & Fuzzy Systems (SAGE Journals)",
    "author": ["Ketepalli, G", "Bulla, P"],
    "tahun": 2024,
    "sumber_data": "https://journals.sagepub.com/doi/abs/10.3233/JIFS-232228",
    "rumusan_masalah": "Bagaimana merancang kerangka klasifikasi ansambel yang efektif untuk sistem deteksi intrusi berbasis LSTM autoencoder?",
    "penelitian_terkini": "Penelitian ini mengusulkan kombinasi LSTM dan autoencoder untuk mendeteksi pola lalu lintas jaringan dan meningkatkan akurasi sistem deteksi intrusi.",
    "hasil_yang_diharapkan": "Meningkatkan performa klasifikasi intrusi dengan memanfaatkan pendekatan ensembel berbasis deep learning.",
    "tantangan": "Artikel ini telah ditarik kembali (retracted), sehingga validitas ilmiah dan hasilnya tidak dapat dijamin.",
    "hasil_akhir": "Meskipun sempat diterbitkan dan dikutip 2 kali, artikel ini telah ditarik kembali, sehingga tidak direkomendasikan untuk dijadikan referensi utama."
  },

  {
    "judul": "Road Traffic Detection with a LSTM Autoencoder using State of Polarization on Deployed Metropolitan Fiber Cable",
    "publisher": "Conference on Optical Network Design and Modeling (ONDM) - IEEE",
    "author": ["Usmani, F", "D'Amico, A", "Bratovich, R", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10144849/",
    "rumusan_masalah": "Bagaimana memanfaatkan LSTM autoencoder untuk mendeteksi pola lalu lintas jalan dengan data optik dari kabel serat optik yang telah dipasang di lingkungan metropolitan?",
    "penelitian_terkini": "Penelitian ini mengembangkan metode deteksi lalu lintas jalan yang tidak bergantung pada kamera atau sensor fisik, melainkan menggunakan sinyal perubahan dalam State of Polarization (SOP) pada kabel fiber.",
    "hasil_yang_diharapkan": "Model LSTM autoencoder mampu mengenali pola lalu lintas jalan secara otomatis menggunakan data optik secara tidak terawasi.",
    "tantangan": "Mengolah data optik dari serat optik yang rentan terhadap noise lingkungan dan fluktuasi kecil serta menjaga akurasi deteksi dalam kondisi nyata.",
    "hasil_akhir": "Model berhasil menunjukkan bahwa LSTM autoencoder dapat digunakan untuk mendeteksi lalu lintas jalan melalui kabel fiber optik tanpa sensor tambahan, dan telah mendapat 4 sitasi sejak 2023."
  },

  {
    "judul": "Comparing Autoencoder and Isolation Forest in Network Anomaly Detection",
    "publisher": "IEEE Xplore (2023 33rd Conference of Open Innovations Association FRUCT)",
    "author": ["Smolen, T", "Benova, L"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10143005/",
    "rumusan_masalah": "Metode mana yang lebih efektif untuk deteksi anomali jaringan: autoencoder berbasis LSTM atau Isolation Forest?",
    "penelitian_terkini": "Penelitian ini membandingkan dua pendekatan populer dalam deteksi anomali jaringan, yaitu model Autoencoder berbasis LSTM dan algoritma Isolation Forest.",
    "hasil_yang_diharapkan": "Menentukan metode mana yang memberikan akurasi lebih tinggi dan lebih efisien dalam mendeteksi anomali jaringan.",
    "tantangan": "Menyesuaikan model dengan jenis data jaringan yang bervariasi serta mengatasi tantangan pada dimensi dan noise data real-world.",
    "hasil_akhir": "Model Autoencoder LSTM menunjukkan performa yang kompetitif terhadap Isolation Forest untuk tugas deteksi anomali, dan telah disitasi 8 kali sejak tahun 2023."
  },

  {
    "judul": "Joint coding-modulation for digital semantic communications via variational autoencoder",
    "publisher": "IEEE (IEEE Transactions on Communications)",
    "author": ["Bo, Y", "Duan, Y", "Shao, S", "Tao, M"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10495330/",
    "rumusan_masalah": "Bagaimana meningkatkan efisiensi dan efektivitas komunikasi semantik digital melalui pendekatan penggabungan coding dan modulasi menggunakan variational autoencoder (VAE)?",
    "penelitian_terkini": "Penelitian ini memanfaatkan VAE untuk merancang sistem komunikasi semantik digital yang menggabungkan proses pengkodean dan modulasi secara end-to-end.",
    "hasil_yang_diharapkan": "Peningkatan efisiensi spektrum dan pemahaman semantik dalam sistem komunikasi digital dengan arsitektur berbasis VAE.",
    "tantangan": "Kompleksitas dalam penggabungan pengkodean dan modulasi dalam ruang semantik, serta kestabilan pelatihan model VAE untuk data kompleks.",
    "hasil_akhir": "Model VAE menunjukkan kinerja unggul dalam komunikasi semantik digital dan telah disitasi sebanyak 57 kali sejak tahun 2024."
  },

  {
    "judul": "A deep learning-based intrusion detection approach for mobile Ad-hoc network",
    "publisher": "Springer (Soft Computing)",
    "author": ["Meddeb, R", "Jemili, F", "Triki, B", "Korbaa, O"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s00500-023-08324-4",
    "rumusan_masalah": "Bagaimana mendeteksi intrusi secara efektif dalam Mobile Ad-hoc Networks (MANET) menggunakan pendekatan deep learning?",
    "penelitian_terkini": "Menggabungkan Stacked Autoencoder dengan CNN dan LSTM untuk membentuk arsitektur deep learning dalam sistem deteksi intrusi pada jaringan MANET.",
    "hasil_yang_diharapkan": "Sistem IDS (Intrusion Detection System) berbasis deep learning yang akurat dan andal dalam mendeteksi anomali pada jaringan bergerak.",
    "tantangan": "Mengelola data jaringan yang dinamis, latensi rendah, dan keterbatasan sumber daya pada node MANET saat melatih model deep learning.",
    "hasil_akhir": "Model berhasil meningkatkan akurasi deteksi intrusi dan telah disitasi sebanyak 40 kali sejak dipublikasikan tahun 2023."
  },

  {
    "judul": "Modbus/rs-485 attack detection on communication signals with machine learning",
    "publisher": "IEEE (Communications)",
    "author": ["Ochiai, H", "Hossain, MD", "Chirupphapa, P", "..."],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10113798/",
    "rumusan_masalah": "Bagaimana mendeteksi serangan pada sinyal komunikasi Modbus/RS-485 menggunakan pendekatan machine learning?",
    "penelitian_terkini": "Penelitian memfokuskan pada penggunaan model autoencoder, termasuk MLP-autoencoder, 1D-CNN autoencoder, dan LSTM-autoencoder untuk deteksi anomali pada komunikasi industri.",
    "hasil_yang_diharapkan": "Pengembangan sistem deteksi serangan yang efektif dan efisien terhadap sinyal komunikasi berbasis Modbus/RS-485.",
    "tantangan": "Menangani keberagaman sinyal dan karakteristik trafik komunikasi industri dengan model yang mampu generalisasi dan memiliki akurasi tinggi.",
    "hasil_akhir": "MLP-autoencoder dipilih sebagai fokus utama, dengan hasil eksperimen menunjukkan efektivitas dalam mendeteksi anomali; artikel ini telah disitasi 12 kali sejak tahun 2023."
  },

  {
    "judul": "CNN autoencoder resizer: A power-efficient LoS/NLoS detector in MIMO-enabled UAV networks",
    "publisher": "IEEE (Communications)",
    "author": ["Akhtarshenas, A", "Ayoobi, N", "..."],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10817279/",
    "rumusan_masalah": "Bagaimana mendeteksi kondisi Line-of-Sight (LoS) dan Non-Line-of-Sight (NLoS) secara efisien dalam jaringan UAV dengan MIMO menggunakan pendekatan deep learning yang hemat daya?",
    "penelitian_terkini": "Mengusulkan arsitektur CNN autoencoder yang diintegrasikan dengan RNN untuk klasifikasi LoS/NLoS pada jaringan ultra-wideband (UWB) ad hoc yang digunakan dalam navigasi dalam ruangan oleh UAV.",
    "hasil_yang_diharapkan": "Sistem deteksi LoS/NLoS dengan efisiensi daya tinggi, akurasi tinggi, dan keandalan yang dapat meningkatkan keselamatan dan kinerja komunikasi UAV.",
    "tantangan": "Menghadapi keterbatasan daya UAV dan memastikan keandalan deteksi sinyal dalam kondisi kanal yang kompleks dan dinamis.",
    "hasil_akhir": "Model CNN-RNN autoencoder menunjukkan hasil menjanjikan dalam deteksi LoS/NLoS dengan efisiensi daya yang lebih baik; telah disitasi 2 kali sejak 2024."
  },

  {
    "judul": "Deep Autoencoder-Based Hybrid Network for Building Energy Consumption Forecasting",
    "publisher": "Computer Systems Science & Engineering (via ResearchGate)",
    "author": ["Khan, N", "Khan, SU"],
    "tahun": 2024,
    "sumber_data": "https://www.researchgate.net/profile/Noman-Khan-23/publication/374912116_Deep_Autoencoder-Based_Hybrid_Network_for_Building_Energy_Consumption_Forecasting/links/65b1b33e6c7ad06ab4279d4a/Deep-Autoencoder-Based-Hybrid-Network-for-Building-Energy-Consumption-Forecasting.pdf",
    "rumusan_masalah": "Bagaimana membangun model prediksi konsumsi energi bangunan yang akurat menggunakan pendekatan deep learning berbasis autoencoder?",
    "penelitian_terkini": "Mengembangkan jaringan hibrida berbasis deep autoencoder yang memanfaatkan LSTM dan convolutional LSTM untuk menangani komponen linier dan nonlinier dari data konsumsi energi.",
    "hasil_yang_diharapkan": "Prediksi konsumsi energi yang lebih akurat dan efisien untuk bangunan dengan mempertimbangkan dinamika linier dan nonlinier dari data historis.",
    "tantangan": "Menangani kompleksitas temporal dan spasial dari data konsumsi energi serta integrasi model linier dan nonlinier dalam satu arsitektur jaringan yang stabil.",
    "hasil_akhir": "Model dua fase (LSTM dan Conv-LSTM) menunjukkan performa yang baik dan telah disitasi sebanyak 5 kali sejak 2024."
  },

  {
    "judul": "Semi-2DCAE: a semi-supervision 2D-CNN AutoEncoder model for feature representation and classification of encrypted traffic",
    "publisher": "PeerJ Computer Science",
    "author": ["Cui, J", "Bai, L", "Li, G", "Lin, Z", "Zeng, P"],
    "tahun": 2023,
    "sumber_data": "https://peerj.com/articles/cs-1635/",
    "rumusan_masalah": "Bagaimana mengklasifikasikan lalu lintas terenkripsi secara efisien menggunakan pendekatan deep learning yang mampu menangani data terbatas dalam skenario semi-supervised?",
    "penelitian_terkini": "Model Semi-2DCAE yang menggabungkan 2D Convolutional AutoEncoder dengan pendekatan semi-supervised untuk representasi fitur dan klasifikasi data jaringan terenkripsi.",
    "hasil_yang_diharapkan": "Peningkatan akurasi klasifikasi terhadap data lalu lintas terenkripsi meskipun hanya tersedia sebagian label (semi-supervised).",
    "tantangan": "Kesulitan dalam menganalisis lalu lintas terenkripsi akibat teknik penyamaran seperti port randomization dan tunneling yang mengaburkan fitur utama.",
    "hasil_akhir": "Model Semi-2DCAE menunjukkan kinerja yang menjanjikan untuk klasifikasi lalu lintas terenkripsi dan telah disitasi sebanyak 5 kali sejak 2023."
  },

  {
    "judul": "Autoencoder application for anomaly detection in power consumption of lighting systems",
    "publisher": "IEEE Access",
    "author": ["Śmiałkowski, T", "Czyżewski, A"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10309114/",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam konsumsi daya sistem pencahayaan secara otomatis dan efektif menggunakan model deep learning?",
    "penelitian_terkini": "Penggunaan Autoencoder yang dikombinasikan dengan LSTM dan jaringan konvolusional 1D untuk deteksi anomali pada data konsumsi energi listrik.",
    "hasil_yang_diharapkan": "Peningkatan kemampuan deteksi dini terhadap pola konsumsi daya yang tidak biasa atau abnormal dalam sistem pencahayaan.",
    "tantangan": "Membedakan anomali nyata dari variasi konsumsi listrik normal serta memilih arsitektur model yang optimal untuk performa tinggi.",
    "hasil_akhir": "Model berhasil menunjukkan efektivitas deteksi anomali pada berbagai jenis pola konsumsi listrik dan telah disitasi sebanyak 3 kali sejak 2023."
  },

  {
    "judul": "Employing Sequence-to-Sequence Stacked LSTM Autoencoder Architecture to Forecast Indian Weather",
    "publisher": "Elsevier - Procedia Computer Science",
    "author": ["Maharatha, A", "Das, R", "Mishra, J", "Nayak, SR"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S1877050924008901",
    "rumusan_masalah": "Bagaimana menerapkan arsitektur Stacked LSTM Autoencoder untuk memprediksi kondisi cuaca di India secara akurat?",
    "penelitian_terkini": "Studi ini mengeksplorasi penggunaan model sequence-to-sequence berbasis Stacked LSTM Autoencoder, serta membandingkannya dengan varian LSTM lainnya seperti vanilla LSTM dan bidirectional LSTM.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prakiraan cuaca harian berdasarkan data time-series iklim India dengan metode deep learning.",
    "tantangan": "Mengelola kompleksitas data sekuensial jangka panjang dan menentukan arsitektur LSTM yang paling optimal untuk prakiraan multivariat.",
    "hasil_akhir": "Model menunjukkan performa prediksi yang menjanjikan untuk prakiraan cuaca di India dan telah disitasi sebanyak 6 kali sejak dipublikasikan pada 2024."
  },

  {
    "judul": "A transferred spatio-temporal deep model based on multi-LSTM auto-encoder for air pollution time series missing value imputation",
    "publisher": "Elsevier - Future Generation Computer Systems",
    "author": ["Zhang, X", "Zhou, P"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S0167739X24000839",
    "rumusan_masalah": "Bagaimana mengatasi hilangnya nilai pada data deret waktu polusi udara menggunakan pendekatan deep learning yang memanfaatkan informasi spasial dan temporal?",
    "penelitian_terkini": "Penelitian ini menggabungkan teknik transfer learning, deep autoencoder (DAE), dan multiple LSTM dalam satu arsitektur untuk mengimputasi nilai yang hilang pada data deret waktu polusi udara.",
    "hasil_yang_diharapkan": "Menghasilkan model yang mampu memprediksi nilai-nilai polusi udara yang hilang dengan akurasi tinggi dengan mempertimbangkan hubungan spasial-temporal antar lokasi pengukuran.",
    "tantangan": "Menggabungkan kompleksitas spasial dan temporal secara efektif dalam satu model deep learning, serta menangani ketidakkonsistenan data yang hilang.",
    "hasil_akhir": "Model yang diusulkan menunjukkan performa yang kompetitif dalam imputasi nilai yang hilang dan telah disitasi sebanyak 10 kali sejak tahun 2024."
  },

  {
    "judul": "Anomaly detection for connected autonomous vehicles using LSTM and Gaussian naïve Bayes",
    "publisher": "Springer - Conference on Wireless",
    "author": ["Mansourian, P", "Zhang, N", "Jaekel, A", "..."],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/chapter/10.1007/978-3-031-34851-8_3",
    "rumusan_masalah": "Bagaimana mendeteksi anomali pada kendaraan otonom yang terhubung (CAV) dengan mempertimbangkan komunikasi internal dan akses jaringan eksternal?",
    "penelitian_terkini": "Penelitian ini mengusulkan metode deteksi anomali berbasis LSTM Autoencoder yang dikombinasikan dengan Gaussian Naïve Bayes dan membandingkan performanya dengan metode lain.",
    "hasil_yang_diharapkan": "Meningkatkan deteksi dini terhadap perilaku anomali dalam sistem kendaraan otonom terhubung dengan akurasi tinggi.",
    "tantangan": "Mengelola kompleksitas data spasial-temporal dari kendaraan otonom dan menjaga akurasi prediksi dalam sistem distribusi komunikasi kendaraan.",
    "hasil_akhir": "Model gabungan LSTM Autoencoder dan Gaussian Naïve Bayes menunjukkan performa yang menjanjikan dan telah disitasi sebanyak 9 kali sejak 2023."
  },

  {
    "judul": "Simultaneous fault detection in satellite power systems using deep autoencoders and classifier chain",
    "publisher": "Springer - Telecommunication Systems",
    "author": ["Ganesan, M", "Lavanya, R"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s11235-023-00998-3",
    "rumusan_masalah": "Bagaimana mendeteksi beberapa jenis gangguan secara simultan pada sistem tenaga satelit dengan akurasi tinggi?",
    "penelitian_terkini": "Penelitian ini mengusulkan penggunaan deep autoencoder bersama classifier chain untuk mengklasifikasikan dan mendeteksi gangguan simultan pada sistem tenaga satelit.",
    "hasil_yang_diharapkan": "Mampu mengenali berbagai jenis gangguan secara bersamaan dan meningkatkan keandalan sistem tenaga satelit.",
    "tantangan": "Mengklasifikasikan banyak jenis gangguan secara bersamaan dan menangani ketidakseimbangan kelas dalam data gangguan.",
    "hasil_akhir": "Model deep autoencoder yang digabungkan dengan classifier chain menunjukkan performa yang baik dalam deteksi gangguan simultan dan telah disitasi 4 kali sejak 2023."
  },

  {
    "judul": "Network Anomaly Detection Using Autoencoder on Various Datasets: A Comprehensive Review",
    "publisher": "Bentham Science - Recent Patents on ...",
    "author": ["Singh, R", "Srivastava, N", "Kumar, A"],
    "tahun": 2024,
    "sumber_data": "https://www.benthamdirect.com/content/journals/eng/10.2174/0118722121242429230922070752",
    "rumusan_masalah": "Bagaimana efektivitas metode autoencoder, khususnya LSTM-autoencoder, dalam mendeteksi anomali jaringan pada berbagai dataset?",
    "penelitian_terkini": "Artikel ini merupakan tinjauan komprehensif tentang metode deteksi anomali jaringan menggunakan autoencoder, dengan fokus pada integrasi LSTM-autoencoder dan OC-SVM.",
    "hasil_yang_diharapkan": "Menunjukkan keunggulan pendekatan LSTM-autoencoder dalam mendeteksi anomali jaringan serta mengevaluasi performanya di berbagai dataset.",
    "tantangan": "Menentukan model autoencoder yang optimal, mengatasi kompleksitas data jaringan, serta membandingkan efektivitas metode di berbagai kondisi dan dataset.",
    "hasil_akhir": "LSTM autoencoder yang dikombinasikan dengan OC-SVM terbukti efektif untuk deteksi anomali jaringan dan telah disitasi sebanyak 12 kali sejak tahun 2024."
  },

  {
    "judul": "Ae-net: Novel autoencoder-based deep features for SQL injection attack detection",
    "publisher": "IEEE",
    "author": ["Thalji, N", "Raza, A", "Islam, MS", "Samee, NA"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10332180/",
    "rumusan_masalah": "Bagaimana merancang pendekatan autoencoder baru yang efektif untuk mendeteksi serangan SQL Injection dalam sistem jaringan?",
    "penelitian_terkini": "Makalah ini memperkenalkan AE-Net, sebuah pendekatan deep learning berbasis autoencoder yang dioptimalkan untuk ekstraksi fitur dalam deteksi serangan SQL Injection.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan efisiensi deteksi serangan SQL Injection dengan memanfaatkan fitur mendalam dari autoencoder.",
    "tantangan": "Mengurangi kesalahan deteksi yang tinggi pada model LSTM konvensional serta mengembangkan model yang mampu menangani data serangan yang kompleks.",
    "hasil_akhir": "AE-Net menunjukkan performa yang unggul dalam deteksi serangan SQL Injection dibanding pendekatan LSTM tradisional. Artikel ini telah disitasi sebanyak 23 kali sejak tahun 2023."
  },

  {
    "judul": "An LSTM-autoencoder based online side channel monitoring approach for cyber-physical attack detection in additive manufacturing",
    "publisher": "Springer",
    "author": ["Shi, Z", "Mamun, AA", "Kan, C", "Tian, W", "Liu, C"],
    "tahun": 2023,
    "sumber_data": "https://link.springer.com/article/10.1007/s10845-021-01879-9",
    "rumusan_masalah": "Bagaimana mendeteksi serangan siber-fisik secara online dalam proses manufaktur aditif melalui analisis sinyal samping (side-channel) menggunakan pembelajaran mendalam?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan monitoring sinyal samping secara online berbasis LSTM-autoencoder untuk mendeteksi anomali akibat serangan siber dalam sistem manufaktur aditif.",
    "hasil_yang_diharapkan": "Mengembangkan sistem pendeteksi serangan yang mampu secara real-time mengenali aktivitas tidak normal berdasarkan pola sinyal yang kompleks.",
    "tantangan": "Menangkap karakteristik waktu dan representasi non-linier dari data sinyal yang rumit dengan akurasi tinggi dan latensi rendah.",
    "hasil_akhir": "Model LSTM-autoencoder berhasil menunjukkan efektivitas tinggi dalam mendeteksi serangan siber di sistem manufaktur aditif. Artikel ini telah disitasi sebanyak 80 kali sejak 2023."
  },

  {
    "judul": "Novelty detection and fault diagnosis method for bearing faults based on the hybrid deep autoencoder network",
    "publisher": "MDPI (Electronics)",
    "author": ["Zhao, Y", "Hao, H", "Chen, Y", "Zhang, Y"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/2079-9292/12/13/2826",
    "rumusan_masalah": "Bagaimana mendeteksi gangguan baru (novelty) dan mendiagnosis kerusakan bantalan secara efektif menggunakan jaringan autoencoder dalam?",
    "penelitian_terkini": "Penelitian ini menggabungkan model LSTM Autoencoder dan Stacked Autoencoder (SAE) sebagai pendekatan hibrida untuk diagnosis kesalahan bantalan.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi dan sensitivitas sistem diagnosis kerusakan dengan memanfaatkan kekuatan dari arsitektur deep learning LSTM dan SAE.",
    "tantangan": "Membangun jaringan hibrida yang kompleks namun efisien yang mampu menangani data getaran bearing secara real-time tanpa overfitting.",
    "hasil_akhir": "Model hibrida menunjukkan kinerja superior dibandingkan metode individual, dengan struktur 8 lapisan neural network dalam LSTM autoencoder. Artikel ini telah disitasi sebanyak 26 kali sejak 2023."
  },

  {
    "judul": "FACT: Autoencoder and Attention Conv-LSTM based Collaborative Framework for Cloud Cover Prediction",
    "publisher": "IEEE",
    "author": ["Patel, M", "Tanwar, S", "Jadav, NK", "Gupta, R", "Pau, G"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10630474/",
    "rumusan_masalah": "Bagaimana memprediksi tutupan awan secara akurat menggunakan pendekatan deep learning yang kolaboratif dan efisien?",
    "penelitian_terkini": "Artikel ini memperkenalkan FACT, kerangka kerja kolaboratif berbasis Autoencoder dan Attention Conv-LSTM untuk prediksi tutupan awan. Dibandingkan Stack-LSTM dan CNN-LSTM.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi tutupan awan dengan menggabungkan reduksi dimensi oleh autoencoder dan pemrosesan spasio-temporal oleh Attention Conv-LSTM.",
    "tantangan": "Mengelola kompleksitas data spasial-temporal dan mengoptimalkan perhatian (attention) dalam jaringan LSTM konvolusional untuk menghasilkan prediksi jangka pendek yang akurat.",
    "hasil_akhir": "FACT berhasil mengurangi dimensi data menggunakan autoencoder dan meningkatkan performa prediksi. Artikel ini telah disitasi sebanyak 2 kali sejak 2024."
  },

  {
    "judul": "A Frequency Domain Predictive Channel Model for 6G Wireless MIMO Communications Based on Deep Learning",
    "publisher": "IEEE",
    "author": ["Huang, C", "Wang, CX", "Li, Z", "Qian, Z", "Li, J"],
    "tahun": 2024,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10466759/",
    "rumusan_masalah": "Bagaimana membangun model prediksi kanal frekuensi domain untuk komunikasi nirkabel 6G MIMO menggunakan pendekatan deep learning yang akurat dan efisien?",
    "penelitian_terkini": "Studi ini mengembangkan model prediktif domain frekuensi berbasis deep learning untuk sistem komunikasi MIMO 6G, memanfaatkan Autoencoder dengan arsitektur alternatif (bukan hanya fully connected) dan jaringan LSTM.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi kanal komunikasi 6G dalam domain frekuensi dengan arsitektur deep learning yang inovatif.",
    "tantangan": "Membangun arsitektur jaringan yang mampu menangkap karakteristik temporal dan frekuensi secara efektif dalam kanal nirkabel 6G.",
    "hasil_akhir": "Model berhasil divalidasi dengan jaringan LSTM dan Autoencoder dengan desain non-konvensional. Artikel ini telah disitasi sebanyak 10 kali sejak 2024."
  },

  {
    "judul": "Intelligent Reflecting Surface Enhanced Wireless Communications With MultiHead-Attention Sparse Autoencoder-Based Channel Prediction",
    "publisher": "IEEE",
    "author": ["Chen, HY", "Wu, MH", "Yang, TW", "Liao, JW"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10231324/",
    "rumusan_masalah": "Bagaimana meningkatkan prediksi kanal dalam sistem komunikasi nirkabel yang diperkuat dengan Intelligent Reflecting Surface (IRS) menggunakan metode deep learning yang efisien?",
    "penelitian_terkini": "Mengusulkan model prediksi kanal berbasis autoencoder denoising sparsely-connected dengan perhatian multi-head (MultiHead-Attention Sparse Autoencoder), sebagai solusi untuk memprediksi kanal dalam sistem IRS.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi prediksi kanal IRS dengan model deep learning yang hemat parameter dan efisien.",
    "tantangan": "Menggabungkan kompleksitas struktur IRS dengan efisiensi dan akurasi model channel prediction berbasis deep learning dalam kondisi nirkabel yang dinamis.",
    "hasil_akhir": "Model yang diusulkan menunjukkan performa yang kompetitif dan telah disitasi 3 kali sejak dipublikasikan pada 2023."
  },

  {
    "judul": "CSI-based human activity recognition using multi-input multi-output autoencoder and fine-tuning",
    "publisher": "MDPI (Sensors)",
    "author": ["Chahoushi, M", "Nabati, M", "Asvadi, R", "Ghorashi, SA"],
    "tahun": 2023,
    "sumber_data": "https://www.mdpi.com/1424-8220/23/7/3591",
    "rumusan_masalah": "Bagaimana meningkatkan akurasi pengenalan aktivitas manusia berbasis CSI (Channel State Information) menggunakan pendekatan autoencoder yang disesuaikan dengan fine-tuning?",
    "penelitian_terkini": "Mengembangkan arsitektur autoencoder multi-input multi-output yang menggabungkan lapisan CNN dan LSTM, dengan fine-tuning untuk klasifikasi aktivitas manusia dari data CSI.",
    "hasil_yang_diharapkan": "Peningkatan performa deteksi aktivitas manusia dengan memanfaatkan autoencoder yang mampu menangkap fitur spasial dan temporal dari data CSI.",
    "tantangan": "Memproses sinyal CSI kompleks dan menangkap dinamika temporal aktivitas manusia secara akurat dalam lingkungan nyata.",
    "hasil_akhir": "Model menunjukkan kinerja yang kompetitif dan telah disitasi sebanyak 12 kali sejak 2023."
  },

  {
    "judul": "Anomaly detection in connected and autonomous vehicle trajectories using LSTM autoencoder and Gaussian mixture model",
    "publisher": "MDPI (Electronics)",
    "author": ["Wang, B", "Li, W", "Khattak, ZH"],
    "tahun": 2024,
    "sumber_data": "https://www.mdpi.com/2079-9292/13/7/1251",
    "rumusan_masalah": "Bagaimana mendeteksi anomali dalam lintasan kendaraan otonom dan terhubung (CAVs) secara efektif menggunakan model deep learning?",
    "penelitian_terkini": "Mengusulkan kombinasi LSTM Autoencoder dan Gaussian Mixture Model (GMM) untuk mendeteksi anomali dalam data lintasan CAVs.",
    "hasil_yang_diharapkan": "Model dapat mengidentifikasi pergerakan kendaraan yang tidak normal atau tidak biasa untuk meningkatkan keselamatan dan keandalan sistem transportasi cerdas.",
    "tantangan": "Menangani kerumitan data lintasan yang bersifat sekuensial dan dinamis dalam lingkungan lalu lintas dunia nyata.",
    "hasil_akhir": "Model gabungan LSTM Autoencoder dan GMM menunjukkan efektivitas dalam mendeteksi anomali dan telah disitasi sebanyak 10 kali sejak 2024."
  },

  {
    "judul": "Underwater wireless optical communication with one-bit quantization: A hybrid autoencoder and generative adversarial network approach",
    "publisher": "IEEE (Transactions on Wireless Communications)",
    "author": ["Zou, C", "Yang, F", "Song, J", "Han, Z"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10044696/",
    "rumusan_masalah": "Bagaimana meningkatkan performa komunikasi optik nirkabel bawah air dengan keterbatasan kuantisasi satu bit?",
    "penelitian_terkini": "Mengusulkan pendekatan hibrida yang menggabungkan Autoencoder (AE) dan Generative Adversarial Network (GAN) untuk meningkatkan efisiensi komunikasi optik bawah air.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi pemulihan sinyal dalam sistem komunikasi optik bawah air yang dibatasi oleh kuantisasi satu bit.",
    "tantangan": "Menghadapi keterbatasan kuantisasi sinyal digital dan lingkungan bawah air yang sangat dinamis dan kompleks.",
    "hasil_akhir": "Model hybrid AE-GAN berhasil meningkatkan performa sistem komunikasi bawah air dan telah disitasi sebanyak 15 kali sejak 2023."
  },

  {
    "judul": "A novel approach of botnet detection using hybrid deep learning for enhancing security in IoT networks",
    "publisher": "Elsevier (Alexandria Engineering Journal)",
    "author": ["Ali, S", "Ghazal, R", "Qadeer, N", "Saidani, O", "Alhayan, F"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S1110016824005830",
    "rumusan_masalah": "Bagaimana mendeteksi botnet secara efektif dalam jaringan IoT yang terus berkembang dengan serangan yang semakin kompleks?",
    "penelitian_terkini": "Mengusulkan pendekatan deteksi botnet berbasis deep learning hibrida dengan menggabungkan LSTM Autoencoders dan Multilayer Perceptron (MLP) khusus untuk keamanan IoT.",
    "hasil_yang_diharapkan": "Deteksi yang lebih akurat terhadap aktivitas botnet dalam jaringan IoT sekaligus mengurangi false positive.",
    "tantangan": "Menghadapi variasi besar dalam pola lalu lintas data IoT dan meningkatkan kemampuan deteksi terhadap serangan yang tidak diketahui sebelumnya.",
    "hasil_akhir": "Model hybrid LSTM Autoencoder + MLP menunjukkan performa tinggi dalam mendeteksi botnet dan telah mendapatkan 17 sitasi sejak tahun 2024."
  },

  {
    "judul": "A novel smartphone-based human activity recognition approach using convolutional autoencoder long short-term memory network",
    "publisher": "IEEE",
    "author": ["Thakur, D", "Roy, S", "Biswas, S", "Ho, ESL"],
    "tahun": 2023,
    "sumber_data": "https://ieeexplore.ieee.org/abstract/document/10229380/",
    "rumusan_masalah": "Bagaimana mengembangkan sistem pengenalan aktivitas manusia (HAR) berbasis smartphone yang akurat dan efisien menggunakan deep learning?",
    "penelitian_terkini": "Menggabungkan arsitektur Convolutional Neural Network (CNN), Autoencoder, dan Long Short-Term Memory (LSTM) untuk meningkatkan akurasi dan efisiensi HAR berbasis smartphone.",
    "hasil_yang_diharapkan": "Model deep learning yang mampu mendeteksi aktivitas manusia secara real-time dengan akurasi tinggi melalui sensor pada smartphone.",
    "tantangan": "Menangani keragaman sinyal sensor dan memastikan efisiensi komputasi agar dapat diterapkan langsung di perangkat mobile.",
    "hasil_akhir": "Model CNN-Autoencoder-LSTM menunjukkan sinergi efektif dalam mengklasifikasi aktivitas manusia dengan 17 sitasi sejak tahun 2023."
  },

  {
    "judul": "Deep learning in physical layer communications: Evolution and prospects in 5G and 6G networks",
    "publisher": "Wiley Online Library",
    "author": ["Mao, C", "Mu, Z", "Liang, Q", "Schizas, I", "Pan, C"],
    "tahun": 2023,
    "sumber_data": "https://ietresearch.onlinelibrary.wiley.com/doi/abs/10.1049/cmu2.12669",
    "rumusan_masalah": "Bagaimana perkembangan dan prospek penerapan deep learning, termasuk autoencoder dan GAN, dalam komunikasi lapisan fisik pada jaringan 5G dan 6G?",
    "penelitian_terkini": "Studi ini meninjau penggunaan berbagai arsitektur deep learning seperti RNN, autoencoder, dan GAN dalam konteks komunikasi lapisan fisik, dengan fokus pada sistem komunikasi masa depan.",
    "hasil_yang_diharapkan": "Menawarkan wawasan tentang bagaimana teknik deep learning dapat meningkatkan efisiensi spektral, keandalan transmisi, dan deteksi sinyal di jaringan 5G dan 6G.",
    "tantangan": "Menghadapi kompleksitas model dan kebutuhan komputasi tinggi, serta keterbatasan dalam generalisasi model deep learning untuk skenario komunikasi yang dinamis.",
    "hasil_akhir": "Artikel ini memberikan kerangka evolusi penggunaan deep learning di lapisan fisik dan telah dikutip sebanyak 14 kali sejak 2023, menandakan relevansinya di bidang jaringan generasi lanjut."
  },

  {
    "judul": "CANival: A multimodal approach to intrusion detection on the vehicle CAN bus",
    "publisher": "Elsevier",
    "author": ["Kang, H", "Vo, T", "Kim, HK", "Hong, JB"],
    "tahun": 2024,
    "sumber_data": "https://www.sciencedirect.com/science/article/pii/S2214209624001207",
    "rumusan_masalah": "Bagaimana mengembangkan metode deteksi intrusi yang efektif untuk sistem komunikasi Controller Area Network (CAN) pada kendaraan, yang pada dasarnya tidak memiliki mekanisme keamanan bawaan?",
    "penelitian_terkini": "Penelitian ini mengusulkan pendekatan multimodal berbasis deep learning untuk menganalisis lalu lintas data CAN bus guna mendeteksi perilaku mencurigakan secara real-time.",
    "hasil_yang_diharapkan": "Meningkatkan akurasi deteksi intrusi dan mengurangi false positives pada sistem komunikasi kendaraan melalui model deteksi yang menggabungkan beberapa sumber data.",
    "tantangan": "Keterbatasan protokol CAN yang tidak menyediakan otentikasi atau enkripsi, serta kebutuhan untuk memproses data dalam waktu nyata di lingkungan sistem tertanam.",
    "hasil_akhir": "CANival terbukti efektif dalam mendeteksi anomali pada CAN bus kendaraan dan telah memperoleh 8 sitasi sejak tahun 2024, menunjukkan kontribusi penting dalam keamanan kendaraan otonom."
  },
  {
    "type": "separator",
    "title": "Cybersecurity",
    "image": "cyber-security.png"
  },
  {
    "judul": "AI-powered ethical hacking: Rethinking cyber security penetration testing",
    "publisher": "researchgate.net",
    "author": ["Hayat, T", "Gatlin, K"],
    "tahun": "2025",
    "sumber_data": "ResearchGate, Feb",
    "url": "https://www.researchgate.net/profile/Kaiser-Gatlin/publication/389313366_AI-Powered_Ethical_Hacking_Rethinking_Cyber_Security_Penetration_Testing/links/67bdbf35645ef274a49428ff/AI-Powered-Ethical-Hacking-Rethinking-Cyber-Security-Penetration-Testing.pdf",
    "rumusan_masalah": "Bagaimana pemanfaatan AI dapat meningkatkan efektivitas ethical hacking dalam mendeteksi kerentanan keamanan siber?",
    "penelitian_terkini": "Penggunaan AI dalam ethical hacking untuk deteksi kerentanan lebih dalam dan cepat.",
    "hasil_yang_diharapkan": "Meningkatkan kemampuan deteksi ancaman dan kerentanan secara otomatis dan akurat.",
    "tantangan": "Ancaman siber yang terus berkembang serta kebutuhan akan pendekatan otomatis dan adaptif dalam keamanan.",
    "hasil_akhir": "AI dapat memberikan insight lebih mendalam untuk ethical hacking dan menjadi pendekatan masa depan untuk keamanan siber."
  },
  {
    "judul": "Advanced ethical hacking techniques using AI and predictive modeling",
    "publisher": "researchgate.net",
    "author": ["Rahul, K", "Spunda, R"],
    "tahun": "2025",
    "sumber_data": "ResearchGate, Feb",
    "url": "https://www.researchgate.net/profile/Rudolf-Spunda-2/publication/389316480_Advanced_Ethical_Hacking_Techniques_Using_AI_and_Predictive_Modeling/links/67bde19e207c0c20fa971750/Advanced-Ethical-Hacking-Techniques-Using-AI-and-Predictive-Modeling.pdf",
    "rumusan_masalah": "Bagaimana teknik ethical hacking dapat ditingkatkan dengan menggabungkan AI dan model prediktif untuk mitigasi ancaman siber?",
    "penelitian_terkini": "Menggunakan AI dan model prediktif untuk otomatisasi deteksi kerentanan dan mitigasi ancaman.",
    "hasil_yang_diharapkan": "Menghasilkan pendekatan ethical hacking yang lebih cepat, akurat, dan adaptif terhadap ancaman siber.",
    "tantangan": "Integrasi AI secara etis dan efektif dalam proses ethical hacking serta tantangan akurasi prediksi.",
    "hasil_akhir": "AI-driven ethical hacking dapat melampaui sekadar penetration testing dengan prediksi dan tindakan proaktif."
  },
  {
    "judul": "Ethical Hacking's Role in Enhancing AI-Based Threat Detection Systems",
    "publisher": "researchgate.net",
    "author": ["Gulfara, A", "Wallace, G"],
    "tahun": "2025",
    "sumber_data": "",
    "url": "https://www.researchgate.net/profile/Gabrielle-Wallace-5/publication/389320023_Ethical_Hacking's_Role_in_Enhancing_AI-Based_Threat_Detection_Systems/links/67be18a296e7fb48b9cddcd6/Ethical-Hackings-Role-in-Enhancing-AI-Based-Threat-Detection-Systems.pdf",
    "rumusan_masalah": "Bagaimana kontribusi ethical hacking dalam meningkatkan sistem deteksi ancaman berbasis AI?",
    "penelitian_terkini": "Menggabungkan hasil penetration testing dan asesmen kerentanan untuk pelatihan sistem AI deteksi ancaman.",
    "hasil_yang_diharapkan": "Menghasilkan sistem deteksi ancaman AI yang lebih akurat dengan data yang dikumpulkan dari praktik ethical hacking.",
    "tantangan": "Mengelola kompleksitas dan keberagaman ancaman siber yang terus berkembang.",
    "hasil_akhir": "Data dari ethical hacking terbukti penting dalam memperkuat kemampuan AI dalam mendeteksi ancaman siber secara cerdas."
  },
  {
    "judul": "The Convergence of AI and Cybersecurity: An Examination of ChatGPT's Role in Penetration Testing and its Ethical and Legal Implications",
    "publisher": "ntnuopen.ntnu.no",
    "author": ["Heim, MP", "Starckjohann, N", "Torgersen, M"],
    "tahun": "2023",
    "sumber_data": "",
    "url": "https://ntnuopen.ntnu.no/ntnu-xmlui/handle/11250/3076387",
    "rumusan_masalah": "Apa implikasi etis dan hukum dari penggunaan AI seperti ChatGPT dalam penetration testing di dunia keamanan siber?",
    "penelitian_terkini": "Analisis peran ChatGPT dalam tahap-tahap ethical hacking seperti network discovery, scanning, dan exploitasi.",
    "hasil_yang_diharapkan": "Menilai bagaimana AI generatif dapat membantu dan sekaligus menimbulkan risiko dalam pengujian keamanan.",
    "tantangan": "Perubahan lanskap ancaman dengan munculnya malware berbasis AI dan isu hukum terkait penggunaan LLM.",
    "hasil_akhir": "ChatGPT dapat digunakan dalam penetration testing namun memunculkan dilema etis dan hukum yang signifikan."
  },
  {
    "judul": "The Role of Ethical Hacking and AI in Proactive Cyber Defense: Current Approaches and Future Perspectives",
    "publisher": "researchgate.net",
    "author": ["Gopalsamy, M", "Dastageer, KB"],
    "tahun": "2025",
    "sumber_data": "Int. J. Innov. Sci. Res. Technol",
    "url": "https://www.researchgate.net/profile/Mani-Gopalsamy-2/publication/390283997_The_Role_of_Ethical_Hacking_and_AI_in_Proactive_Cyber_Defense_Current_Approaches_and_Future_Perspectives/links/67e764e249e91c0feac44ef8/The-Role-of-Ethical-Hacking-and-AI-in-Proactive-Cyber-Defense-Current-Approaches-and-Future-Perspectives.pdf",
    "rumusan_masalah": "Bagaimana AI dan ethical hacking dapat diintegrasikan untuk menciptakan pertahanan siber proaktif terhadap ancaman yang berkembang?",
    "penelitian_terkini": "Pendekatan terkini menggabungkan data pen-test dan AI untuk mendeteksi serta merespons kerentanan keamanan sebelum dieksploitasi.",
    "hasil_yang_diharapkan": "Sistem pertahanan siber yang mampu belajar dan merespons ancaman secara mandiri dan adaptif.",
    "tantangan": "Meningkatnya kompleksitas serangan serta kebutuhan akan sistem AI yang dapat dipercaya dan akurat.",
    "hasil_akhir": "AI dan ethical hacking saling melengkapi untuk membangun sistem keamanan siber proaktif berbasis pembelajaran mesin."
  },
  {
    "judul": "PenTest++: Elevating Ethical Hacking with AI and Automation",
    "publisher": "arxiv.org",
    "author": ["Al-Sinani, HS", "Mitchell, CJ"],
    "tahun": "2025",
    "sumber_data": "arXiv preprint arXiv:2502.09484",
    "url": "https://arxiv.org/abs/2502.09484",
    "rumusan_masalah": "Bagaimana AI dan otomatisasi dapat meningkatkan efisiensi dan efektivitas proses penetration testing di tengah meningkatnya ancaman terhadap AI itu sendiri?",
    "penelitian_terkini": "Pengembangan sistem PenTest++ yang mengintegrasikan AI untuk mempercepat dan mengoptimalkan ethical hacking, sekaligus mengatasi serangan adversarial terhadap AI.",
    "hasil_yang_diharapkan": "Peningkatan akurasi, efisiensi, dan cakupan dalam proses penetration testing menggunakan AI dan otomasi.",
    "tantangan": "Ancaman terhadap AI itu sendiri dari serangan adversarial, serta kompleksitas integrasi AI dalam sistem keamanan yang dapat dipercaya.",
    "hasil_akhir": "PenTest++ mampu meningkatkan proses ethical hacking secara signifikan melalui pendekatan otomatis dan berbasis kecerdasan buatan."
  },
  {
    "judul": "Artificial intelligence–based ethical hacking for health information systems: simulation study",
    "publisher": "jmir.org",
    "author": ["He, Y", "Zamani, E", "Yevseyeva, I", "Luo, C"],
    "tahun": "2023",
    "sumber_data": "Journal of medical Internet research",
    "url": "https://www.jmir.org/2023/1/e41748/",
    "rumusan_masalah": "Bagaimana penggunaan AI dalam ethical hacking dapat meningkatkan perlindungan sistem informasi kesehatan (HIS)?",
    "penelitian_terkini": "Simulasi penggunaan alat penetration testing berbasis AI untuk mengevaluasi dan melindungi keamanan sistem HIS.",
    "hasil_yang_diharapkan": "Mendapatkan wawasan baru dalam melindungi sistem informasi kesehatan melalui integrasi AI dalam ethical hacking.",
    "tantangan": "Risiko performa rendah atau kesalahan deteksi saat menggunakan AI di lingkungan HIS yang kompleks.",
    "hasil_akhir": "Pendekatan AI memberikan potensi signifikan untuk memperkuat keamanan HIS, meskipun tetap ada risiko yang harus dimitigasi."
  },
  {
    "judul": "Ethical Challenges of Penetration Testers",
    "publisher": "search.proquest.com",
    "author": ["McDonald, L"],
    "tahun": "2024",
    "sumber_data": "",
    "url": "https://search.proquest.com/openview/57b30a9ae6f502cbe3e3a6f4cd129165/1?pq-origsite=gscholar&cbl=18750&diss=y",
    "rumusan_masalah": "Apa saja tantangan etis yang dihadapi oleh penetration tester, terutama dalam konteks insider threats dan penggunaan AI?",
    "penelitian_terkini": "Analisis metodologi penetration testing dan bagaimana AI serta machine learning mulai diintegrasikan ke dalam proses ini.",
    "hasil_yang_diharapkan": "Identifikasi kerangka kerja etis dan prosedur terbaik untuk penetration testing modern.",
    "tantangan": "Etika eksploitasi dalam pengujian sistem oleh pihak internal dan tantangan moral dalam penggunaan AI untuk testing otomatis.",
    "hasil_akhir": "Penelitian menyarankan integrasi AI dan ML secara hati-hati dalam penetration testing sambil mempertimbangkan pertimbangan etis."
  },
  {
    "judul": "Enhancing Penetration Testing: Leveraging Machine Learning for Ethical Hacking",
    "publisher": "Springer",
    "author": ["Hadi, MH", "Al-Saedi, KH"],
    "tahun": "2024",
    "sumber_data": "… Informatics, Networking, and Cybersecurity",
    "url": "https://link.springer.com/chapter/10.1007/978-3-031-81065-7_15",
    "rumusan_masalah": "Bagaimana Machine Learning dapat digunakan untuk meningkatkan efektivitas penetration testing dalam praktik ethical hacking?",
    "penelitian_terkini": "Penggunaan AI dan ML untuk mengidentifikasi kerentanan paling mungkin dieksploitasi dan membantu dalam perencanaan manajemen ancaman siber.",
    "hasil_yang_diharapkan": "Sistem ethical hacking berbasis ML yang mampu meningkatkan kecepatan dan ketepatan dalam deteksi serta manajemen ancaman.",
    "tantangan": "Kebutuhan akan data yang akurat untuk pelatihan model ML dan penyesuaian algoritma terhadap ancaman yang terus berkembang.",
    "hasil_akhir": "ML terbukti efektif dalam mendukung ethical hacking dengan mengotomatisasi identifikasi celah keamanan dan strategi mitigasinya."
  },
  {
    "judul": "AI-Based ethical hacking for health information systems (HIS): a simulation study",
    "publisher": "repository.essex.ac.uk",
    "author": ["He, Y", "Efpraxia, DZ", "Yevseyeva, I", "..."],
    "tahun": "2023",
    "sumber_data": "Journal of Medical …",
    "url": "https://repository.essex.ac.uk/34669/",
    "rumusan_masalah": "Bagaimana pendekatan ethical hacking berbasis AI dapat meningkatkan keamanan sistem informasi kesehatan (HIS)?",
    "penelitian_terkini": "Studi simulasi yang mengusulkan penggunaan alat penetration testing berbasis AI untuk mendeteksi eksploitasi dalam HIS.",
    "hasil_yang_diharapkan": "Memberikan wawasan baru tentang perlindungan keamanan HIS melalui kombinasi teknologi AI dan ethical hacking.",
    "tantangan": "Risiko menurunnya kinerja atau false positives dalam penerapan AI di lingkungan HIS.",
    "hasil_akhir": "AI dapat meningkatkan keamanan HIS secara signifikan, tetapi harus diimplementasikan dengan hati-hati agar tidak menimbulkan efek negatif terhadap performa sistem."
  }
]
